IDEA Open Model
StrainLoadOnLine Properties
The StrainLoadOnLine type exposes the following members.
Properties
Name | Description
Bimp
 Gets or sets the strain impulse at the begin position.
Eimp
 Gets or sets the strain impulse at the end position.
Geometry
 PolyLine3D or Segment3D
RelativeBeginPosition
 Beginnig position on ISegment3D
RelativeEndPosition
 End position on ISegment3D
Top
See Also
Reference
StrainLoadOnLine Class
IdeaRS.OpenModel.Loading Namespace