IDEA Open Model
LoadCase Properties
The LoadCase type exposes the following members.
Properties
Name | Description
Description
 Additional info
LoadGroup
 Load group
LoadsInPoint
 List of point load impulses in this load case
LoadsOnLine
 List of line load impulses in this load case
LoadsOnSurface
 List surafce load in this load case
LoadType
 Load case type
Name
 Name of load case
PointLoadsOnLine
 List of point load impulses in this load case
Settlements
 Settlements in this load case
StrainLoadsOnLine
 List of generalized strain load impulses along the line in this load case.
TemperatureLoadsOnLine
 List of temperature load in this load case
Type
 Sub type
Variable
 Variable type
Top
See Also
Reference
LoadCase Class
IdeaRS.OpenModel.Loading Namespace