IDEA Open Model
ISDModel Properties
The ISDModel type exposes the following members.
Properties
Name | Description
Geometry
 All geometrical entities of Detail
ISDType
 Type of IDEA StatiCa Detail
Loading
 All loading entities of Detail
Reinforcement
 All reinforcement of Detail
Setting
 Setting
Top
See Also
Reference
ISDModel Class
IdeaRS.OpenModel.Detail Namespace