IDEA Open Model
MatSteelAUS Properties
The MatSteelAUS type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
Top
See Also
Reference
MatSteelAUS Class
IdeaRS.OpenModel.Material Namespace