IDEA Open Model
ReinfBarByTwoPoints Properties
The ReinfBarByTwoPoints type exposes the following members.
Properties
Name | Description
BarDistance
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Distance
 Distance between reinforcement layers
MasterComponent1
 First master component of reinforcement
MasterComponent2
 Second master component of reinforcement
MasterPoint1
 First master point of reinforcement
MasterPoint2
 Second master point of reinforcement
NumOfLayers
 Number of layers
Position1
 Offset between first master point and first point of bar
Position2
 Offset between second master point and second point of bar
Top
See Also
Reference
ReinfBarByTwoPoints Class
IdeaRS.OpenModel.Detail Namespace