IDEA Open Model
HingeElement1D Properties
The HingeElement1D type exposes the following members.
Properties
Name | Description
HingeTypeRX
 Hinge type in dirrection round X
HingeTypeRY
 Hinge type in dirrection round Y
HingeTypeRZ
 Hinge type in dirrection round Z
HingeTypeX
 Hinge type in dirrection X
HingeTypeY
 Hinge type in dirrection Y
HingeTypeZ
 Hinge type in dirrection Z
InitialStiffnessRX
 Initial stiffness rotational RX
InitialStiffnessRY
 Initial stiffness rotational RY
InitialStiffnessRZ
 Initial stiffness rotational RZ
InitialStiffnessX
 Initial stiffness X dirrection
InitialStiffnessY
 Initial stiffness Y dirrection
InitialStiffnessZ
 Initial stiffness Z dirrection
Top
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace