IDEA Open Model
MatSteel Class
 Material steel base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelAISC
 IdeaRS.OpenModel.Material.MatSteelAUS
 IdeaRS.OpenModel.Material.MatSteelCISC
 IdeaRS.OpenModel.Material.MatSteelEc2
 IdeaRS.OpenModel.Material.MatSteelRUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public abstract class MatSteel : Material
Public MustInherit Class MatSteel
	Inherits Material
public ref class MatSteel abstract : public Material
The MatSteel type exposes the following members.
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace