IDEA Open Model
CombiInputEC Properties
The CombiInputEC type exposes the following members.
Properties
Name | Description
TypeCalculationCombi
 Type of combination
TypeCombiEC
 Type of EC combination
Top
See Also
Reference
CombiInputEC Class
IdeaRS.OpenModel.Loading Namespace