IDEA Open Model
MatSteelEc2 Properties
The MatSteelEc2 type exposes the following members.
Properties
Name | Description
DiagramType
 Type of material diagram
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fu40
 Ultimate strength for nominal thickness of the element > 40mm and <= 100mm - fu,(>40)
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
fy40
 Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)
UserDiagram
 Stress-strain diagram defined by user
Top
See Also
Reference
MatSteelEc2 Class
IdeaRS.OpenModel.Material Namespace