IDEA Open Model
ErrorMessage Properties
The ErrorMessage type exposes the following members.
Properties
Name | Description
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Top
See Also
Reference
ErrorMessage Class
IdeaRS.OpenModel.Message Namespace