IDEA Open Model
MatReinforcementCHN Properties
Compatible with IDEA StatiCa 20.1
The MatReinforcementCHN type exposes the following members.
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
MatReinforcementCHN Class
IdeaRS.OpenModel.Material Namespace