IDEA Open Model
LoadGroupEC Properties
Compatible with IDEA StatiCa 20.1
The LoadGroupEC type exposes the following members.
Properties
Name | Description
Psi0
 ψ 0
Psi1
 ψ 1
Psi2
 ψ 2
Top
See Also
Reference
LoadGroupEC Class
IdeaRS.OpenModel.Loading Namespace