IDEA Open Model
MatConcreteRUS Properties
Compatible with IDEA StatiCa 20.1
The MatConcreteRUS type exposes the following members.
Properties
Name | Description
Fck
 Compressive strength of concrete
Top
See Also
Reference
MatConcreteRUS Class
IdeaRS.OpenModel.Material Namespace