IDEA Open Model
ParameterInt Properties
Compatible with IDEA StatiCa 20.1
The ParameterInt type exposes the following members.
Properties
Name | Description
Value
 Value
Top
See Also
Reference
ParameterInt Class
IdeaRS.OpenModel.CrossSection Namespace