IDEA Open Model
CrossSectionGeneralColdFormed Properties
Compatible with IDEA StatiCa 20.1
The CrossSectionGeneralColdFormed type exposes the following members.
Properties
Name | Description
Centerline
 Centerline of cross-section made from linear segments
CrossSectionType
 Type of cross-section
Material
 Material of cross-section
Radius
 Inner rounding radius between linear segments of centerline
Thickness
 Thickness of thin wall cross-section
Top
See Also
Reference
CrossSectionGeneralColdFormed Class
IdeaRS.OpenModel.CrossSection Namespace