IDEA Open Model
PointResultOfNLA Properties
Compatible with IDEA StatiCa 20.1
The PointResultOfNLA type exposes the following members.
Properties
Name | Description
AxialForce
 Axial force
AxialStrain
 Axial strain
AxialStress
 Axial stress
Top
See Also
Reference
PointResultOfNLA Class
IdeaRS.OpenModel.Result Namespace