IDEA Open Model
RebarGeneral Properties
Compatible with IDEA StatiCa 20.1
The RebarGeneral type exposes the following members.
Properties
Name | Description
PlaneNormal
 Normal vector of the plane where the rebar lie. Used to deterine if this rebar is stirrup.
RebarType
 Rebar type
Top
See Also
Reference
RebarGeneral Class
IdeaRS.OpenModel.Model Namespace