IDEA Open Model
MatReinforcementHKG Properties
Compatible with IDEA StatiCa 20.1
The MatReinforcementHKG type exposes the following members.
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
MatReinforcementHKG Class
IdeaRS.OpenModel.Material Namespace