IDEA Open Model
MatConcreteAUS Properties
Compatible with IDEA StatiCa 20.1
The MatConcreteAUS type exposes the following members.
Properties
Name | Description
Fcc
 Compressive strength of concrete
Top
See Also
Reference
MatConcreteAUS Class
IdeaRS.OpenModel.Material Namespace