IDEA Open Model
PatchDevice Properties
Compatible with IDEA StatiCa 20.1
The PatchDevice type exposes the following members.
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Position
 Offset between MasterPoint and patch support/load
Top
See Also
Reference
PatchDevice Class
IdeaRS.OpenModel.Detail Namespace