IDEA Open Model
LoadGroupSIA Properties
Compatible with IDEA StatiCa 20.1
The LoadGroupSIA type exposes the following members.
Properties
Name | Description
Psi0
 ψ 0
Psi1
 ψ 1
Psi2
 ψ 2
Top
See Also
Reference
LoadGroupSIA Class
IdeaRS.OpenModel.Loading Namespace