IDEA Open Model
ConnectedMember Properties
Compatible with IDEA StatiCa 20.1
The ConnectedMember type exposes the following members.
Properties
Name | Description
IsContinuous
 IsContinuous
Length
 Length of the member
MemberId
 MemberId
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Top
See Also
Reference
ConnectedMember Class
IdeaRS.OpenModel.Connection Namespace