IDEA Open Model
RebarStirrupPattern Properties
Compatible with IDEA StatiCa 20.1
The RebarStirrupPattern type exposes the following members.
Properties
Name | Description
AddFirstStirrup
 true: add first stirrup for this pattern. used do exclude the first stirrup in patterns > first.
Distance
 Gets or sets the distance between rebars for this pattern.
Translation
 Gets or sets the local eccentricity in X and Y direction apply transfotmation at 3D (section 3D) then transform to 3D.
Top
See Also
Reference
RebarStirrupPattern Class
IdeaRS.OpenModel.Model Namespace