IDEA Open Model
NadSetupValueBool Properties
Compatible with IDEA StatiCa 20.1
The NadSetupValueBool type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
NadSetupValueBool Class
IdeaRS.OpenModel.Concrete Namespace