IDEA Open Model
AnchorGrid Class
Compatible with IDEA StatiCa 20.1
 Data of the anchor grid
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.BoltGrid
 IdeaRS.OpenModel.Connection.AnchorGrid
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class AnchorGrid : BoltGrid
Public Class AnchorGrid
	Inherits BoltGrid
The AnchorGrid type exposes the following members.
Constructors
Name | Description
AnchorGrid
Initializes a new instance of the AnchorGrid class
Top
Properties
Name | Description
ConcreteBlock
 Data of concrete block
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace