IDEA Open Model
LineSupportSegment Class
Compatible with IDEA StatiCa 20.1
 Line support on segment
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.LineSupportSegment
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class LineSupportSegment : OpenElementId
Public Class LineSupportSegment
	Inherits OpenElementId
The LineSupportSegment type exposes the following members.
Constructors
Name | Description
LineSupportSegment
Initializes a new instance of the LineSupportSegment class
Top
Properties
Name | Description
FlexibleStiffnessRX
 Support stiffness rotational RX
FlexibleStiffnessRY
 Support stiffness rotational RY
FlexibleStiffnessRZ
 Support stiffness rotational RZ
FlexibleStiffnessX
 Support stiffness X dirrection
FlexibleStiffnessY
 Support stiffness Y dirrection
FlexibleStiffnessZ
 Support stiffness Z dirrection
LocalCoordinateSystem
 Support local coord system
Segment
 Reference to geometrical segment3D
SupportTypeRX
 Support type in dirrection round X
SupportTypeRY
 Support type in dirrection round Y
SupportTypeRZ
 Support type in dirrection round Z
SupportTypeX
 Support type in dirrection X
SupportTypeY
 Support type in dirrection Y
SupportTypeZ
 Support type in dirrection Z
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace