IDEA Open Model
Reinforcement Class
Compatible with IDEA StatiCa 20.1
 Base class representing reinforcement in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.Hanging
 IdeaRS.OpenModel.Detail.HangingAroundPatch
 IdeaRS.OpenModel.Detail.ReinfFabric
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class Reinforcement : OpenElementId
Public MustInherit Class Reinforcement
	Inherits OpenElementId
The Reinforcement type exposes the following members.
Constructors
Name | Description
Reinforcement
Initializes a new instance of the Reinforcement class
Top
Properties
Name | Description
Material
 Material
ReinfId
 Id representing reinforcement in Detail
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace