IDEA Open Model
ResultOfInteractionDiagramPlane Class
Compatible with IDEA StatiCa 20.1
 Result of Interaction diagram in plane
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.ResultOfInteractionDiagramPlane
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ResultOfInteractionDiagramPlane : SectionResultBase
Public Class ResultOfInteractionDiagramPlane
	Inherits SectionResultBase
The ResultOfInteractionDiagramPlane type exposes the following members.
Constructors
Name | Description
ResultOfInteractionDiagramPlane
 Constructor
Top
Properties
Name | Description
LoadChart
 Polygon of Load
Plane
 Polygon of interaction diagram plane
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace