IDEA Open Model
SetupValueDouble Class
Compatible with IDEA StatiCa 20.1
 Setup value double
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueDouble
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SetupValueDouble : SetupValue
Public Class SetupValueDouble
	Inherits SetupValue
The SetupValueDouble type exposes the following members.
Constructors
Name | Description
SetupValueDouble
Initializes a new instance of the SetupValueDouble class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace