IDEA Open Model
SetupValueLong Class
Compatible with IDEA StatiCa 20.1
 Setup value long
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueLong
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SetupValueLong : SetupValue
Public Class SetupValueLong
	Inherits SetupValue
The SetupValueLong type exposes the following members.
Constructors
Name | Description
SetupValueLong
Initializes a new instance of the SetupValueLong class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace