IDEA Open Model
ResultClass Class
Compatible with IDEA StatiCa 20.1
 ResultClass object
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.ResultClass
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ResultClass : OpenElementId
Public Class ResultClass
	Inherits OpenElementId
The ResultClass type exposes the following members.
Constructors
Name | Description
ResultClass
 constructor
Top
Properties
Name | Description
Description
 Description of IResultClass
IdConstructionStage
 Id of IConstructionStage, 0 == IConstructionStage is not defined
ListItem
 List of objects in this library
Name
 Name of ResultClass
Nonlinear
 Class contains nonlinear combinations (loaded as loadcase)
TypeResultClass
 TypeResultsClass
TypeUpdateResultClass
 Type of update RC. If TypeUpdateResultClass is Update, ListItem will be updated
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace