IDEA Open Model
ConcreteULSCheckResultResponse Class
Compatible with IDEA StatiCa 20.1
 ULS CheckResponce base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultResponse
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultResponseEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class ConcreteULSCheckResultResponse : ConcreteCheckResultBase
Public MustInherit Class ConcreteULSCheckResultResponse
	Inherits ConcreteCheckResultBase
The ConcreteULSCheckResultResponse type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultResponse
Initializes a new instance of the ConcreteULSCheckResultResponse class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace