IDEA Open Model
Point3D Class
Compatible with IDEA StatiCa 20.1
 Represents an x- , y- an z-coordinates in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.Point3D
 IdeaRS.OpenModel.Model.RebarPoint3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Point3D : OpenElementId
Public Class Point3D
	Inherits OpenElementId
The Point3D type exposes the following members.
Constructors
Name | Description
Point3D
Initializes a new instance of the Point3D class
Top
Properties
Name | Description
Name
 Gets or sets the Name
X
 Gets or sets the X-coordinate value
Y
 Gets or sets the Y-coordinate value
Z
 Gets or sets the Z-coordinate value
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace