IDEA Open Model
RebarGeneral Class
Compatible with IDEA StatiCa 20.1
 Represents a single main rebar in 3D space. Holds data from generated rebar or rebar imported from Tekla. the rebarShape is in global coordinates and it is not possible to prject it along Member1D, Polyline, ... (referenceLine)
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarBase
 IdeaRS.OpenModel.Model.RebarGeneral
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarGeneral : RebarBase
Public Class RebarGeneral
	Inherits RebarBase
The RebarGeneral type exposes the following members.
Constructors
Name | Description
RebarGeneral
 create a new instance.
Top
Properties
Name | Description
PlaneNormal
 Normal vector of the plane where the rebar lie. Used to deterine if this rebar is stirrup.
RebarType
 Rebar type
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace