IDEA Open Model
ParameterInt Class
Compatible with IDEA StatiCa 20.1
 Integer parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterInt
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ParameterInt : Parameter
Public Class ParameterInt
	Inherits Parameter
The ParameterInt type exposes the following members.
Constructors
Name | Description
ParameterInt
Initializes a new instance of the ParameterInt class
Top
Properties
Name | Description
Value
 Value
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace