IDEA Open Model
MatPrestressSteelEc2 Class
Compatible with IDEA StatiCa 20.1
 Material prestressing steel Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatPrestressSteel
 IdeaRS.OpenModel.Material.MatPrestressSteelEc2
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatPrestressSteelEc2 : MatPrestressSteel
Public Class MatPrestressSteelEc2
	Inherits MatPrestressSteel
The MatPrestressSteelEc2 type exposes the following members.
Constructors
Name | Description
MatPrestressSteelEc2
 Constructor
Top
Properties
Name | Description
Agt
 Total elongation at max. force (prEN 10138)
DiagramType
 Type of diagram
Epsuk
 Characteristic strain at maximum load (EN 1992-1-1)
Fm
 Char. value of max. force (prEN 10138)
Fp01
 Char. 0.1% proof force
Fp01k
 0,1% proof-stress (EN 1992-1-1)
Fpk
 Characteristic tensile strength (EN 1992-1-1)
Fr
 Fatigue stress range (prEN 10138)
Production
 Production type
SurfaceCharacteristic
 Surface characteristic
Type
 Type of prestress steel
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace