IDEA Open Model
SetupValueInt Class
Compatible with IDEA StatiCa 20.1
 Setup value int
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueInt
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SetupValueInt : SetupValue
Public Class SetupValueInt
	Inherits SetupValue
The SetupValueInt type exposes the following members.
Constructors
Name | Description
SetupValueInt
Initializes a new instance of the SetupValueInt class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace