IDEA Open Model
MatPrestressSteelSIA Class
Compatible with IDEA StatiCa 20.1
 Material prestressing steel SIA
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatPrestressSteel
 IdeaRS.OpenModel.Material.MatPrestressSteelSIA
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatPrestressSteelSIA : MatPrestressSteel
Public Class MatPrestressSteelSIA
	Inherits MatPrestressSteel
The MatPrestressSteelSIA type exposes the following members.
Constructors
Name | Description
MatPrestressSteelSIA
 Constructor
Top
Properties
Name | Description
DiagramType
 Type of diagram
Epsud
 dimensioning value of ultimate strain of reinforcing steel or prestressing steel
Epsuk
 characteristic value of ultimate strain of reinforcing steel or strain at maximum load for prestressing steel
Fp01k
 characteristic value of yield strength of prestressing steel
Fpd
 dimensioning value of yield strength of prestressing steel
Fpk
 characteristic value of tensile strength of prestressing steel
SurfaceCharacteristic
 Surface characteristic
Type
 Type of prestress steel
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace