IDEA Open Model
RebarPatternBase Class
Compatible with IDEA StatiCa 20.1
 Represents a base class for Rebar Pattern
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarPatternBase
 IdeaRS.OpenModel.Model.RebarStirrupPattern
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class RebarPatternBase : OpenElementId
Public MustInherit Class RebarPatternBase
	Inherits OpenElementId
The RebarPatternBase type exposes the following members.
Constructors
Name | Description
RebarPatternBase
Initializes a new instance of the RebarPatternBase class
Top
Properties
Name | Description
EndPosition
 This defines end position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
Relative
 Mode of defining the position of the pattern false is for absolute length (position) of the pattern (default) true is for relative length (position) of the pattern in range [0 1]
StartPosition
 This defines begin position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace