IDEA Open Model
Segment3D Class
Compatible with IDEA StatiCa 20.1
 Represents a segment in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.Segment3D
 IdeaRS.OpenModel.Geometry3D.ArcSegment3D
 IdeaRS.OpenModel.Geometry3D.LineSegment3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class Segment3D : OpenElementId
Public MustInherit Class Segment3D
	Inherits OpenElementId
The Segment3D type exposes the following members.
Constructors
Name | Description
Segment3D
Initializes a new instance of the Segment3D class
Top
Properties
Name | Description
EndPoint
 Gets or sets the reference to Point3D endpoint of the segment.
LocalCoordinateSystem
 Local coordinate system
StartPoint
 Gets or sets the reference to Point3D startpoint of the segment.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace