IDEA Open Model
MatReinforcementRUS Class
Compatible with IDEA StatiCa 20.1
 Material reinforcement RUS
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementRUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatReinforcementRUS : MatReinforcement
Public Class MatReinforcementRUS
	Inherits MatReinforcement
The MatReinforcementRUS type exposes the following members.
Constructors
Name | Description
MatReinforcementRUS
 Constructor
Top
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace