IDEA Open Model
BoltAssembly Class
Compatible with IDEA StatiCa 20.1
 Bolt assembly
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.BoltAssembly
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class BoltAssembly : OpenElementId
Public Class BoltAssembly
	Inherits OpenElementId
The BoltAssembly type exposes the following members.
Constructors
Name | Description
BoltAssembly
Initializes a new instance of the BoltAssembly class
Top
Properties
Name | Description
BoltGrade
 Bolt grade
Borehole
 Size of borehole
DiagonalHeadDiameter
 Second diameter of the head
Diameter
 Bolt diameter
GrossArea
 Gross cross-section area
HeadDiameter
 Diameter of the head
HeadHeight
 Thickness of head
Name
 Name of bolt assembly
NutThickness
 Thickness of Nut
TensileStressArea
 Tensile stress area
WasherAtHead
 Washer at head side of bolt assembly
WasherAtNut
 Is washer at Nut side of bolt assembly
WasherThickness
 Thickness of washer
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace