IDEA Open Model
Wall Class
Compatible with IDEA StatiCa 20.1
 Representation of Wall in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Element2D
 IdeaRS.OpenModel.Detail.Wall
 IdeaRS.OpenModel.Detail.WallRect
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Wall : Element2D, IGeometryPart
Public Class Wall
	Inherits Element2D
	Implements IGeometryPart
The Wall type exposes the following members.
Constructors
Name | Description
Wall
 Constructor
Top
Properties
Name | Description
Edges
 Lines of Element2D including edges, which are created by opening
GeomId
 Id representing geometrical parts of Detail
InsertPoint
 Insert point 0 - 9
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Name
 Name
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace