IDEA Open Model
MatPrestressSteel Class
Compatible with IDEA StatiCa 20.1
 Material prestressing steel base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatPrestressSteel
 IdeaRS.OpenModel.Material.MatPrestressSteelEc2
 IdeaRS.OpenModel.Material.MatPrestressSteelSIA
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class MatPrestressSteel : Material
Public MustInherit Class MatPrestressSteel
	Inherits Material
The MatPrestressSteel type exposes the following members.
Constructors
Name | Description
MatPrestressSteel
Initializes a new instance of the MatPrestressSteel class
Top
Properties
Name | Description
Area
 Area
Diameter
 Diameter
EquivalentDiameter
 Equivalent diameter
NumberOfWires
 number of wires in strand
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace