IDEA Open Model
ReinfBarByTwoPoints Class
Compatible with IDEA StatiCa 20.1
 Representing reinforcement bar input by two points in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ReinfBarByTwoPoints : ReinforcementGroup
Public Class ReinfBarByTwoPoints
	Inherits ReinforcementGroup
The ReinfBarByTwoPoints type exposes the following members.
Constructors
Name | Description
ReinfBarByTwoPoints
 Constructor
Top
Properties
Name | Description
BarDistance
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Distance
 Distance between reinforcement layers
MasterComponent1
 First master component of reinforcement
MasterComponent2
 Second master component of reinforcement
MasterPoint1
 First master point of reinforcement
MasterPoint2
 Second master point of reinforcement
NumOfLayers
 Number of layers
Position1
 Offset between first master point and first point of bar
Position2
 Offset between second master point and second point of bar
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace