IDEA Open Model
Hanging Class
Compatible with IDEA StatiCa 20.1
 Representing hanging in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.Hanging
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Hanging : Reinforcement
Public Class Hanging
	Inherits Reinforcement
The Hanging type exposes the following members.
Constructors
Name | Description
Hanging
 Constructor
Top
Properties
Name | Description
Angle
 Angle between braches
BottomLength
 Length of inside part of anchor
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
EdgeOrientationType
 Edge orientation type
EndsType
 End type of the reinforcement bar - same for both ends
HangingType
 Type of hanging
LegsLength
 Length of legs
MasterComponent
 Master component of hanging
MasterEdge
 Master edge of hanging
PositionOnEdge
 Position on edge
Radius
 Radius of top loop
UpperLength
 Length of upper part of hanging
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace