IDEA Open Model
RebarBase Class
Compatible with IDEA StatiCa 20.1
 Represents a base class for Rebars in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarBase
 IdeaRS.OpenModel.Model.RebarGeneral
 IdeaRS.OpenModel.Model.RebarSingle
 IdeaRS.OpenModel.Model.RebarStirrups
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class RebarBase : OpenElementId
Public MustInherit Class RebarBase
	Inherits OpenElementId
The RebarBase type exposes the following members.
Constructors
Name | Description
RebarBase
Initializes a new instance of the RebarBase class
Top
Properties
Name | Description
Diameter
 Gets or sets the Rebar Diameter.
GroupId
 identity for group identification number
Material
 Gets or sets the reference of material properties.
RebarAllocationElement
 the element where this rebar belongs (part of that beam)
RebarParentElement
 Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
RebarShape
 Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace