IDEA Open Model
LoadCase Class
Compatible with IDEA StatiCa 20.1
 Load case in the model
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.LoadCase
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class LoadCase : OpenElementId
Public Class LoadCase
	Inherits OpenElementId
The LoadCase type exposes the following members.
Constructors
Name | Description
LoadCase
 Constructor
Top
Properties
Name | Description
Description
 Additional info
LoadGroup
 Load group
LoadsInPoint
 List of point load impulses in this load case
LoadsOnLine
 List of line load impulses in this load case
LoadsOnSurface
 List surafce load in this load case
LoadType
 Load case type
Name
 Name of load case
PointLoadsOnLine
 List of point load impulses in this load case
Settlements
 Settlements in this load case
StrainLoadsOnLine
 List of generalized strain load impulses along the line in this load case.
TemperatureLoadsOnLine
 List of temperature load in this load case
Type
 Sub type
Variable
 Variable type
Top
Examples
 This sample shows how to create a load case.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);
//Load case
LoadCase loadCase = new LoadCase();
loadCase.Name = "LC1";
loadCase.LoadType = LoadCaseType.Permanent;
loadCase.Type = LoadCaseSubType.PermanentStandard;
loadCase.Variable = VariableType.NotSet;
loadCase.LoadGroup = new ReferenceElement(loadGroup);
openModel.AddObject(loadCase);
See Also
Reference
IdeaRS.OpenModel.Loading Namespace