IDEA Open Model
ReinfBarOnEdge Class
Compatible with IDEA StatiCa 20.1
 Representing reinforcement bar input on edge in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.ReinfBarOnEdge
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ReinfBarOnEdge : ReinforcementGroup
Public Class ReinfBarOnEdge
	Inherits ReinforcementGroup
The ReinfBarOnEdge type exposes the following members.
Constructors
Name | Description
ReinfBarOnEdge
 Constructor
Top
Properties
Name | Description
AnchorLength
 Anchor length of main bars, if MasterComponent is opening
BarDistance
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Distance
 Distance between reinforcement layers
EdgePositionType
 Position of reinforcement on edge
ExtendDistanceBegin
 Distance of extension of beginning
ExtendDistanceEnd
 Distance of extension of end
ExtendTypeBegin
 type of extension of beginning of bar
ExtendTypeEnd
 type of extension of end of bar
Length
 length of bar
MasterComponent
 Master component of reinforcement
MasterEdge
 Master edge on Outline of MasterComponent
NumOfLayers
 Number of layers
PositionOnEdge
 Position of beginning of bar from start or end of edge
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace