IDEA Open Model
CrossSectionGeneralColdFormed Class
Compatible with IDEA StatiCa 20.1
 Creates one item cross-section of general cold formed profile defined by it´s center line
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.CrossSection.CrossSection
 IdeaRS.OpenModel.CrossSection.CrossSectionGeneralColdFormed
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class CrossSectionGeneralColdFormed : CrossSection
Public Class CrossSectionGeneralColdFormed
	Inherits CrossSection
The CrossSectionGeneralColdFormed type exposes the following members.
Constructors
Name | Description
CrossSectionGeneralColdFormed
 Constructor
Top
Properties
Name | Description
Centerline
 Centerline of cross-section made from linear segments
CrossSectionType
 Type of cross-section
Material
 Material of cross-section
Radius
 Inner rounding radius between linear segments of centerline
Thickness
 Thickness of thin wall cross-section
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace