IDEA Open Model
CheckMember1D Class
Compatible with IDEA StatiCa 20.1
 Check meber 1D
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.CheckMember
 IdeaRS.OpenModel.Model.CheckMember1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class CheckMember1D : CheckMember
Public Class CheckMember1D
	Inherits CheckMember
The CheckMember1D type exposes the following members.
Constructors
Name | Description
CheckMember1D
 Constructor
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace