IDEA Open Model
MatReinforcement Properties
Compatible with IDEA StatiCa v 10.1
The MatReinforcement type exposes the following members.
Properties
Name | Description
BarSurface
 Surface of bar
Top
See Also
Reference
MatReinforcement Class
IdeaRS.OpenModel.Material Namespace