IDEA Open Model
WeldParam Properties
Compatible with IDEA StatiCa v 10.1
The WeldParam type exposes the following members.
Properties
Name | Description
Size
 Gets or sets the size of the weld
WeldType
 Gets or sets the type of the weld
Top
See Also
Reference
WeldParam Class
IdeaRS.OpenModel.Parameters Namespace