IDEA Open Model
PointOnLine3D Properties
Compatible with IDEA StatiCa v 10.1
The PointOnLine3D type exposes the following members.
Properties
Name | Description
Geometry
 Gets or sets the reference to PolyLine3D line or Segment3D segment.
IsFromStart
 Gets or sets the position value is measured from the start or the ent of the line.
IsRelative
 Gets or sets absolute or relative representation of the position value.
Position
 Gets or sets the position value on the line.
Top
See Also
Reference
PointOnLine3D Class
IdeaRS.OpenModel.Geometry3D Namespace