IDEA Open Model
SetupValueShort Properties
Compatible with IDEA StatiCa v 10.1
The SetupValueShort type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
SetupValueShort Class
IdeaRS.OpenModel.Concrete Namespace