IDEA Open Model
ConcreteSLSCheckResultStressLimitationEc2 Properties
Compatible with IDEA StatiCa v 10.1
The ConcreteSLSCheckResultStressLimitationEc2 type exposes the following members.
Properties
Name | Description
LimitStress
 type of SLS limit stress check
Stress
 type of SLS limit stress check
TypeCheck
 type of SLS limit stress check
Top
See Also
Reference
ConcreteSLSCheckResultStressLimitationEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace