IDEA Open Model
MatSteelAUS Properties
Compatible with IDEA StatiCa v 10.1
The MatSteelAUS type exposes the following members.
Properties
Name | Description
fu
 Default ultimate strength for nominal thickness of the element - fu
fy
 Default yield strength for nominal thickness of the element - fy
MaterialStrength
 Material strength for specific thickness of plate
PhiOMFu
 Overstrength coefficient for fu
PhiOMFy
 Overstrength coefficient for fy
Top
See Also
Reference
MatSteelAUS Class
IdeaRS.OpenModel.Material Namespace