IDEA Open Model
ReinfBarOnEdge Properties
Compatible with IDEA StatiCa v 10.1
The ReinfBarOnEdge type exposes the following members.
Properties
Name | Description
AnchorLength
 Anchor length of main bars, if MasterComponent is opening
BarDistance
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
Distance
 Distance between reinforcement layers
EdgePositionType
 Position of reinforcement on edge
ExtendDistanceBegin
 Distance of extension of beginning
ExtendDistanceEnd
 Distance of extension of end
ExtendTypeBegin
 type of extension of beginning of bar
ExtendTypeEnd
 type of extension of end of bar
Length
 length of bar
MasterComponent
 Master component of reinforcement
MasterEdge
 Master edge on Outline of MasterComponent
NumOfLayers
 Number of layers
PositionOnEdge
 Position of beginning of bar from start or end of edge
Top
See Also
Reference
ReinfBarOnEdge Class
IdeaRS.OpenModel.Detail Namespace