IDEA Open Model
StagedCheckSectionExtreme Properties
Compatible with IDEA StatiCa v 10.1
The StagedCheckSectionExtreme type exposes the following members.
Properties
Name | Description
Time
 Time
Top
See Also
Reference
StagedCheckSectionExtreme Class
IdeaRS.OpenModel.Concrete Namespace