IDEA StatiCa Open Model
ConcreteULSCheckResultFatigueEc2 Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConcreteULSCheckResultFatigueEc2 type exposes the following members.
Properties
Name | Description
DecissionMethod
 decision fatigue check
InternalForceMax
 internal forces for fatigue calculation max
InternalForceMin
 internal forces for fatigue calculation min
Top
See Also
Reference
ConcreteULSCheckResultFatigueEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace