IDEA Open Model
CrossSectionCreepCoefficientAttribute Properties
Compatible with IDEA StatiCa 20.1
The CrossSectionCreepCoefficientAttribute type exposes the following members.
Properties
Name | Description
Components
 List of components
Top
See Also
Reference
CrossSectionCreepCoefficientAttribute Class
IdeaRS.OpenModel.CrossSection Namespace