IDEA StatiCa Open Model
TemperatureCurve2D Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The TemperatureCurve2D type exposes the following members.
Properties
Name | Description
Temperature
 The temperature [K]
Top
See Also
Reference
TemperatureCurve2D Class
IdeaRS.OpenModel.Geometry2D Namespace