IDEA StatiCa Open Model
ConnectionPoint Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConnectionPoint type exposes the following members.
Properties
Name | Description
BearingMember
 Bearing Member
ConnectedMembers
 Connected members as collection of IDs.
Name
 Name of Element
Node
 Node
NodeId |  Obsolete.
 Id of node
ProjectFileName
 Set filename for Connection
Top
See Also
Reference
ConnectionPoint Class
IdeaRS.OpenModel.Connection Namespace