IDEA StatiCa Open Model
MatConcreteIND Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatConcreteIND type exposes the following members.
Properties
Name | Description
Fck
 Compressive strength of concrete
Top
See Also
Reference
MatConcreteIND Class
IdeaRS.OpenModel.Material Namespace