IDEA Open Model
MatPrestressSteelSIA Properties
Compatible with IDEA StatiCa Beta 20.0
The MatPrestressSteelSIA type exposes the following members.
Properties
Name | Description
DiagramType
 Type of diagram
Epsud
 dimensioning value of ultimate strain of reinforcing steel or prestressing steel
Epsuk
 characteristic value of ultimate strain of reinforcing steel or strain at maximum load for prestressing steel
Fp01k
 characteristic value of yield strength of prestressing steel
Fpd
 dimensioning value of yield strength of prestressing steel
Fpk
 characteristic value of tensile strength of prestressing steel
SurfaceCharacteristic
 Surface characteristic
Type
 Type of prestress steel
Top
See Also
Reference
MatPrestressSteelSIA Class
IdeaRS.OpenModel.Material Namespace