IDEA Open Model
ReinfAroundOpening Properties
Compatible with IDEA StatiCa 20.1
The ReinfAroundOpening type exposes the following members.
Properties
Name | Description
AnchorLength
 Anchor length of main bars
DiagonalDiameter
 Diameter of diagonal reinforcement
DiagonalDistance
 Distance between diagonal reinforcement layers
DiagonalEndsType
 End type of diagonal reinforcement bar
DiagonalLength
 length of diagonal bar
DiagonalNumOfBarsInLayer
 Number of diagonal bars in layer
DiagonalNumOfLayers
 Number of diagonal layers
DiagonalReinforcement
 Add diagonal reinforcement
Distance
 Distance between reinforcement layers
MasterComponent
 Master component of reinforcement
NumOfLayers
 Number of layers
Top
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace