IDEA StatiCa Open Model
BeamData Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The BeamData type exposes the following members.
Properties
Name | Description
AddedMember
 Added member
AddedMemberLength
 Added beam lenght
AutoAddCutByWorkplane
 Automaticali add cut by workplane if it not defined
CrossSectionType
 Type of cross section
Cuts
 Cuts on the beam
IsAdded
 Is added beam
IsBearingMember
 Is beam bearing member
IsNegativeObject
 Is negative object
MirrorY
 Mirror by Y
MprlName
 MPRL name of beam
Name
 Name of the beam
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Plates
 Plates of the beam
RefLineInCenterOfGravity
 The reference line of the member is in the center of gravity of the cross-section
Top
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace