IDEA StatiCa Open Model
BentUpBar Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The BentUpBar type exposes the following members.
Properties
Name | Description
AddAnchor
 Add anchor to bent up bar
Angle
 Angle between bar and master edge
AnchorLength
 Length of anchor for bent up bar
BottomLength
 Length of additional bar on the bottom
IsOnLeft
 Bar is on left or right side of member1D
MasterComponent
 Master component of reinforcement
Offset
 Offset of bent-Up bar from left/right edge
TopLength
 Length of additional bar on the top
Top
See Also
Reference
BentUpBar Class
IdeaRS.OpenModel.Detail Namespace