IDEA StatiCa Open Model
ResultOfLoading Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ResultOfLoading type exposes the following members.
Properties
Name | Description
Items
 Items od loading
Top
See Also
Reference
ResultOfLoading Class
IdeaRS.OpenModel.Result Namespace