IDEA StatiCa Open Model
LineSupport Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The LineSupport type exposes the following members.
Properties
Name | Description
Direction
 local / global
EdgePositionType
 edge position type
GeneralLine
 general shape
GeometryPointsPath
 list of line load points
GeomId
 Id representing geometrical parts of Detail
IsPressureOnlyY
 pressure only for Y
IsUserStiffnessX
 true for user stiffness
IsUserStiffnessY
 true for user stiffness
MasterComponent
 Gets or sets the master component
MasterEdge
 master component edge
Name
 Gets or set the name
OnWallEdge
 true to add line support on wall edge
PositionOnEdge
 position od edge
Rz
 rotation Rz
StiffnessRz
 support stiffness Rz
StiffnessX
 support stiffness X
StiffnessY
 support stiffness Y
SupportLength
 support lengtj
TypeEdgePosition
 edge position type
X
 displacement in X
Y
 displacement in Y
Top
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace