IDEA Open Model
ConcreteULSCheckResultDiagramCapacity Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteULSCheckResultDiagramCapacity type exposes the following members.
Properties
Name | Description
Fu
 calculated ultimate internal forces
Fu1
 calculated ultimate internal forces
Fu2
 calculated ultimate internal forces
CheckMethod
 method of check
Top
See Also
Reference
ConcreteULSCheckResultDiagramCapacity Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace