IDEA StatiCa Open Model
Element1D Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Element1D type exposes the following members.
Properties
Name | Description
CrossSectionBegin
 Gets, sets cross section located in the begining of this element1D
CrossSectionEnd
 Gets, sets cross section located at the end of this element1D
EccentricityBeginX
 Local eccentricity X at the begin of Element1D
EccentricityBeginY
 Local eccentricity Y at the begin of Element1D
EccentricityBeginZ
 Local eccentricity Z at the begin of Element1D
EccentricityEndX
 Local eccentricity X at the end of Element1D
EccentricityEndY
 Local eccentricity Y at the end of Element1D
EccentricityEndZ
 Local eccentricity Z at the end of Element1D
Name
 Name of Element
RotationRx
 Rotation of Cross-section of Element1D. Difference from default Line LCS
Segment
 Line segment with start point and end point
Top
See Also
Reference
Element1D Class
IdeaRS.OpenModel.Model Namespace