IDEA StatiCa Open Model
AnchorGrid Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The AnchorGrid type exposes the following members.
Properties
Name | Description
ConcreteBlock
 Data of concrete block
Top
See Also
Reference
AnchorGrid Class
IdeaRS.OpenModel.Connection Namespace