IDEA Open Model
ReinforcementGroup Properties
Compatible with IDEA StatiCa Beta 20.0
The ReinforcementGroup type exposes the following members.
Properties
Name | Description
Cover
 Cover of reinforcement
CoverFromSetting
 Use cover from DetailModelSetting
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
EndsTypeBeg
 End type of the beginning of reinforcement bar
EndsTypeEnd
 End type of the end of reinforcement bar
NumOfBarsInLayer
 Number of bars in layer
Top
See Also
Reference
ReinforcementGroup Class
IdeaRS.OpenModel.Detail Namespace