IDEA StatiCa Open Model
AnchorParam Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The AnchorParam type exposes the following members.
Properties
Name | Description
AnchorTypeData
 Gets or sets the various type of anchor.
AnchorTypeSize
 Gets or sets the size of washer plate.
Length
 Gets or sets the anchor length.
Top
See Also
Reference
AnchorParam Class
IdeaRS.OpenModel.Parameters Namespace