IDEA Open Model
CheckSection Properties
Compatible with IDEA StatiCa 20.1
The CheckSection type exposes the following members.
Properties
Name | Description
Description
 Description of this section
Extremes
 Section extremes
CheckMember
 CheckMember
ReinfSection
 Reinforcement of cross-section
Top
See Also
Reference
CheckSection Class
IdeaRS.OpenModel.Concrete Namespace