IDEA Open Model
ConcreteULSCheckResultInteractionEc2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteULSCheckResultInteractionEc2 type exposes the following members.
Properties
Name | Description
CheckValueShearAndTorsion
 Calculated value of the exploitation of the cross-section (for interaction of shear and torsion) related to the limit value
CheckValueShearTorsionAndBending
 Calculated value of the exploitation of the cross-section (for interaction of shear, torsion and bending) related to the limit value
Medy
 Design value of the applied bending moment around y axis
Medz
 Design value of the applied bending moment around z axis
Ned
 Design value of the applied axial force
Ted
 Design value of the applied torsional moment
Ved
 Design value of the applied shear force
Top
See Also
Reference
ConcreteULSCheckResultInteractionEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace