IDEA Open Model
SetupValueFloat Properties
Compatible with IDEA StatiCa 20.1
The SetupValueFloat type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
SetupValueFloat Class
IdeaRS.OpenModel.Concrete Namespace