IDEA StatiCa Open Model
Wall Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Wall type exposes the following members.
Properties
Name | Description
Edges
 Lines of Element2D including edges, which are created by opening
GeomId
 Id representing geometrical parts of Detail
InsertPoint
 Insert point 0 - 9
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Name
 Name
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Top
See Also
Reference
Wall Class
IdeaRS.OpenModel.Detail Namespace