IDEA StatiCa Open Model
ResultOfInternalForces Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ResultOfInternalForces type exposes the following members.
Properties
Name | Description
Mx
 Bending moment around x-axis
My
 Bending moment around y-axis
Mz
 Bending moment around z-axis
N
 Normal force
Qy
 Shear force in y dirrection
Qz
 Shear force in z dirrection
Top
See Also
Reference
ResultOfInternalForces Class
IdeaRS.OpenModel.Result Namespace