IDEA Open Model
InformationMessage Properties
Compatible with IDEA StatiCa Beta 20.0
The InformationMessage type exposes the following members.
Properties
Name | Description
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Top
See Also
Reference
InformationMessage Class
IdeaRS.OpenModel.Message Namespace