IDEA Open Model
HangingAroundPatch Properties
Compatible with IDEA StatiCa 20.1
The HangingAroundPatch type exposes the following members.
Properties
Name | Description
BottomPartLength
 Length of bottom part
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
DistanceFromPatch
 Distance from patch support/load
EndsType
 End type of the reinforcement bar - same for both ends
InclinedPartsAngle
 Inclination of inclined parts
InclinedPartsLength
 Length of inclined parts
IsMirrored
 Add same reinforcement on oposide side (rotated 180°)
LegsLength
 Length of legs
MasterComponent
 Master component of hanging
NumOfBarsInLayer
 Number of bars in layer
Rotation
 Angle of reinforcement rotation around patch point
Top
See Also
Reference
HangingAroundPatch Class
IdeaRS.OpenModel.Detail Namespace