IDEA StatiCa Open Model
MatSteelCHN Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatSteelCHN type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength
fy
 Yield strength
PhiOMFu
 Overstrength coefficient for fu
PhiOMFy
 Overstrength coefficient for fy
Top
See Also
Reference
MatSteelCHN Class
IdeaRS.OpenModel.Material Namespace