IDEA Open Model
MatReinforcementCAN Properties
Compatible with IDEA StatiCa 20.1
The MatReinforcementCAN type exposes the following members.
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
MatReinforcementCAN Class
IdeaRS.OpenModel.Material Namespace