IDEA StatiCa Open Model
LoadOnSurface Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The LoadOnSurface type exposes the following members.
Properties
Name | Description
Direction
 Load direction LCS or GCS
Fx
 Force in X direction
Fy
 Force in Y direction
Fz
 Force in Z direction
Geometry
 Gets, sets geometry of this LoadOnSurface
Top
See Also
Reference
LoadOnSurface Class
IdeaRS.OpenModel.Loading Namespace