IDEA Open Model
CalculationCase Properties
Compatible with IDEA StatiCa Beta 20.0
The CalculationCase type exposes the following members.
Properties
Name | Description
IsActive
 active load case/combination
Name
 Gets or set the name
Top
See Also
Reference
CalculationCase Class
IdeaRS.OpenModel.Detail.Loading Namespace