IDEA StatiCa Open Model
SetupValueLong Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The SetupValueLong type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
SetupValueLong Class
IdeaRS.OpenModel.Concrete Namespace