IDEA StatiCa Open Model
RebarHookBend Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarHookBend type exposes the following members.
Properties
Name | Description
Angle
 Bending Angle in X-Y Plane.
Length
 Length of the Hook.
Radius
 Bending Radius. It will override Vertex Radius in case of RebarArcRadVertex3D and RebarArcRadVertex3D.
Top
See Also
Reference
RebarHookBend Class
IdeaRS.OpenModel.Model Namespace