IDEA Open Model
ProjectDataConcreteEc2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ProjectDataConcreteEc2 type exposes the following members.
Properties
Name | Description
CodeEN1992_2
 Flag if code EN 1992-2 is included
CodeEN1992_3
 Flag if code EN 1992-2 is included
Top
See Also
Reference
ProjectDataConcreteEc2 Class
IdeaRS.OpenModel.Concrete Namespace