IDEA Open Model
ParameterDouble Properties
Compatible with IDEA StatiCa 20.1
The ParameterDouble type exposes the following members.
Properties
Name | Description
Value
 Value
Top
See Also
Reference
ParameterDouble Class
IdeaRS.OpenModel.CrossSection Namespace