IDEA Open Model
ParameterBool Properties
Compatible with IDEA StatiCa 20.1
The ParameterBool type exposes the following members.
Properties
Name | Description
Value
 Value
Top
See Also
Reference
ParameterBool Class
IdeaRS.OpenModel.CrossSection Namespace