IDEA StatiCa Open Model
Segment3D Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Segment3D type exposes the following members.
Properties
Name | Description
EndPoint
 Gets or sets the reference to Point3D endpoint of the segment.
LocalCoordinateSystem
 Local coordinate system
StartPoint
 Gets or sets the reference to Point3D startpoint of the segment.
Top
See Also
Reference
Segment3D Class
IdeaRS.OpenModel.Geometry3D Namespace