IDEA Open Model
ResultClass Properties
Compatible with IDEA StatiCa Beta 20.0
The ResultClass type exposes the following members.
Properties
Name | Description
Description
 Description of IResultClass
IdConstructionStage
 Id of IConstructionStage, 0 == IConstructionStage is not defined
ListItem
 List of objects in this library
Name
 Name of ResultClass
Nonlinear
 Class contains nonlinear combinations (loaded as loadcase)
TypeResultClass
 TypeResultsClass
TypeUpdateResultClass
 Type of update RC. If TypeUpdateResultClass is Update, ListItem will be updated
Top
See Also
Reference
ResultClass Class
IdeaRS.OpenModel.Loading Namespace