IDEA Open Model
RebarPoint3D Properties
Compatible with IDEA StatiCa 20.1
The RebarPoint3D type exposes the following members.
Properties
Name | Description
BendRadius
 Gets or sets the radius of the Arc
Top
See Also
Reference
RebarPoint3D Class
IdeaRS.OpenModel.Model Namespace