IDEA StatiCa Open Model
BoltParam Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The BoltParam type exposes the following members.
Properties
Name | Description
Angles
 Gets or sets the groups and positions for angles.
BoltInteraction
 Indicates type of shear transfer
Cols
 Gets or sets the columns of fasteners positions.
ColsGridType
 Gets or sets the type of cols - regular or shifted.
ColsNegative
 Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
ColsPosition
 Gets or sets the position, to which are bolt columns realted to.
ColsSymmetry
 Gets or sets the type of symmetry of columns positions.
CoordinateSystem
 Gets or sets the coordinate system type.
Counts
 Gets or sets the count of bolts in the circle (polar coordinate system).
PolarInput
 Gets or sets the type, that spefifies polar input.
PolarPosition
 Gets or sets the position, to which are bolt radii realted to (polar coordinate system).
Positions
 Gets or sets the fasteners positions {X, Y}.
Radii
 Gets or sets the radii of bolts (polar coordinate system).
Rows
 Gets or sets the rows of a fasteners positions. Absolute positions of groups, in group are relative positions.
RowsGridType
 Gets or sets the type of rows - regular or shifted.
RowsNegative
 Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
RowsPosition
 Gets or sets the position, to which are bolt rows realted to.
RowsSymmetry
 Gets or sets the type of symmetry of rows positions.
ShearInThread
 Indicates, whether a shear plane is in the thread of a bolt.
Top
See Also
Reference
BoltParam Class
IdeaRS.OpenModel.Parameters Namespace