IDEA Open Model
RebarSegment3DArc3Pts Properties
Compatible with IDEA StatiCa 20.1
The RebarSegment3DArc3Pts type exposes the following members.
Properties
Name | Description
ThirdPoint
 Gets or sets the point of circular arc somewhere between start and end point.
Top
See Also
Reference
RebarSegment3DArc3Pts Class
IdeaRS.OpenModel.Model Namespace