IDEA Open Model
InitialImperfectionOfPoint Properties
Compatible with IDEA StatiCa Beta 20.0
The InitialImperfectionOfPoint type exposes the following members.
Properties
Name | Description
Displacement
 Displacement of structure point
Point
 Reference to geometrical point
Top
See Also
Reference
InitialImperfectionOfPoint Class
IdeaRS.OpenModel.Model Namespace