IDEA StatiCa Open Model
ColumnDataEc2 Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ColumnDataEc2 type exposes the following members.
Properties
Name | Description
BracedY
 Braced structure Y-Y
BracedZ
 Braced structure Z-Z
Calculation2ndOrderEffect
 Use calculation of 2nd order effect
EffectConsidered
 Effect considered
GeometricImperfectionsSLS
 Use calculation geometric imperfections for SLS
GeometricImperfectionsULS
 Use calculation geometric imperfections for ULS
NumberOfVerticalMembersY
 Gets or sets the number of vertical member in Y direction.
NumberOfVerticalMembersZ
 Gets or sets the number of vertical member in Z direction.
SecondOrderEffectMethod
 Type of calculation method of 2nd order effect
TotalL
 Gets or sets the total length of building
UserValuec0Y
 c0 user value - for nominal stiffness
UserValuec0Z
 c0 user value - for nominal stiffness
UserValuecY
 c user value - for nominal stiffness
UserValuecZ
 c user value - for nominal stiffness
ValueTypeOfc0Y
 Type of c0 value
ValueTypeOfc0Z
 Type of c0 value
ValueTypeOfcY
 Type of c value - for nominal curvature
ValueTypeOfcZ
 Type of c value - for nominal curvature
Top
See Also
Reference
ColumnDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace