IDEA StatiCa Open Model
MatSteelHKG Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatSteelHKG type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength - Yu
fy
 Yield strength - Ys
GammaOVfu
 Overstrength coefficient for fu
GammaOVfy
 Overstrength coefficient for fy
MaterialStrength
 Material strength for specific thickness of plate
Top
See Also
Reference
MatSteelHKG Class
IdeaRS.OpenModel.Material Namespace