IDEA StatiCa Open Model
WarningMessage Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The WarningMessage type exposes the following members.
Properties
Name | Description
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Top
See Also
Reference
WarningMessage Class
IdeaRS.OpenModel.Message Namespace