IDEA StatiCa Open Model
MaterialBoltGradeHKG Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MaterialBoltGradeHKG type exposes the following members.
Properties
Name | Description
Pbb
 Design bearing strength
Ps
 Design shear strength
Pt
 Design tension strength
Top
See Also
Reference
MaterialBoltGradeHKG Class
IdeaRS.OpenModel.Material Namespace