IDEA Open Model
DesignMember Properties
Compatible with IDEA StatiCa Beta 20.0
The DesignMember type exposes the following members.
Properties
Name | Description
Members
 Array of Member1D
Name
 Name of Element
Top
See Also
Reference
DesignMember Class
IdeaRS.OpenModel.Model Namespace