IDEA Open Model
SectionResultOnPoints Properties
Compatible with IDEA StatiCa 20.1
The SectionResultOnPoints type exposes the following members.
Properties
Name | Description
Points
 Section points
Top
See Also
Reference
SectionResultOnPoints Class
IdeaRS.OpenModel.Result Namespace