IDEA StatiCa Open Model
MatSteelIND Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatSteelIND type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength
fy
 Yield strength
GammaOVfu
 Overstrength coefficient for fu
GammaOVfy
 Overstrength coefficient for fy
Top
See Also
Reference
MatSteelIND Class
IdeaRS.OpenModel.Material Namespace