IDEA StatiCa Open Model
MatReinforcementIND Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatReinforcementIND type exposes the following members.
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
MatReinforcementIND Class
IdeaRS.OpenModel.Material Namespace