IDEA StatiCa Open Model
RebarShape Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarShape type exposes the following members.
Properties
Name | Description
EndHook
 Gets or sets the end rebar hook.
SourceGeometry
 Gets or sets the segments of the rebar shape.
StartHook
 Gets or sets the start rebar hook.
Top
See Also
Reference
RebarShape Class
IdeaRS.OpenModel.Model Namespace