IDEA StatiCa Open Model
MaterialBoltGrade Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MaterialBoltGrade type exposes the following members.
Properties
Name | Description
Code
 Design code
Elongation
 Elongation after fracture - for 20% elongation use value 0.2
fub
 Ultimate tensile strength
fyb
 Yield strength
MprlElementID
 Name fo the bolt grade in MPRL database
MprlTableID
 Unique ID of MPRL database table where the bolt grade was taken from.
Top
See Also
Reference
MaterialBoltGrade Class
IdeaRS.OpenModel.Material Namespace