IDEA StatiCa Open Model
OpeningCirc Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The OpeningCirc type exposes the following members.
Properties
Name | Description
Diameter
 Diameter of opening
Top
See Also
Reference
OpeningCirc Class
IdeaRS.OpenModel.Detail Namespace