IDEA StatiCa Open Model
LoadGroup Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The LoadGroup type exposes the following members.
Properties
Name | Description
Dzeta
 ζ
GammaGInf
 γ G,Inf
GammaGSup
 γ G,Sup
GammaQ
 γ Q
GroupType
 Group type
Name
 Name of load group
Relation
 Relation
Top
See Also
Reference
LoadGroup Class
IdeaRS.OpenModel.Loading Namespace