IDEA StatiCa Open Model
RebarStirrups Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarStirrups type exposes the following members.
Properties
Name | Description
Patterns
 Gets or sets the pattern of the rebar grouping. Holds distance between rebars/stirrups and length
Top
See Also
Reference
RebarStirrups Class
IdeaRS.OpenModel.Model Namespace