IDEA StatiCa Open Model
MatSteelCISC Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatSteelCISC type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
Top
See Also
Reference
MatSteelCISC Class
IdeaRS.OpenModel.Material Namespace