IDEA StatiCa Open Model
PretensionedTendonGroup Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The PretensionedTendonGroup type exposes the following members.
Properties
Name | Description
Items
 List of the pretensioned tendon in the group
Top
See Also
Reference
PretensionedTendonGroup Class
IdeaRS.OpenModel.Model Namespace