IDEA Open Model
TemperatureLoadOnLine Properties
Compatible with IDEA StatiCa 20.1
The TemperatureLoadOnLine type exposes the following members.
Properties
Name | Description
ConvectionCoefficient
 Convection coefficient per area - αc[W/(m2K)]
Direction
 Direction on temperaure
DirectionEdges
 Edges of direction
Geometry
 Segment3D
RadiationCoefficient
 Radiation coefficient per area - αr[W/(m2K)]
RelativeBeginPosition
 Relative position on segment - begin
RelativeEndPosition
 Relative position on segment - end
TemperatureCurve
 Temperature curve { x = t[s], y = Θ[K] }
Top
See Also
Reference
TemperatureLoadOnLine Class
IdeaRS.OpenModel.Loading Namespace