IDEA StatiCa Open Model
ConcreteSLSCheckResultStiffness Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConcreteSLSCheckResultStiffness type exposes the following members.
Properties
Name | Description
Fr
 crack resistance internal forces
CharacteristicsI
 stiffnesses calculated on uncracked cross-section
CharacteristicsII
 stiffnesses calculated on cracked cross-section
LinearStiffness
 linear stiffnesses
Stiffness
 result stiffnesses
StiffnessI
 stiffnesses calculated on uncracked cross-section
StiffnessII
 stiffnesses calculated on fully-cracked cross-section
Top
See Also
Reference
ConcreteSLSCheckResultStiffness Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace