IDEA Open Model
Tendon Properties
Compatible with IDEA StatiCa Beta 20.0
The Tendon type exposes the following members.
Properties
Name | Description
Material
 Material
NumberOfStrand
 Number of strands
Top
See Also
Reference
Tendon Class
IdeaRS.OpenModel.Model Namespace