IDEA StatiCa Open Model
RebarBase Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarBase type exposes the following members.
Properties
Name | Description
Diameter
 Gets or sets the Rebar Diameter.
GroupId
 identity for group identification number
Material
 Gets or sets the reference of material properties.
RebarAllocationElement
 the element where this rebar belongs (part of that beam)
RebarParentElement
 Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
RebarShape
 Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
Top
See Also
Reference
RebarBase Class
IdeaRS.OpenModel.Model Namespace