IDEA StatiCa Open Model
NadSetupValueInt Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The NadSetupValueInt type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
NadSetupValueInt Class
IdeaRS.OpenModel.Concrete Namespace