IDEA StatiCa Open Model
MatReinforcementEc2 Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatReinforcementEc2 type exposes the following members.
Properties
Name | Description
Class
 Class of reinforcement
CoeffFtkByFyk
 Coefficient ftk/fyk - k
DiagramType
 Type of material diagram
Epsuk
 Characteristic strain of reinforcement at maximum load - εuk
Fabrication
 Fabrication of reinforcement
Ftk
 Characteristic tensile strength of reinforcement - ftk
Fyk
 Characteristic yield strength of reinforcement - fyk
Type
 Type of reinforcement
UserDiagram
 Stress-strain diagram defined by user
Top
See Also
Reference
MatReinforcementEc2 Class
IdeaRS.OpenModel.Material Namespace