IDEA StatiCa Open Model
RebarPatternBase Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarPatternBase type exposes the following members.
Properties
Name | Description
EndPosition
 This defines end position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
Relative
 Mode of defining the position of the pattern false is for absolute length (position) of the pattern (default) true is for relative length (position) of the pattern in range [0 1]
StartPosition
 This defines begin position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
Top
See Also
Reference
RebarPatternBase Class
IdeaRS.OpenModel.Model Namespace