IDEA Open Model
MatReinforcementAUS Properties
Compatible with IDEA StatiCa 20.1
The MatReinforcementAUS type exposes the following members.
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
MatReinforcementAUS Class
IdeaRS.OpenModel.Material Namespace