IDEA StatiCa Open Model
Hanging Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Hanging type exposes the following members.
Properties
Name | Description
Angle
 Angle between braches
BottomLength
 Length of inside part of anchor
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
EdgeOrientationType
 Edge orientation type
EndsType
 End type of the reinforcement bar - same for both ends
HangingType
 Type of hanging
LegsLength
 Length of legs
MasterComponent
 Master component of hanging
MasterEdge
 Master edge of hanging
PositionOnEdge
 Position on edge
Radius
 Radius of top loop
UpperLength
 Length of upper part of hanging
Top
See Also
Reference
Hanging Class
IdeaRS.OpenModel.Detail Namespace