IDEA Open Model
CrossSectionParameter Properties
Compatible with IDEA StatiCa Beta 20.0
The CrossSectionParameter type exposes the following members.
Properties
Name | Description
CrossSectionType
 Type of cross-section
Material
 Material
Parameters
 Parameters
Top
See Also
Reference
CrossSectionParameter Class
IdeaRS.OpenModel.CrossSection Namespace