IDEA StatiCa Open Model
RebarSingle Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The RebarSingle type exposes the following members.
Properties
Name | Description
RotationXrad
 Returns the rotation (in radians) of the rebar geometry (RebarShape). It is an angle of rotation around AxisX of the reference line.
Translation
 Returns the translation of the rebar geometry (RebarShape). It is an Insert point in reference line coordinate system
Top
See Also
Reference
RebarSingle Class
IdeaRS.OpenModel.Model Namespace