IDEA Open Model
ReinfBarInclined Properties
Compatible with IDEA StatiCa Beta 20.0
The ReinfBarInclined type exposes the following members.
Properties
Name | Description
AddBarOnBottom
 Add bar on Bottom - possible only for FullLength
AddBarOnTop
 Add bar on top - possible only for FullLength
Angle
 Angle between bar and master edge
BottomLength
 Length of additional bar on the bottom
InclinedReinfBarType
 Type of inclined reinf bar
MasterComponent
 Master component of reinforcement
MasterEdge
 Master edge of reinforcement - edge from which is measured angle
MasterPoint
 Master point of reinforcement
TopLength
 Length of additional bar on the top
Top
See Also
Reference
ReinfBarInclined Class
IdeaRS.OpenModel.Detail Namespace