IDEA StatiCa Open Model
OpeningRect Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The OpeningRect type exposes the following members.
Properties
Name | Description
Height
 Height of wall
Width
 Width of wall
Top
See Also
Reference
OpeningRect Class
IdeaRS.OpenModel.Detail Namespace