IDEA Open Model
Member2D Properties
Compatible with IDEA StatiCa Beta 20.0
The Member2D type exposes the following members.
Properties
Name | Description
Elements2D
 Array of element2D
Members1D
 Array of internal members, ribs
Name
 Name of Member
Top
See Also
Reference
Member2D Class
IdeaRS.OpenModel.Model Namespace