IDEA Open Model
CombiInputSIA Properties
Compatible with IDEA StatiCa Beta 20.0
The CombiInputSIA type exposes the following members.
Properties
Name | Description
TypeCalculationCombi
 Type of combination
TypeCombiSIA
 Type of EC combination
Top
See Also
Reference
CombiInputSIA Class
IdeaRS.OpenModel.Loading Namespace