IDEA StatiCa Open Model
OpeningRectOffsets Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The OpeningRectOffsets type exposes the following members.
Properties
Name | Description
OffsetX1
 top left X offset
OffsetX2
 top right x offset
OffsetY1
 right bottom y offset
OffsetY2
 right top y offset
X1
 Left
X2
 Right
Y1
 Bottom
Y2
 Top
Top
See Also
Reference
OpeningRectOffsets Class
IdeaRS.OpenModel.Detail Namespace