IDEA StatiCa Open Model
MatReinforcementRUS Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatReinforcementRUS type exposes the following members.
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
MatReinforcementRUS Class
IdeaRS.OpenModel.Material Namespace