IDEA StatiCa Open Model
Region3D Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Region3D type exposes the following members.
Properties
Name | Description
Openings
 Gets or sets the list of references to PolyLine3Dopenning curve in the Region3D.
Outline
 Gets or sets the reference to PolyLine3D curve of Region3D.
Top
See Also
Reference
Region3D Class
IdeaRS.OpenModel.Geometry3D Namespace