IDEA StatiCa Open Model
MatConcreteSIA Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatConcreteSIA type exposes the following members.
Properties
Name | Description
AggregateType
 type of aggregate
CalculateDependentValues
 setting calculation dependent values on fck
CementClass
 type of cement class
DiagramType
 type of stress-strain diagram bilinear/parabolic/general for ULS calculation
Ecm
 secant modulus of elasticity of concrete
Epsc1d
 compressive strain in the concrete
Epsc2d
 compressive strain in the concrete
Fck
 characteristic compressive cylinder strength of concrete at 28 days
Fcm
 mean value of concrete cylinder compressive strength
Fctk_0_05
 characteristic axial tensile strength of concrete 5% quantile
Fctk_0_95
 characteristic axial tensile strength of concrete 95% quantile
Fctm
 mean value of axial tensile strength of concrete
Nfc
 conversion factor nfc
PlainConcreteDiagram
 Stress strain diagram with tension part
StoneDiameter
 diameter of stone
Tck
 characteristic value of the shear stress limit
Top
See Also
Reference
MatConcreteSIA Class
IdeaRS.OpenModel.Material Namespace