IDEA StatiCa Open Model
ParameterReferenceElement Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ParameterReferenceElement type exposes the following members.
Properties
Name | Description
Value
 Value
Top
See Also
Reference
ParameterReferenceElement Class
IdeaRS.OpenModel.CrossSection Namespace