IDEA StatiCa Open Model
MatConcreteCHN Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The MatConcreteCHN type exposes the following members.
Properties
Name | Description
Fck
 Compressive strength of concrete
Top
See Also
Reference
MatConcreteCHN Class
IdeaRS.OpenModel.Material Namespace