IDEA Open Model
SubStructure Properties
Compatible with IDEA StatiCa 20.1
The SubStructure type exposes the following members.
Properties
Name | Description
Geometry
 Geometry
Loading
 Loading
Name
 Name
Top
See Also
Reference
SubStructure Class
IdeaRS.OpenModel.Model Namespace