IDEA StatiCa Open Model
MatReinforcementAUS Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material reinforcement AUS
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementAUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatReinforcementAUS : MatReinforcement
Public Class MatReinforcementAUS
	Inherits MatReinforcement
public ref class MatReinforcementAUS : public MatReinforcement
The MatReinforcementAUS type exposes the following members.
Constructors
Name | Description
MatReinforcementAUS
 Constructor
Top
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace