IDEA Open Model
InformationMessage Class
Compatible with IDEA StatiCa Beta 20.0
 Open Information message
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Message.OpenMessage
 IdeaRS.OpenModel.Message.InformationMessage
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class InformationMessage : OpenMessage
Public Class InformationMessage
	Inherits OpenMessage
The InformationMessage type exposes the following members.
Constructors
Name | Description
InformationMessage
 Constructor
Top
Properties
Name | Description
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace