IDEA Open Model
RebarHookBend Class
Compatible with IDEA StatiCa 20.1
 Represents a bend rebar hook in 3D.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.RebarHookBase
 IdeaRS.OpenModel.Model.RebarHookBend
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarHookBend : RebarHookBase
Public Class RebarHookBend
	Inherits RebarHookBase
The RebarHookBend type exposes the following members.
Constructors
Name | Description
RebarHookBend
Initializes a new instance of the RebarHookBend class
Top
Properties
Name | Description
Angle
 Bending Angle in X-Y Plane.
Length
 Length of the Hook.
Radius
 Bending Radius. It will override Vertex Radius in case of RebarArcRadVertex3D and RebarArcRadVertex3D.
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace