IDEA Open Model
OpeningRect Class
Compatible with IDEA StatiCa Beta 20.0
 Representation of rectangular opening in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Opening
 IdeaRS.OpenModel.Detail.OpeningRect
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class OpeningRect : Opening
Public Class OpeningRect
	Inherits Opening
The OpeningRect type exposes the following members.
Constructors
Name | Description
OpeningRect
 Constructor
Top
Properties
Name | Description
Height
 Height of wall
Width
 Width of wall
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace