IDEA Open Model
RigidLink Class
Compatible with IDEA StatiCa 20.1
 Rigid link between nodes
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RigidLink
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RigidLink : OpenElementId
Public Class RigidLink
	Inherits OpenElementId
The RigidLink type exposes the following members.
Constructors
Name | Description
RigidLink
 Constructor
Top
Properties
Name | Description
MasterNode
 Node to which all six independent degrees of freedom for the element are assigned
RigidRX
 DOF rigid in RX dirrection
RigidRY
 DOF rigid in RY dirrection
RigidRZ
 DOF rigid in RZ dirrection
RigidX
 DOF rigid in X dirrection
RigidZ
 DOF rigid in Z dirrection
SlaveNodes
 Dependent nodes
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace