IDEA Open Model
MatReinforcement Class
Compatible with IDEA StatiCa Beta 20.0
 Material reinforcement base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementACI
 IdeaRS.OpenModel.Material.MatReinforcementEc2
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class MatReinforcement : Material
Public MustInherit Class MatReinforcement
	Inherits Material
The MatReinforcement type exposes the following members.
Constructors
Name | Description
MatReinforcement
Initializes a new instance of the MatReinforcement class
Top
Properties
Name | Description
BarSurface
 Surface of bar
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace