IDEA Open Model
MatReinforcementIND Class
Compatible with IDEA StatiCa 20.1
 Material reinforcement IND
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementIND
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatReinforcementIND : MatReinforcement
Public Class MatReinforcementIND
	Inherits MatReinforcement
The MatReinforcementIND type exposes the following members.
Constructors
Name | Description
MatReinforcementIND
 Constructor
Top
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace