IDEA Open Model
MatConcreteCHN Class
Compatible with IDEA StatiCa 20.1
 Material concrete CHN
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteCHN
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatConcreteCHN : MatConcrete
Public Class MatConcreteCHN
	Inherits MatConcrete
The MatConcreteCHN type exposes the following members.
Constructors
Name | Description
MatConcreteCHN
 Constructor
Top
Properties
Name | Description
Fck
 Compressive strength of concrete
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace