IDEA Open Model
LoadCase Class
Compatible with IDEA StatiCa 20.1
 Load case
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Loading.CalculationCase
 IdeaRS.OpenModel.Detail.Loading.LoadCase
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class LoadCase : CalculationCase
Public Class LoadCase
	Inherits CalculationCase
The LoadCase type exposes the following members.
Constructors
Name | Description
LoadCase
 Constructor
Top
Properties
Name | Description
Load
 Load
LoadCaseType
 Type of load case
Top
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace