IDEA StatiCa Open Model
MatReinforcementCAN Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material reinforcement CAN
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementCAN
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatReinforcementCAN : MatReinforcement
Public Class MatReinforcementCAN
	Inherits MatReinforcement
public ref class MatReinforcementCAN : public MatReinforcement
The MatReinforcementCAN type exposes the following members.
Constructors
Name | Description
MatReinforcementCAN
 Constructor
Top
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace