IDEA StatiCa Open Model
ReinfFabric Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representing fabric reinforcement in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinfFabric
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ReinfFabric : Reinforcement
Public Class ReinfFabric
	Inherits Reinforcement
public ref class ReinfFabric : public Reinforcement
The ReinfFabric type exposes the following members.
Constructors
Name | Description
ReinfFabric
 constructor
Top
Properties
Name | Description
Angle
 Rotation of fabric reinforcement related to global X coordinate
Cover
 Cover of reinforcement
CoverFromSetting
 Use cover from DetailModelSetting
DiameterX
 Bar diameter - direction X
DiameterY
 Bar diameter - direction Y
DistanceX
 Distance between bars - direction X
DistanceY
 Distance between bars - direction Y
MasterComponent
 Master component of reinforcement, if null, fabric reinforcement is in all components
Number
 number of fabric in wall projection
Position
 Position of bottom left corner of fabric reinforcement related to point number 1 of master wall
SeparatelyPerWall
 true - add fabric reinfrocement separatelly for each wall, false - merge walls and add reinforcement on merged shape
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace