IDEA StatiCa Open Model
ResultOfLoading Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Result Of Loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.Loading
 IdeaRS.OpenModel.Result.ResultOfLoading
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ResultOfLoading : Loading
Public Class ResultOfLoading
	Inherits Loading
public ref class ResultOfLoading : public Loading
The ResultOfLoading type exposes the following members.
Constructors
Name | Description
ResultOfLoading
 Constructor
Top
Properties
Name | Description
Items
 Items od loading
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace