IDEA Open Model
Material Class
Compatible with IDEA StatiCa Beta 20.0
 Material base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MaterialBoltGrade
 IdeaRS.OpenModel.Material.MatPrestressSteel
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatSteel
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class Material : OpenElementId
Public MustInherit Class Material
	Inherits OpenElementId
The Material type exposes the following members.
Constructors
Name | Description
Material
Initializes a new instance of the Material class
Top
Properties
Name | Description
E
 Young's modulus
G
 Shear modulus
IsDefaultMaterial
 True if material is default material from the code
LoadFromLibrary
 Load from library - try override properties from library find material by name
Name
 Name of material
OrderInCode
 Order of this material in the code
Poisson
 Poisson's ratio
SpecificHeat
 Specific heat capacity
StateOfThermalConductivity
 State of thermal conductivity curvature
StateOfThermalExpansion
 State of thermal expansion curvature
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
StateOfThermalStrain
 State of thermal strain curvature
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
ThermalConductivity
 Thermal conductivity
ThermalExpansion
 Thermal expansion
UnitMass
 Unit weight
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace