IDEA StatiCa Open Model
Member2D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of member2D
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Member2D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Member2D : OpenElementId
Public Class Member2D
	Inherits OpenElementId
public ref class Member2D : public OpenElementId
The Member2D type exposes the following members.
Constructors
Name | Description
Member2D
 Constructor
Top
Properties
Name | Description
Elements2D
 Array of element2D
Members1D
 Array of internal members, ribs
Name
 Name of Member
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace