IDEA Open Model
ReinfAroundOpening Class
Compatible with IDEA StatiCa 20.1
 Representing reinforcement around opening in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.ReinfAroundOpening
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ReinfAroundOpening : ReinforcementGroup
Public Class ReinfAroundOpening
	Inherits ReinforcementGroup
The ReinfAroundOpening type exposes the following members.
Constructors
Name | Description
ReinfAroundOpening
 Constructor
Top
Properties
Name | Description
AnchorLength
 Anchor length of main bars
DiagonalDiameter
 Diameter of diagonal reinforcement
DiagonalDistance
 Distance between diagonal reinforcement layers
DiagonalEndsType
 End type of diagonal reinforcement bar
DiagonalLength
 length of diagonal bar
DiagonalNumOfBarsInLayer
 Number of diagonal bars in layer
DiagonalNumOfLayers
 Number of diagonal layers
DiagonalReinforcement
 Add diagonal reinforcement
Distance
 Distance between reinforcement layers
MasterComponent
 Master component of reinforcement
NumOfLayers
 Number of layers
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace