IDEA StatiCa Open Model
ConcreteSetup Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Concrete setup base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Concrete.ConcreteSetup
 IdeaRS.OpenModel.Concrete.ConcreteSetupEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class ConcreteSetup : OpenElementId
Public MustInherit Class ConcreteSetup
	Inherits OpenElementId
public ref class ConcreteSetup abstract : public OpenElementId
The ConcreteSetup type exposes the following members.
Constructors
Name | Description
ConcreteSetup
 Constructor
Top
Properties
Name | Description
SetupValues
 Setup values
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace