IDEA StatiCa Open Model
MatSteelCHN Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material steel CHN
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelCHN
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatSteelCHN : MatSteel
Public Class MatSteelCHN
	Inherits MatSteel
public ref class MatSteelCHN : public MatSteel
The MatSteelCHN type exposes the following members.
Constructors
Name | Description
MatSteelCHN
Initializes a new instance of the MatSteelCHN class
Top
Properties
Name | Description
fu
 Ultimate strength
fy
 Yield strength
PhiOMFu
 Overstrength coefficient for fu
PhiOMFy
 Overstrength coefficient for fy
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace