IDEA StatiCa Open Model
Element2D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of element2D
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Element2D
 IdeaRS.OpenModel.Detail.Wall
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Element2D : OpenElementId
Public Class Element2D
	Inherits OpenElementId
public ref class Element2D : public OpenElementId
The Element2D type exposes the following members.
Constructors
Name | Description
Element2D
 Constructor
Top
Properties
Name | Description
EccentricityZ
 Displacement in local axis Z
ElementType
 Analysis type - shell, plate, wall
GeometricRegion
 Geometry region of element2D
InnerLines
 Inner lines of this region
InnerPoints
 Inner points of this region
Material
 Material
Thickness
 Thicknes of Element2D
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace