IDEA Open Model
MatConcreteCAN Class
Compatible with IDEA StatiCa 20.1
 Material concrete CAN
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteCAN
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatConcreteCAN : MatConcrete
Public Class MatConcreteCAN
	Inherits MatConcrete
The MatConcreteCAN type exposes the following members.
Constructors
Name | Description
MatConcreteCAN
 Constructor
Top
Properties
Name | Description
Fcc
 Compressive strength of concrete
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace