IDEA StatiCa Open Model
MatConcreteRUS Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material concrete CAN
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteRUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatConcreteRUS : MatConcrete
Public Class MatConcreteRUS
	Inherits MatConcrete
public ref class MatConcreteRUS : public MatConcrete
The MatConcreteRUS type exposes the following members.
Constructors
Name | Description
MatConcreteRUS
 Constructor
Top
Properties
Name | Description
Fck
 Compressive strength of concrete
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace