IDEA Open Model
SteelSetupAISC Class
Compatible with IDEA StatiCa 20.1
 Steel setup IBC class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupAISC
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SteelSetupAISC : SteelSetup
Public Class SteelSetupAISC
	Inherits SteelSetup
The SteelSetupAISC type exposes the following members.
Constructors
Name | Description
SteelSetupAISC
Initializes a new instance of the SteelSetupAISC class
Top
Properties
Name | Description
BoltBearing_Omega
 Safety factor BoltBearing_Omega
BoltBearing_Phi
 Safety factor BoltBearing_Phi
BoltSlipRes_Omega
 Safety factor BoltSlipRes_Phi
BoltSlipRes_Phi
 Safety factor BoltSlipRes_Phi
BoltTensileShear_Omega
 Safety factor BoltTensileShear_Omega
BoltTensileShear_Phi
 Safety factor BoltTensileShear_Phi
BoltTensileShearCombined_Omega
 Safety factor BoltTensileShearCombined_Omega
BoltTensileShearCombined_Phi
 Safety factor BoltTensileShearCombined_Phi
FilletWelds_Omega
 Safety factor FilletWelds_Omega
FilletWelds_Phi
 Safety factor FilletWelds_Phi
MaterialFy_Omega
 Safety factor MaterialFy_Omega
MaterialFy_Phi
 Safety factor MaterialFy_Phi
ReductionFactorShear
 ACI 318
ReductionFactorTension
 ACI 318
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel Namespace