IDEA Open Model
PointResultOfTA Class
Compatible with IDEA StatiCa 20.1
 Point Result of TA
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.PointResultBase
 IdeaRS.OpenModel.Result.PointResultOfTA
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class PointResultOfTA : PointResultBase
Public Class PointResultOfTA
	Inherits PointResultBase
The PointResultOfTA type exposes the following members.
Constructors
Name | Description
PointResultOfTA
Initializes a new instance of the PointResultOfTA class
Top
Properties
Name | Description
Temp
 Temperature
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace