IDEA StatiCa Open Model
PointResultOfNLA Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Point Result of NLA
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.PointResultBase
 IdeaRS.OpenModel.Result.PointResultOfNLA
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PointResultOfNLA : PointResultBase
Public Class PointResultOfNLA
	Inherits PointResultBase
public ref class PointResultOfNLA : public PointResultBase
The PointResultOfNLA type exposes the following members.
Constructors
Name | Description
PointResultOfNLA
Initializes a new instance of the PointResultOfNLA class
Top
Properties
Name | Description
AxialForce
 Axial force
AxialStrain
 Axial strain
AxialStress
 Axial stress
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace