IDEA StatiCa Open Model
LoadGroupEC Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Load group for EC
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.LoadGroup
 IdeaRS.OpenModel.Loading.LoadGroupEC
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class LoadGroupEC : LoadGroup
Public Class LoadGroupEC
	Inherits LoadGroup
public ref class LoadGroupEC : public LoadGroup
The LoadGroupEC type exposes the following members.
Constructors
Name | Description
LoadGroupEC
 Constructor
Top
Properties
Name | Description
Psi0
 ψ 0
Psi1
 ψ 1
Psi2
 ψ 2
Top
Examples
 This sample shows how to create a load group.
//Creating the model
OpenModel openModel = new OpenModel();
//Load group - needed for Load case
LoadGroupEC loadGroup = new LoadGroupEC();
loadGroup.Name = "LG1";
loadGroup.GammaQ = 1.5;
loadGroup.Psi0 = 0.7;
loadGroup.Psi1 = 0.5;
loadGroup.Psi2 = 0.3;
loadGroup.GammaGInf = 1.0;
loadGroup.GammaGSup = 1.35;
loadGroup.Dzeta = 0.85;
openModel.AddObject(loadGroup);
See Also
Reference
IdeaRS.OpenModel.Loading Namespace