IDEA StatiCa Open Model
RebarSegment3DLine Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a line segment in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.RebarSegment3DBase
 IdeaRS.OpenModel.Model.RebarSegment3DLine
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class RebarSegment3DLine : RebarSegment3DBase
Public Class RebarSegment3DLine
	Inherits RebarSegment3DBase
public ref class RebarSegment3DLine : public RebarSegment3DBase
The RebarSegment3DLine type exposes the following members.
Constructors
Name | Description
RebarSegment3DLine
Initializes a new instance of the RebarSegment3DLine class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace