IDEA Open Model
ConcreteCheckDetailingEc2 Class
Compatible with IDEA StatiCa Beta 20.0
 Check Detailing Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailing
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailingEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteCheckDetailingEc2 : ConcreteCheckDetailing
Public Class ConcreteCheckDetailingEc2
	Inherits ConcreteCheckDetailing
The ConcreteCheckDetailingEc2 type exposes the following members.
Constructors
Name | Description
ConcreteCheckDetailingEc2
Initializes a new instance of the ConcreteCheckDetailingEc2 class
Top
Properties
Name | Description
CheckValueLongReinf
 check value of longitudinal reinforcement
CheckValueShearReinf
 check value of shear reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace