IDEA StatiCa Open Model
ReinfBarOnMoreEdges Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representing reinforcement bar input on more edges in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ReinfBarOnMoreEdges : ReinforcementGroup
Public Class ReinfBarOnMoreEdges
	Inherits ReinforcementGroup
public ref class ReinfBarOnMoreEdges : public ReinforcementGroup
The ReinfBarOnMoreEdges type exposes the following members.
Constructors
Name | Description
ReinfBarOnMoreEdges
 Constructor
Top
Properties
Name | Description
Covers
 Covers
LengthFromFirstIntersection
 Length of bar from first intersection in the direction of edge
LengthFromLastIntersection
 Length of bar from last intersection in the direction of edge
MasterComponent
 Master component of reinforcement
MasterEdges
 Master Edges
WholeFirstEdge
 Bar is on whole length of first edge
WholeLastEdge
 Bar is on whole length of last edge
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace