IDEA Open Model
CrossSectionThermalAttribute Class
Compatible with IDEA StatiCa Beta 20.0
 Cross-section thermal attribute
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenAttribute
 IdeaRS.OpenModel.CrossSection.CrossSectionThermalAttribute
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class CrossSectionThermalAttribute : OpenAttribute
Public Class CrossSectionThermalAttribute
	Inherits OpenAttribute
The CrossSectionThermalAttribute type exposes the following members.
Constructors
Name | Description
CrossSectionThermalAttribute
 Constructor
Top
Properties
Name | Description
Components
 List of components
Top
Examples
 This sample shows how to create thermal attributes on cross-section.
//Creating the model
OpenModel openModel = new OpenModel();
Set thermal definition - on component 0,
CrossSectionThermalAttribute thermalAttr = new CrossSectionThermalAttribute();
thermalAttr.Element = new ReferenceElement(css);
CrossSectionComponentThermalData thermalComp = new CrossSectionComponentThermalData();
thermalComp.MoistureContent = 0.015;
thermalComp.ThermalConductivityLimit = ThermalConductivityLimit.Lower;
thermalComp.ComponentIndex = 0;
thermalAttr.Components.Add(thermalComp);
openModel.AddObject(thermalAttr);
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace