IDEA Open Model
CheckMember Class
Compatible with IDEA StatiCa Beta 20.0
 Check member base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.CheckMember
 IdeaRS.OpenModel.Model.CheckMember1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class CheckMember : OpenElementId
Public MustInherit Class CheckMember
	Inherits OpenElementId
The CheckMember type exposes the following members.
Constructors
Name | Description
CheckMember
 Constructor
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace