IDEA Open Model
BentUpBar Class
Compatible with IDEA StatiCa 20.1
 Representing bent-Up bar in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.BentUpBar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class BentUpBar : ReinforcementGroup
Public Class BentUpBar
	Inherits ReinforcementGroup
The BentUpBar type exposes the following members.
Constructors
Name | Description
BentUpBar
 Constructor
Top
Properties
Name | Description
AddAnchor
 Add anchor to bent up bar
Angle
 Angle between bar and master edge
AnchorLength
 Length of anchor for bent up bar
BottomLength
 Length of additional bar on the bottom
IsOnLeft
 Bar is on left or right side of member1D
MasterComponent
 Master component of reinforcement
Offset
 Offset of bent-Up bar from left/right edge
TopLength
 Length of additional bar on the top
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace