IDEA StatiCa Open Model
LoadGroup Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Load group
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.LoadGroup
 IdeaRS.OpenModel.Loading.LoadGroupEC
 IdeaRS.OpenModel.Loading.LoadGroupSIA
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class LoadGroup : OpenElementId
Public MustInherit Class LoadGroup
	Inherits OpenElementId
public ref class LoadGroup abstract : public OpenElementId
The LoadGroup type exposes the following members.
Constructors
Name | Description
LoadGroup
Initializes a new instance of the LoadGroup class
Top
Properties
Name | Description
Dzeta
 ζ
GammaGInf
 γ G,Inf
GammaGSup
 γ G,Sup
GammaQ
 γ Q
GroupType
 Group type
Name
 Name of load group
Relation
 Relation
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace