IDEA Open Model
ErrorMessage Class
Compatible with IDEA StatiCa Beta 20.0
 Open Error message
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Message.OpenMessage
 IdeaRS.OpenModel.Message.ErrorMessage
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ErrorMessage : OpenMessage
Public Class ErrorMessage
	Inherits OpenMessage
The ErrorMessage type exposes the following members.
Constructors
Name | Description
ErrorMessage
 Constructor
Top
Properties
Name | Description
Message
 Gets the Message
 (Overrides OpenMessage.Message.)
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace