IDEA StatiCa Open Model
PatchLoad Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of patch load in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.PatchDevice
 IdeaRS.OpenModel.Detail.PatchLoad
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PatchLoad : PatchDevice
Public Class PatchLoad
	Inherits PatchDevice
public ref class PatchLoad : public PatchDevice
The PatchLoad type exposes the following members.
Constructors
Name | Description
PatchLoad
 Constructor
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace