IDEA StatiCa Open Model
StandardCheckSectionExtreme Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Standard check section extreme
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckSectionExtreme
 IdeaRS.OpenModel.Concrete.StandardCheckSectionExtreme
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class StandardCheckSectionExtreme : CheckSectionExtreme
Public Class StandardCheckSectionExtreme
	Inherits CheckSectionExtreme
public ref class StandardCheckSectionExtreme : public CheckSectionExtreme
The StandardCheckSectionExtreme type exposes the following members.
Constructors
Name | Description
StandardCheckSectionExtreme
 Constructor
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace