IDEA StatiCa Open Model
WallRect Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of rectangular element2D in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Element2D
 IdeaRS.OpenModel.Detail.Wall
 IdeaRS.OpenModel.Detail.WallRect
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class WallRect : Wall
Public Class WallRect
	Inherits Wall
public ref class WallRect : public Wall
The WallRect type exposes the following members.
Constructors
Name | Description
WallRect
 Coonstructor
Top
Properties
Name | Description
Height
 Height of wall
Offset1
 Offset horizontal top left
Offset2
 Offset horizontal top left
Width
 Width of wall
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace