IDEA StatiCa Open Model
ConcreteULSCheckResultShear Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 ULS Check Shear base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShear
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultShearEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class ConcreteULSCheckResultShear : ConcreteCheckResultBase
Public MustInherit Class ConcreteULSCheckResultShear
	Inherits ConcreteCheckResultBase
public ref class ConcreteULSCheckResultShear abstract : public ConcreteCheckResultBase
The ConcreteULSCheckResultShear type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultShear
Initializes a new instance of the ConcreteULSCheckResultShear class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace