IDEA Open Model
MatSteelAISC Class
Compatible with IDEA StatiCa Beta 20.0
 Material steel AISC
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelAISC
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatSteelAISC : MatSteel
Public Class MatSteelAISC
	Inherits MatSteel
The MatSteelAISC type exposes the following members.
Constructors
Name | Description
MatSteelAISC
Initializes a new instance of the MatSteelAISC class
Top
Properties
Name | Description
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fu40
 Ultimate strength for nominal thickness of the element > 40mm and <= 100mm - fu,(>40)
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
fy40
 Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace