IDEA StatiCa Open Model
Element1D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of element1D
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Element1D
 IdeaRS.OpenModel.Detail.Beam
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Element1D : OpenElementId
Public Class Element1D
	Inherits OpenElementId
public ref class Element1D : public OpenElementId
The Element1D type exposes the following members.
Constructors
Name | Description
Element1D
Initializes a new instance of the Element1D class
Top
Properties
Name | Description
CrossSectionBegin
 Gets, sets cross section located in the begining of this element1D
CrossSectionEnd
 Gets, sets cross section located at the end of this element1D
EccentricityBeginX
 Local eccentricity X at the begin of Element1D
EccentricityBeginY
 Local eccentricity Y at the begin of Element1D
EccentricityBeginZ
 Local eccentricity Z at the begin of Element1D
EccentricityEndX
 Local eccentricity X at the end of Element1D
EccentricityEndY
 Local eccentricity Y at the end of Element1D
EccentricityEndZ
 Local eccentricity Z at the end of Element1D
Name
 Name of Element
RotationRx
 Rotation of Cross-section of Element1D. Difference from default Line LCS
Segment
 Line segment with start point and end point
Top
Examples
 This sample shows how to create an element 1D .
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Cocrete material
MatConcreteEc2 mat = new MatConcreteEc2();
//...
openModel.AddObject(mat);
//Reinforcement material
MatReinforcementEc2 matR = new MatReinforcementEc2();
//...
openModel.AddObject(matR);
//Cross-section without the bars
IdeaRS.OpenModel.CrossSection.CrossSectionComponent css = new IdeaRS.OpenModel.CrossSection.CrossSectionComponent();
//...
openModel.AddObject(css);
//Reinforced cross-section (referemnces cross-section and ads the bars)
ReinforcedCrossSection rcs = new ReinforcedCrossSection();
//...
openModel.AddObject(rcs);
//Model element along the "line1" - part of member1D
Element1D element1D1 = new Element1D();
element1D1.CrossSectionBegin = new ReferenceElement(rcs);
element1D1.CrossSectionEnd = new ReferenceElement(rcs);
element1D1.Segment = new ReferenceElement(line1);
openModel.AddObject(element1D1);
//Model element along the "line2" - part of member1D
Element1D element1D2 = new Element1D();
element1D2.CrossSectionBegin = new ReferenceElement(rcs);
element1D2.CrossSectionEnd = new ReferenceElement(rcs);
element1D2.Segment = new ReferenceElement(line2);
openModel.AddObject(element1D2);
See Also
Reference
IdeaRS.OpenModel.Model Namespace