IDEA StatiCa Open Model
SetupValueFloat Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value float
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueFloat
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SetupValueFloat : SetupValue
Public Class SetupValueFloat
	Inherits SetupValue
public ref class SetupValueFloat : public SetupValue
The SetupValueFloat type exposes the following members.
Constructors
Name | Description
SetupValueFloat
Initializes a new instance of the SetupValueFloat class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace