IDEA StatiCa Open Model
RebarStirrups Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a rebar grouping in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarBase
 IdeaRS.OpenModel.Model.RebarStirrups
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class RebarStirrups : RebarBase
Public Class RebarStirrups
	Inherits RebarBase
public ref class RebarStirrups : public RebarBase
The RebarStirrups type exposes the following members.
Constructors
Name | Description
RebarStirrups
 create a new instance.
Top
Properties
Name | Description
Patterns
 Gets or sets the pattern of the rebar grouping. Holds distance between rebars/stirrups and length
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace