IDEA StatiCa Open Model
NadSetupValueLong Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value long
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueLong
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class NadSetupValueLong : NadSetupValue
Public Class NadSetupValueLong
	Inherits NadSetupValue
public ref class NadSetupValueLong : public NadSetupValue
The NadSetupValueLong type exposes the following members.
Constructors
Name | Description
NadSetupValueLong
Initializes a new instance of the NadSetupValueLong class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace