IDEA StatiCa Open Model
DesignMember Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 DesignMember
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.DesignMember
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class DesignMember : OpenElementId
Public Class DesignMember
	Inherits OpenElementId
public ref class DesignMember : public OpenElementId
The DesignMember type exposes the following members.
Constructors
Name | Description
DesignMember
 Constructor
Top
Properties
Name | Description
Members
 Array of Member1D
Name
 Name of Element
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace