IDEA Open Model
ProjectDataConcreteEc2 Class
Compatible with IDEA StatiCa 20.1
 Project data concrete Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Concrete.ProjectDataConcrete
 IdeaRS.OpenModel.Concrete.ProjectDataConcreteEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ProjectDataConcreteEc2 : ProjectDataConcrete
Public Class ProjectDataConcreteEc2
	Inherits ProjectDataConcrete
The ProjectDataConcreteEc2 type exposes the following members.
Constructors
Name | Description
ProjectDataConcreteEc2
 Constructor
Top
Properties
Name | Description
CodeEN1992_2
 Flag if code EN 1992-2 is included
CodeEN1992_3
 Flag if code EN 1992-2 is included
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace