IDEA StatiCa Open Model
PretensionedTendonGroup Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 The Pretensioned tendon group
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Tendon
 IdeaRS.OpenModel.Model.PretensionedTendonGroup
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PretensionedTendonGroup : Tendon
Public Class PretensionedTendonGroup
	Inherits Tendon
public ref class PretensionedTendonGroup : public Tendon
The PretensionedTendonGroup type exposes the following members.
Constructors
Name | Description
PretensionedTendonGroup
 Constructor
Top
Properties
Name | Description
Items
 List of the pretensioned tendon in the group
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace