IDEA Open Model
RebarPoint3D Class
Compatible with IDEA StatiCa 20.1
 Represents a Point in 3D. Defines an Arc segment by radius.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.Point3D
 IdeaRS.OpenModel.Model.RebarPoint3D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarPoint3D : Point3D
Public Class RebarPoint3D
	Inherits Point3D
The RebarPoint3D type exposes the following members.
Constructors
Name | Description
RebarPoint3D
Initializes a new instance of the RebarPoint3D class
Top
Properties
Name | Description
BendRadius
 Gets or sets the radius of the Arc
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace