IDEA Open Model
WeldParam Class
Compatible with IDEA StatiCa Beta 20.0
 Parameter which represts the record of the weld in IDEA MPRL
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Parameters.MprlRecord
 IdeaRS.OpenModel.Parameters.WeldParam
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class WeldParam : MprlRecord
<SerializableAttribute>
Public Class WeldParam
	Inherits MprlRecord
The WeldParam type exposes the following members.
Constructors
Name | Description
WeldParam
Initializes a new instance of the WeldParam class
Top
Properties
Name | Description
Size
 Gets or sets the size of the weld
WeldType
 Gets or sets the type of the weld
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace