IDEA StatiCa Open Model
ConcreteULSCheckResultDiagramCapacity Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 ULS Check Diagram Capacity base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultDiagramCapacity
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultDiagramCapacityEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class ConcreteULSCheckResultDiagramCapacity : ConcreteCheckResultBase
Public MustInherit Class ConcreteULSCheckResultDiagramCapacity
	Inherits ConcreteCheckResultBase
public ref class ConcreteULSCheckResultDiagramCapacity abstract : public ConcreteCheckResultBase
The ConcreteULSCheckResultDiagramCapacity type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultDiagramCapacity
Initializes a new instance of the ConcreteULSCheckResultDiagramCapacity class
Top
Properties
Name | Description
Fu
 calculated ultimate internal forces
Fu1
 calculated ultimate internal forces
Fu2
 calculated ultimate internal forces
CheckMethod
 method of check
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace