IDEA StatiCa Open Model
MatConcreteIND Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material concrete IND
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteIND
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatConcreteIND : MatConcrete
Public Class MatConcreteIND
	Inherits MatConcrete
public ref class MatConcreteIND : public MatConcrete
The MatConcreteIND type exposes the following members.
Constructors
Name | Description
MatConcreteIND
 Constructor
Top
Properties
Name | Description
Fck
 Compressive strength of concrete
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace