IDEA StatiCa Open Model
LineSegment2D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents a line segment in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Segment2D
 IdeaRS.OpenModel.Geometry2D.LineSegment2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class LineSegment2D : Segment2D
Public Class LineSegment2D
	Inherits Segment2D
public ref class LineSegment2D : public Segment2D
The LineSegment2D type exposes the following members.
Constructors
Name | Description
LineSegment2D
Initializes a new instance of the LineSegment2D class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace