IDEA Open Model
SectionResultOnPoints Class
Compatible with IDEA StatiCa Beta 20.0
 Section result of points
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.SectionResultOnPoints
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class SectionResultOnPoints : SectionResultBase
Public Class SectionResultOnPoints
	Inherits SectionResultBase
The SectionResultOnPoints type exposes the following members.
Constructors
Name | Description
SectionResultOnPoints
 Constructor
Top
Properties
Name | Description
Points
 Section points
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace