IDEA StatiCa Open Model
MatSteelCISC Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material steel CISC
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelCISC
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatSteelCISC : MatSteel
Public Class MatSteelCISC
	Inherits MatSteel
public ref class MatSteelCISC : public MatSteel
The MatSteelCISC type exposes the following members.
Constructors
Name | Description
MatSteelCISC
Initializes a new instance of the MatSteelCISC class
Top
Properties
Name | Description
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace