IDEA StatiCa Open Model
PretensionedTendonGroupItem Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 The pretensionede tendon group item
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Tendon
 IdeaRS.OpenModel.Model.PretensionedTendonGroupItem
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PretensionedTendonGroupItem : Tendon
Public Class PretensionedTendonGroupItem
	Inherits Tendon
public ref class PretensionedTendonGroupItem : public Tendon
The PretensionedTendonGroupItem type exposes the following members.
Constructors
Name | Description
PretensionedTendonGroupItem
Initializes a new instance of the PretensionedTendonGroupItem class
Top
Properties
Name | Description
Geometry
 Geometry
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace