IDEA Open Model
SectionResultMesh Class
Compatible with IDEA StatiCa Beta 20.0
 Section result mesh
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.SectionResultMesh
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class SectionResultMesh : SectionResultBase
Public Class SectionResultMesh
	Inherits SectionResultBase
The SectionResultMesh type exposes the following members.
Constructors
Name | Description
SectionResultMesh
 Constructor
Top
Properties
Name | Description
Elements
 Elements
Points
 Section points
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace