IDEA StatiCa Open Model
ConnectedMember Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 ConnectedMember
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Connection.ConnectedMember
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectedMember : OpenElementId
Public Class ConnectedMember
	Inherits OpenElementId
public ref class ConnectedMember : public OpenElementId
The ConnectedMember type exposes the following members.
Constructors
Name | Description
ConnectedMember
Initializes a new instance of the ConnectedMember class
Top
Properties
Name | Description
IsContinuous
 IsContinuous
Length
 Length of the member
MemberId
 MemberId
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace