IDEA Open Model
SetupValueBool Class
Compatible with IDEA StatiCa Beta 20.0
 Setup value bool
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueBool
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class SetupValueBool : SetupValue
Public Class SetupValueBool
	Inherits SetupValue
The SetupValueBool type exposes the following members.
Constructors
Name | Description
SetupValueBool
Initializes a new instance of the SetupValueBool class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace