IDEA Open Model
RebarShape Class
Compatible with IDEA StatiCa 20.1
 Represents a geometrical shape for Rebar in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarShape
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarShape : OpenElementId
Public Class RebarShape
	Inherits OpenElementId
The RebarShape type exposes the following members.
Constructors
Name | Description
RebarShape
Initializes a new instance of the RebarShape class
Top
Properties
Name | Description
EndHook
 Gets or sets the end rebar hook.
SourceGeometry
 Gets or sets the segments of the rebar shape.
StartHook
 Gets or sets the start rebar hook.
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace