IDEA Open Model
RebarSingle Class
Compatible with IDEA StatiCa 20.1
 Represents a single main rebar in 3D space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.RebarBase
 IdeaRS.OpenModel.Model.RebarSingle
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class RebarSingle : RebarBase
Public Class RebarSingle
	Inherits RebarBase
The RebarSingle type exposes the following members.
Constructors
Name | Description
RebarSingle
 create a new instance.
Top
Properties
Name | Description
RotationXrad
 Returns the rotation (in radians) of the rebar geometry (RebarShape). It is an angle of rotation around AxisX of the reference line.
Translation
 Returns the translation of the rebar geometry (RebarShape). It is an Insert point in reference line coordinate system
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace