IDEA StatiCa Open Model
ReinfBarInclined Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representing reinforcement inclined bar in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.ReinfBarInclined
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ReinfBarInclined : ReinforcementGroup
Public Class ReinfBarInclined
	Inherits ReinforcementGroup
public ref class ReinfBarInclined : public ReinforcementGroup
The ReinfBarInclined type exposes the following members.
Constructors
Name | Description
ReinfBarInclined
 Constructor
Top
Properties
Name | Description
AddBarOnBottom
 Add bar on Bottom - possible only for FullLength
AddBarOnTop
 Add bar on top - possible only for FullLength
Angle
 Angle between bar and master edge
BottomLength
 Length of additional bar on the bottom
InclinedReinfBarType
 Type of inclined reinf bar
MasterComponent
 Master component of reinforcement
MasterEdge
 Master edge of reinforcement - edge from which is measured angle
MasterPoint
 Master point of reinforcement
TopLength
 Length of additional bar on the top
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace