IDEA StatiCa Open Model
DappedEnd Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of dapped end in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.DappedEnd
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class DappedEnd : OpenElementId
Public Class DappedEnd
	Inherits OpenElementId
public ref class DappedEnd : public OpenElementId
The DappedEnd type exposes the following members.
Constructors
Name | Description
DappedEnd
 Constructor
Top
Properties
Name | Description
DappedEndHaunch
 Type of haunch on dapped end
GeomId
 Id representing geometrical parts of Detail
Haunch
 Haunch size of dapped end
Height
 Height of dapped end
MasterComponent
 Master component
MasterPoint
 Insert point 0 - 1
Outline
 Outline of dapped end
Position
 Offset between MasterPoint and InsertPoint
Rotation
 Rotation of dapped end
Width
 Width of dapped end
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace