IDEA StatiCa Open Model
ConcreteULSCheckResultInteraction Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 ULS Check Interaction base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteraction
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultInteractionEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class ConcreteULSCheckResultInteraction : ConcreteCheckResultBase
Public MustInherit Class ConcreteULSCheckResultInteraction
	Inherits ConcreteCheckResultBase
public ref class ConcreteULSCheckResultInteraction abstract : public ConcreteCheckResultBase
The ConcreteULSCheckResultInteraction type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultInteraction
Initializes a new instance of the ConcreteULSCheckResultInteraction class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace