IDEA Open Model
ReinforcedCrossSection Class
Compatible with IDEA StatiCa Beta 20.0
 Reinforced cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ReinforcedCrossSection : OpenElementId
Public Class ReinforcedCrossSection
	Inherits OpenElementId
The ReinforcedCrossSection type exposes the following members.
Constructors
Name | Description
ReinforcedCrossSection
 Constructor
Top
Properties
Name | Description
Bars
 Reinforced bars
CrossSection
 Cross-section
Name
 Name of cross-section
Stirrups
 Stirrups
TendonBars
 Tendon bars
TendonDucts
 Tendon ducts
Top
Examples
 This sample shows how to create reinforced cross-section.
//Creating the model
OpenModel openModel = new OpenModel();
//Cocrete material
MatConcreteEc2 mat = new MatConcreteEc2();
//...
openModel.AddObject(mat);
//Reinforcement material
MatReinforcementEc2 matR = new MatReinforcementEc2();
//...
openModel.AddObject(matR);
//Cross-section without the bars
//One component square 0.8x0.8m
IdeaRS.OpenModel.CrossSection.CrossSectionComponent css = new IdeaRS.OpenModel.CrossSection.CrossSectionComponent();
css.Name = "CSS1";
//Component of cross-section
CssComponent comp = new CssComponent();
comp.Material = new ReferenceElement(mat);
comp.Phase = 0;
//Geometry of component 0.8x0.8
Region2D region = new Region2D();
PolyLine2D outline = new PolyLine2D();
outline.StartPoint = new Point2D();
outline.StartPoint.X = -0.04;
outline.StartPoint.Y = -0.04;
LineSegment2D seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.04;
seg.EndPoint.Y = -0.04;
outline.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.04;
seg.EndPoint.Y = 0.04;
outline.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.04;
seg.EndPoint.Y = 0.04;
outline.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.04;
seg.EndPoint.Y = -0.04;
outline.Segments.Add(seg);
region.Outline = outline;
//Optional - setting openning in this component 0,2x0,2
PolyLine2D openning = new PolyLine2D();
openning.StartPoint = new Point2D();
openning.StartPoint.X = -0.01;
openning.StartPoint.Y = -0.01;
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.01;
seg.EndPoint.Y = 0.01;
openning.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.01;
seg.EndPoint.Y = 0.01;
openning.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = 0.01;
seg.EndPoint.Y = -0.01;
openning.Segments.Add(seg);
seg = new LineSegment2D();
seg.EndPoint = new Point2D();
seg.EndPoint.X = -0.01;
seg.EndPoint.Y = -0.01;
openning.Segments.Add(seg);
region.Openings.Add(openning);
comp.Geometry = region;
css.Components.Add(comp);
openModel.AddObject(css);
//Reinforced cross-section (references cross-section and adds the bars)
//bar 8mm in each corner
ReinforcedCrossSection rcs = new ReinforcedCrossSection();
rcs.Name = "RCSS1";
rcs.CrossSection = new ReferenceElement(css);
//One bar in the corner
ReinforcedBar bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = -0.025;
bar.Point.Y = -0.025;
rcs.Bars.Add(bar);
bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = 0.025;
bar.Point.Y = -0.025;
rcs.Bars.Add(bar);
bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = 0.025;
bar.Point.Y = 0.025;
rcs.Bars.Add(bar);
bar = new ReinforcedBar();
bar.Diameter = 0.008;
bar.Material = new ReferenceElement(matR);
bar.Point = new Point2D();
bar.Point.X = -0.025;
bar.Point.Y = 0.025;
rcs.Bars.Add(bar);
openModel.AddObject(rcs);
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace