IDEA Open Model
SteelSetupECEN Class
Compatible with IDEA StatiCa 20.1
 Steel setup ECEN class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupECEN
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SteelSetupECEN : SteelSetup
Public Class SteelSetupECEN
	Inherits SteelSetup
The SteelSetupECEN type exposes the following members.
Constructors
Name | Description
SteelSetupECEN
Initializes a new instance of the SteelSetupECEN class
Top
Properties
Name | Description
GammaM0
 GammaM0
GammaM1
 GammaM1
GammaM2
 GammaM2
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel Namespace