IDEA Open Model
MatReinforcementCHN Class
Compatible with IDEA StatiCa 20.1
 Material reinforcement CHN
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementCHN
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class MatReinforcementCHN : MatReinforcement
Public Class MatReinforcementCHN
	Inherits MatReinforcement
The MatReinforcementCHN type exposes the following members.
Constructors
Name | Description
MatReinforcementCHN
 Constructor
Top
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace