IDEA Open Model
MatReinforcementACI Class
Compatible with IDEA StatiCa Beta 20.0
 Material reinforcement ACI
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatReinforcement
 IdeaRS.OpenModel.Material.MatReinforcementACI
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatReinforcementACI : MatReinforcement
Public Class MatReinforcementACI
	Inherits MatReinforcement
The MatReinforcementACI type exposes the following members.
Constructors
Name | Description
MatReinforcementACI
 Constructor
Top
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace