IDEA StatiCa Open Model
PointLoadOnLine Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Load in specific point on line
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.PointLoadOnLine
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PointLoadOnLine : OpenElementId
Public Class PointLoadOnLine
	Inherits OpenElementId
public ref class PointLoadOnLine : public OpenElementId
The PointLoadOnLine type exposes the following members.
Constructors
Name | Description
PointLoadOnLine
 Constructor
Top
Properties
Name | Description
Direction
 Local / global
Ey
 Eccentricity in Y direction
Ez
 Eccentricity in Z direction
Fx
 Force in X direction
Fy
 Force in Y direction
Fz
 Force in Z direction
Geometry
 Segment3D or PolyLine3D
Mx
 Moment about the x-axis
My
 Moment about the y-axis
Mz
 Moment about the z-axis
RelativePosition
 Relative position on geometry line
Top
Examples
 This sample shows how to create a point load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Point loading impulse on the bottom of the "line1" - in the LCS of line
PointLoadOnLine pointLoadA = new PointLoadOnLine();
pointLoadA.Geometry = new ReferenceElement(line1);
pointLoadA.RelativePosition = 0.0;
pointLoadA.Fx = 10e3;
pointLoadA.Ez = 0.024;
openModel.AddObject(pointLoadA);
loadCase.PointLoadsOnLine.Add(new ReferenceElement(pointLoadA));
See Also
Reference
IdeaRS.OpenModel.Loading Namespace