IDEA StatiCa Open Model
ResultOfInternalForces Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Result of internal forces in the one position
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.ResultOfInternalForces
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ResultOfInternalForces : SectionResultBase
Public Class ResultOfInternalForces
	Inherits SectionResultBase
public ref class ResultOfInternalForces : public SectionResultBase
The ResultOfInternalForces type exposes the following members.
Constructors
Name | Description
ResultOfInternalForces
 Constructor
Top
Properties
Name | Description
Mx
 Bending moment around x-axis
My
 Bending moment around y-axis
Mz
 Bending moment around z-axis
N
 Normal force
Qy
 Shear force in y dirrection
Qz
 Shear force in z dirrection
Top
Remarks
Convention of internal forces on 1D members
 Internal forces on 1D members perform following actions:
 • positive bending moment My causes tension in cross-section fibers with negative z-coordinate
 • positive bending moment Mz causes tension in fibers with negative y-coordinate
 • positive torsional moment Mx acts about x-axis of 1D member
 • positive axial force N acts in direction of x-axis of member and causes tension in cross-section fibers
 • positive shear force Qz acts in direction of z-axis of cross-section
 • positive shear force Qy acts in direction of y-axis of cross-section
See Also
Reference
IdeaRS.OpenModel.Result Namespace