IDEA StatiCa Open Model
OpeningCirc Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of circular opening in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Opening
 IdeaRS.OpenModel.Detail.OpeningCirc
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class OpeningCirc : Opening
Public Class OpeningCirc
	Inherits Opening
public ref class OpeningCirc : public Opening
The OpeningCirc type exposes the following members.
Constructors
Name | Description
OpeningCirc
 Constructor
Top
Properties
Name | Description
Diameter
 Diameter of opening
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace