IDEA Open Model
LineLoad Class
Compatible with IDEA StatiCa Beta 20.0
 Line load
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Detail.Loading.LoadBase
 IdeaRS.OpenModel.Detail.Loading.LineLoad
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class LineLoad : LoadBase
Public Class LineLoad
	Inherits LoadBase
The LineLoad type exposes the following members.
Constructors
Name | Description
LineLoad
 constructor
Top
Properties
Name | Description
Angle
 angle of load
BegFx
 force in X at biginning
BegFy
 force in Y at beginning
BegPositionX
 point support position X
BegPositionY
 point support position Y
Direction
 local / global
DirectionType
 direction type of load
EdgePositionType
 edge position type
EndFx
 force in X at end
EndFy
 force in Y at end
EndPositionX
 point support position X
EndPositionY
 point support position Y
GeneralLine
 general shape
GeometryPointsPath
 list of line load points
LengthOnEdge
 length of load
MasterComponent
 Gets or sets the master component
MasterEdge
 master component edge
MasterPoint
 master point
Name
 Gets or set the name
PositionOnEdge
 position od edge
ResultantForces
 forces value
TypeEdgePosition
 edge position type
TypeLinePosition
 type of position
Top
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace