IDEA Open Model
ResultOfDeformation Class
Compatible with IDEA StatiCa Beta 20.0
 Result of deformation in the one positon
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.ResultOfDeformation
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ResultOfDeformation : SectionResultBase
Public Class ResultOfDeformation
	Inherits SectionResultBase
The ResultOfDeformation type exposes the following members.
Constructors
Name | Description
ResultOfDeformation
 Constructor
Top
Properties
Name | Description
Fix
 Rotation around x-axis
Fiy
 Rotation around y-axis
Fiz
 Rotation around z-axis
Ux
 Deformation in the x direction
Uy
 Deformation in the y direction
Uz
 Deformation in the z direction
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace