IDEA Open Model
MatSteelAUS Class
Compatible with IDEA StatiCa Beta 20.0
 Material steel AISC
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelAUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatSteelAUS : MatSteel
Public Class MatSteelAUS
	Inherits MatSteel
The MatSteelAUS type exposes the following members.
Constructors
Name | Description
MatSteelAUS
Initializes a new instance of the MatSteelAUS class
Top
Properties
Name | Description
fu
 Default ultimate strength for nominal thickness of the element - fu
fy
 Default yield strength for nominal thickness of the element - fy
MaterialStrength
 Material strength for specific thickness of plate
PhiOMFu
 Overstrength coefficient for fu
PhiOMFy
 Overstrength coefficient for fy
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace