IDEA StatiCa Open Model
NadSetupValueBool Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value bool
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueBool
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class NadSetupValueBool : NadSetupValue
Public Class NadSetupValueBool
	Inherits NadSetupValue
public ref class NadSetupValueBool : public NadSetupValue
The NadSetupValueBool type exposes the following members.
Constructors
Name | Description
NadSetupValueBool
Initializes a new instance of the NadSetupValueBool class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace