IDEA StatiCa Open Model
Tendon Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Tendon
 IdeaRS.OpenModel.Model.BondedTendon
 IdeaRS.OpenModel.Model.PretensionedTendonGroup
 IdeaRS.OpenModel.Model.PretensionedTendonGroupItem
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class Tendon : OpenElementId
Public MustInherit Class Tendon
	Inherits OpenElementId
public ref class Tendon abstract : public OpenElementId
The Tendon type exposes the following members.
Constructors
Name | Description
Tendon
Initializes a new instance of the Tendon class
Top
Properties
Name | Description
Material
 Material
NumberOfStrand
 Number of strands
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace