IDEA Open Model
ConcreteSLSCheckResultStiffnessEc2 Class
Compatible with IDEA StatiCa 20.1
 SLS Check Stiffness Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStiffness
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStiffnessEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteSLSCheckResultStiffnessEc2 : ConcreteSLSCheckResultStiffness
Public Class ConcreteSLSCheckResultStiffnessEc2
	Inherits ConcreteSLSCheckResultStiffness
The ConcreteSLSCheckResultStiffnessEc2 type exposes the following members.
Constructors
Name | Description
ConcreteSLSCheckResultStiffnessEc2
Initializes a new instance of the ConcreteSLSCheckResultStiffnessEc2 class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace