IDEA Open Model
LoadOnSurface Class
Compatible with IDEA StatiCa Beta 20.0
 Load on surface
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.LoadOnSurface
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class LoadOnSurface : OpenElementId
Public Class LoadOnSurface
	Inherits OpenElementId
The LoadOnSurface type exposes the following members.
Constructors
Name | Description
LoadOnSurface
 Constructor
Top
Properties
Name | Description
Direction
 Load direction LCS or GCS
Fx
 Force in X direction
Fy
 Force in Y direction
Fz
 Force in Z direction
Geometry
 Gets, sets geometry of this LoadOnSurface
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace