IDEA Open Model
NadSetupValueDouble Class
Compatible with IDEA StatiCa 20.1
 Setup value double
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueDouble
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class NadSetupValueDouble : NadSetupValue
Public Class NadSetupValueDouble
	Inherits NadSetupValue
The NadSetupValueDouble type exposes the following members.
Constructors
Name | Description
NadSetupValueDouble
Initializes a new instance of the NadSetupValueDouble class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace