IDEA StatiCa Open Model
MatConcreteSIA Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material concrete SIA
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteSIA
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatConcreteSIA : MatConcrete
Public Class MatConcreteSIA
	Inherits MatConcrete
public ref class MatConcreteSIA : public MatConcrete
The MatConcreteSIA type exposes the following members.
Constructors
Name | Description
MatConcreteSIA
Initializes a new instance of the MatConcreteSIA class
Top
Properties
Name | Description
AggregateType
 type of aggregate
CalculateDependentValues
 setting calculation dependent values on fck
CementClass
 type of cement class
DiagramType
 type of stress-strain diagram bilinear/parabolic/general for ULS calculation
Ecm
 secant modulus of elasticity of concrete
Epsc1d
 compressive strain in the concrete
Epsc2d
 compressive strain in the concrete
Fck
 characteristic compressive cylinder strength of concrete at 28 days
Fcm
 mean value of concrete cylinder compressive strength
Fctk_0_05
 characteristic axial tensile strength of concrete 5% quantile
Fctk_0_95
 characteristic axial tensile strength of concrete 95% quantile
Fctm
 mean value of axial tensile strength of concrete
Nfc
 conversion factor nfc
PlainConcreteDiagram
 Stress strain diagram with tension part
StoneDiameter
 diameter of stone
Tck
 characteristic value of the shear stress limit
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace