IDEA StatiCa Open Model
AnchorParam Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Parameter which represts the record of the anchor in IDEA MPRL
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Parameters.MprlRecord
 IdeaRS.OpenModel.Parameters.BoltParam
 IdeaRS.OpenModel.Parameters.AnchorParam
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[SerializableAttribute]
public class AnchorParam : BoltParam
<SerializableAttribute>
Public Class AnchorParam
	Inherits BoltParam
[SerializableAttribute]
public ref class AnchorParam : public BoltParam
The AnchorParam type exposes the following members.
Constructors
Name | Description
AnchorParam
Initializes a new instance of the AnchorParam class
Top
Properties
Name | Description
AnchorTypeData
 Gets or sets the various type of anchor.
AnchorTypeSize
 Gets or sets the size of washer plate.
Length
 Gets or sets the anchor length.
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace