IDEA StatiCa Open Model
ParameterReferenceElement Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Reference element parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterReferenceElement
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ParameterReferenceElement : Parameter
Public Class ParameterReferenceElement
	Inherits Parameter
public ref class ParameterReferenceElement : public Parameter
The ParameterReferenceElement type exposes the following members.
Constructors
Name | Description
ParameterReferenceElement
Initializes a new instance of the ParameterReferenceElement class
Top
Properties
Name | Description
Value
 Value
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace