IDEA StatiCa Open Model
ConcreteSLSCheckResultStressLimitation Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 SLS Check Stress Limitation base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStressLimitation
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStressLimitationEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class ConcreteSLSCheckResultStressLimitation : ConcreteCheckResultBase
Public MustInherit Class ConcreteSLSCheckResultStressLimitation
	Inherits ConcreteCheckResultBase
public ref class ConcreteSLSCheckResultStressLimitation abstract : public ConcreteCheckResultBase
The ConcreteSLSCheckResultStressLimitation type exposes the following members.
Constructors
Name | Description
ConcreteSLSCheckResultStressLimitation
Initializes a new instance of the ConcreteSLSCheckResultStressLimitation class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace