IDEA Open Model
ConcreteULSCheckResultDiagramCapacityEc2 Class
Compatible with IDEA StatiCa 20.1
 ULS Check Diagram Capacity Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultDiagramCapacity
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultDiagramCapacityEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteULSCheckResultDiagramCapacityEc2 : ConcreteULSCheckResultDiagramCapacity
Public Class ConcreteULSCheckResultDiagramCapacityEc2
	Inherits ConcreteULSCheckResultDiagramCapacity
The ConcreteULSCheckResultDiagramCapacityEc2 type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultDiagramCapacityEc2
Initializes a new instance of the ConcreteULSCheckResultDiagramCapacityEc2 class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace