IDEA Open Model
HingeElement1D Class
Compatible with IDEA StatiCa 20.1
 Representation of hinge element 1D
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.HingeElement1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class HingeElement1D : OpenElementId
Public Class HingeElement1D
	Inherits OpenElementId
The HingeElement1D type exposes the following members.
Constructors
Name | Description
HingeElement1D
Initializes a new instance of the HingeElement1D class
Top
Properties
Name | Description
HingeTypeRX
 Hinge type in dirrection round X
HingeTypeRY
 Hinge type in dirrection round Y
HingeTypeRZ
 Hinge type in dirrection round Z
HingeTypeX
 Hinge type in dirrection X
HingeTypeY
 Hinge type in dirrection Y
HingeTypeZ
 Hinge type in dirrection Z
InitialStiffnessRX
 Initial stiffness rotational RX
InitialStiffnessRY
 Initial stiffness rotational RY
InitialStiffnessRZ
 Initial stiffness rotational RZ
InitialStiffnessX
 Initial stiffness X dirrection
InitialStiffnessY
 Initial stiffness Y dirrection
InitialStiffnessZ
 Initial stiffness Z dirrection
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace