IDEA Open Model
PatchDevice Class
Compatible with IDEA StatiCa 20.1
 Abstract class of patch support/load
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.PatchDevice
 IdeaRS.OpenModel.Detail.PatchLoad
 IdeaRS.OpenModel.Detail.PatchSupport
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class PatchDevice : OpenElementId
Public MustInherit Class PatchDevice
	Inherits OpenElementId
The PatchDevice type exposes the following members.
Constructors
Name | Description
PatchDevice
 Constructor
Top
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Position
 Offset between MasterPoint and patch support/load
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace