IDEA Open Model
MatConcrete Class
Compatible with IDEA StatiCa Beta 20.0
 Material concrete base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 More...
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class MatConcrete : Material
Public MustInherit Class MatConcrete
	Inherits Material
The MatConcrete type exposes the following members.
Constructors
Name | Description
MatConcrete
Initializes a new instance of the MatConcrete class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteACI
 IdeaRS.OpenModel.Material.MatConcreteAUS
 IdeaRS.OpenModel.Material.MatConcreteCAN
 IdeaRS.OpenModel.Material.MatConcreteEc2
 IdeaRS.OpenModel.Material.MatConcreteHKG
 IdeaRS.OpenModel.Material.MatConcreteIND
 IdeaRS.OpenModel.Material.MatConcreteRUS
 IdeaRS.OpenModel.Material.MatConcreteSIA