IDEA StatiCa Open Model
CrossSectionCreepCoefficientAttribute Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Cross-section creep coefficient attribute
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenAttribute
 IdeaRS.OpenModel.CrossSection.CrossSectionCreepCoefficientAttribute
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CrossSectionCreepCoefficientAttribute : OpenAttribute
Public Class CrossSectionCreepCoefficientAttribute
	Inherits OpenAttribute
public ref class CrossSectionCreepCoefficientAttribute : public OpenAttribute
The CrossSectionCreepCoefficientAttribute type exposes the following members.
Constructors
Name | Description
CrossSectionCreepCoefficientAttribute
 Constructor
Top
Properties
Name | Description
Components
 List of components
Top
Examples
 This sample shows how to create attributes for creep calculation.
//Creating the model
OpenModel openModel = new OpenModel();
//Set creep definition - on component 0, creep and notional size are calculated, humidity 60%
CrossSectionCreepCoefficientAttribute creepAttr = new CrossSectionCreepCoefficientAttribute();
creepAttr.Element = new ReferenceElement(css);
CrossSectionCreepCoefficientData creepComp = new CrossSectionCreepCoefficientData();
creepComp.CreepInput = InputValueType.Calculate;
creepComp.ComponentIndex = new List<int>() { 0 };
creepComp.Humidity = 0.6;
creepComp.NotionalSizeInput = InputValueType.Calculate;
creepAttr.Components.Add(creepComp);
openModel.AddObject(creepAttr);
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace