IDEA StatiCa Open Model
CombiInput Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Basic class combination
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.CombiInput
 IdeaRS.OpenModel.Loading.CombiInputEC
 IdeaRS.OpenModel.Loading.CombiInputSIA
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class CombiInput : OpenElementId
Public MustInherit Class CombiInput
	Inherits OpenElementId
public ref class CombiInput abstract : public OpenElementId
The CombiInput type exposes the following members.
Constructors
Name | Description
CombiInput
 Constructor
Top
Properties
Name | Description
Description
 Additional info
Items
 Combi Items in combination
Name
 Name of combination
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace