IDEA StatiCa Open Model
NadSetupValueFloat Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Setup value float
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueFloat
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class NadSetupValueFloat : NadSetupValue
Public Class NadSetupValueFloat
	Inherits NadSetupValue
public ref class NadSetupValueFloat : public NadSetupValue
The NadSetupValueFloat type exposes the following members.
Constructors
Name | Description
NadSetupValueFloat
Initializes a new instance of the NadSetupValueFloat class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace