IDEA StatiCa Open Model
StagedCheckSectionExtreme Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Standard check section extreme
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckSectionExtreme
 IdeaRS.OpenModel.Concrete.StagedCheckSectionExtreme
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class StagedCheckSectionExtreme : CheckSectionExtreme
Public Class StagedCheckSectionExtreme
	Inherits CheckSectionExtreme
public ref class StagedCheckSectionExtreme : public CheckSectionExtreme
The StagedCheckSectionExtreme type exposes the following members.
Constructors
Name | Description
StagedCheckSectionExtreme
 Constructor
Top
Properties
Name | Description
Time
 Time
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace