IDEA StatiCa Open Model
MatSteelIND Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Material steel IND
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelIND
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MatSteelIND : MatSteel
Public Class MatSteelIND
	Inherits MatSteel
public ref class MatSteelIND : public MatSteel
The MatSteelIND type exposes the following members.
Constructors
Name | Description
MatSteelIND
Initializes a new instance of the MatSteelIND class
Top
Properties
Name | Description
fu
 Ultimate strength
fy
 Yield strength
GammaOVfu
 Overstrength coefficient for fu
GammaOVfy
 Overstrength coefficient for fy
MaterialStrength
 Material strength for specific thickness of plate
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace