IDEA Open Model
SteelSetupCISC Class
Compatible with IDEA StatiCa 20.1
 Steel setup IBC class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupCISC
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SteelSetupCISC : SteelSetup
Public Class SteelSetupCISC
	Inherits SteelSetup
The SteelSetupCISC type exposes the following members.
Constructors
Name | Description
SteelSetupCISC
Initializes a new instance of the SteelSetupCISC class
Top
Properties
Name | Description
Anchor_Fiar
 Safety factor Anchor_Fiar
Bolt_Fib
 Safety factor Bolt_Fib
Structural_Fi
 Safety factor Structural_Fi
Weld_Fiw
 Safety factor Weld_Fiw
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel Namespace