IDEA StatiCa Open Model
BeamData Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Provides data of the connected beam
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Connection.BeamData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class BeamData : OpenElementId
Public Class BeamData
	Inherits OpenElementId
public ref class BeamData : public OpenElementId
The BeamData type exposes the following members.
Constructors
Name | Description
BeamData
Initializes a new instance of the BeamData class
Top
Properties
Name | Description
AddedMember
 Added member
AddedMemberLength
 Added beam lenght
AutoAddCutByWorkplane
 Automaticali add cut by workplane if it not defined
CrossSectionType
 Type of cross section
Cuts
 Cuts on the beam
IsAdded
 Is added beam
IsBearingMember
 Is beam bearing member
IsNegativeObject
 Is negative object
MirrorY
 Mirror by Y
MprlName
 MPRL name of beam
Name
 Name of the beam
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Plates
 Plates of the beam
RefLineInCenterOfGravity
 The reference line of the member is in the center of gravity of the cross-section
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace