IDEA Open Model
Region3D Class
Compatible with IDEA StatiCa 20.1
 Represents a region in three-dimensional space included outline (border) and openings.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.Region3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Region3D : OpenElementId
Public Class Region3D
	Inherits OpenElementId
The Region3D type exposes the following members.
Constructors
Name | Description
Region3D
 Constructor
Top
Properties
Name | Description
Openings
 Gets or sets the list of references to PolyLine3Dopenning curve in the Region3D.
Outline
 Gets or sets the reference to PolyLine3D curve of Region3D.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace