IDEA StatiCa Open Model
CombiInputSIA Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Combination according to SIA in the model
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.CombiInput
 IdeaRS.OpenModel.Loading.CombiInputSIA
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CombiInputSIA : CombiInput
Public Class CombiInputSIA
	Inherits CombiInput
public ref class CombiInputSIA : public CombiInput
The CombiInputSIA type exposes the following members.
Constructors
Name | Description
CombiInputSIA
 Constructor
Top
Properties
Name | Description
TypeCalculationCombi
 Type of combination
TypeCombiSIA
 Type of EC combination
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace