IDEA StatiCa Open Model
OpeningRectOffsets Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Representation of rectangular opening in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Opening
 IdeaRS.OpenModel.Detail.OpeningRectOffsets
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class OpeningRectOffsets : Opening
Public Class OpeningRectOffsets
	Inherits Opening
public ref class OpeningRectOffsets : public Opening
The OpeningRectOffsets type exposes the following members.
Constructors
Name | Description
OpeningRectOffsets
 Constructor
Top
Properties
Name | Description
OffsetX1
 top left X offset
OffsetX2
 top right x offset
OffsetY1
 right bottom y offset
OffsetY2
 right top y offset
X1
 Left
X2
 Right
Y1
 Bottom
Y2
 Top
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace