IDEA Open Model
MatSteel Class
Compatible with IDEA StatiCa 20.1
 Material steel base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 More...
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class MatSteel : Material
Public MustInherit Class MatSteel
	Inherits Material
The MatSteel type exposes the following members.
Constructors
Name | Description
MatSteel
Initializes a new instance of the MatSteel class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelAISC
 IdeaRS.OpenModel.Material.MatSteelAUS
 IdeaRS.OpenModel.Material.MatSteelCISC
 IdeaRS.OpenModel.Material.MatSteelEc2
 IdeaRS.OpenModel.Material.MatSteelHKG
 IdeaRS.OpenModel.Material.MatSteelCHN
 IdeaRS.OpenModel.Material.MatSteelIND
 IdeaRS.OpenModel.Material.MatSteelRUS