IDEA Open Model
CrossSectionParameter Class
Compatible with IDEA StatiCa Beta 20.0
 Cross-section defined by parameters
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.CrossSection.CrossSection
 IdeaRS.OpenModel.CrossSection.CrossSectionParameter
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class CrossSectionParameter : CrossSection
Public Class CrossSectionParameter
	Inherits CrossSection
The CrossSectionParameter type exposes the following members.
Constructors
Name | Description
CrossSectionParameter
 Constructor
Top
Properties
Name | Description
CrossSectionType
 Type of cross-section
Material
 Material
Parameters
 Parameters
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace