IDEA StatiCa Open Model
BondedTendon Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Bonded tendon
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Tendon
 IdeaRS.OpenModel.Model.BondedTendon
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class BondedTendon : Tendon
Public Class BondedTendon
	Inherits Tendon
public ref class BondedTendon : public Tendon
The BondedTendon type exposes the following members.
Constructors
Name | Description
BondedTendon
 Constructor
Top
Properties
Name | Description
Geometry
 Geometry
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace