IDEA Open Model
SelectionItemForResults Properties
Compatible with IDEA StatiCa v 10.1
The SelectionItemForResults type exposes the following members.
Properties
Name | Description
Coeff
 Coefficient
Description
 Description
Item
 ILibraryItem
TypeClassEvaluation
 TypeClassEvaluation
TypeOfLoad
 TypeOfLoad
Top
See Also
Reference
SelectionItemForResults Class
IdeaRS.OpenModel.Loading Namespace