IDEA Open Model
SetupValueDouble Properties
Compatible with IDEA StatiCa v 10.1
The SetupValueDouble type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
SetupValueDouble Class
IdeaRS.OpenModel.Concrete Namespace