IDEA Open Model
Reinforcement Properties
Compatible with IDEA StatiCa v 10.1
The Reinforcement type exposes the following members.
Properties
Name | Description
Material
 Material
ReinfId
 Id representing reinforcement in Detail
Top
See Also
Reference
Reinforcement Class
IdeaRS.OpenModel.Detail Namespace