IDEA Open Model
LineSupportSegment Properties
Compatible with IDEA StatiCa v 10.1
The LineSupportSegment type exposes the following members.
Properties
Name | Description
FlexibleStiffnessRX
 Support stiffness rotational RX
FlexibleStiffnessRY
 Support stiffness rotational RY
FlexibleStiffnessRZ
 Support stiffness rotational RZ
FlexibleStiffnessX
 Support stiffness X dirrection
FlexibleStiffnessY
 Support stiffness Y dirrection
FlexibleStiffnessZ
 Support stiffness Z dirrection
LocalCoordinateSystem
 Support local coord system
Segment
 Reference to geometrical segment3D
SupportTypeRX
 Support type in dirrection round X
SupportTypeRY
 Support type in dirrection round Y
SupportTypeRZ
 Support type in dirrection round Z
SupportTypeX
 Support type in dirrection X
SupportTypeY
 Support type in dirrection Y
SupportTypeZ
 Support type in dirrection Z
Top
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace