IDEA Open Model
Settlement Properties
Compatible with IDEA StatiCa v 10.1
The Settlement type exposes the following members.
Properties
Name | Description
Support
 Support with settlement
ValueRx
 Rotation around X-axis
ValueRy
 Rotation around Y-axis
ValueRz
 Rotation around Z-axis
ValueX
 Settlement in X dirrection of support
ValueY
 Settlement in Y dirrection of support
ValueZ
 Settlement in Z dirrection of support
Top
See Also
Reference
Settlement Class
IdeaRS.OpenModel.Loading Namespace