IDEA Open Model
Member1D Properties
Compatible with IDEA StatiCa v 10.1
The Member1D type exposes the following members.
Properties
Name | Description
Elements1D
 Array of element1D
HingeBegin
 Gets, sets hinge located in the begining of element
HingeEnd
 Gets, sets hinge located in the end of element
Member1DType
 Beam, column,...
Name
 Name of Element
Top
See Also
Reference
Member1D Class
IdeaRS.OpenModel.Model Namespace