IDEA Open Model
WallRect Properties
Compatible with IDEA StatiCa v 10.1
The WallRect type exposes the following members.
Properties
Name | Description
Height
 Height of wall
Offset1
 Offset horizontal top left
Offset2
 Offset horizontal top left
Width
 Width of wall
Top
See Also
Reference
WallRect Class
IdeaRS.OpenModel.Detail Namespace