IDEA Open Model
ArcSegment3D Properties
Compatible with IDEA StatiCa v 10.1
The ArcSegment3D type exposes the following members.
Properties
Name | Description
Point
 Gets or sets the reference to Point3D of circular arc somewhere between start and end point.
Top
See Also
Reference
ArcSegment3D Class
IdeaRS.OpenModel.Geometry3D Namespace