IDEA Open Model
MatPrestressSteel Properties
Compatible with IDEA StatiCa v 10.1
The MatPrestressSteel type exposes the following members.
Properties
Name | Description
Area
 Area
Diameter
 Diameter
EquivalentDiameter
 Equivalent diameter
NumberOfWires
 number of wires in strand
Top
See Also
Reference
MatPrestressSteel Class
IdeaRS.OpenModel.Material Namespace