IDEA Open Model
MatReinforcementACI Properties
Compatible with IDEA StatiCa v 10.1
The MatReinforcementACI type exposes the following members.
Properties
Name | Description
Epssu
 Characteristic strain of reinforcement
Fy
 Characteristic yield strength of reinforcement
Top
See Also
Reference
MatReinforcementACI Class
IdeaRS.OpenModel.Material Namespace