IDEA Open Model
BeamData Class
Compatible with IDEA StatiCa v 10.1
 Provides data of the connected beam
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Connection.BeamData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public class BeamData : OpenElementId
Public Class BeamData
	Inherits OpenElementId
public ref class BeamData : public OpenElementId
The BeamData type exposes the following members.
Constructors
Name | Description
BeamData
Initializes a new instance of the BeamData class
Top
Properties
Name | Description
AddedMember
 Added member
Cuts
 Cuts on the beam
IsAdded
 Is addes beam
IsNegativeObject
 Is negative object
MirrorY
 Mirro by Y
Name
 Name of the beam
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Plates
 Plates of the beam
RefLineInCenterOfGravity
 The reference line of the member is in the center of gravity of the cross-section
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace