IDEA Open Model
CombiInput Properties
Compatible with IDEA StatiCa v 10.1
The CombiInput type exposes the following members.
Properties
Name | Description
Description
 Additional info
Items
 Combi Items in combination
Name
 Name of combination
Top
See Also
Reference
CombiInput Class
IdeaRS.OpenModel.Loading Namespace