IDEA Open Model
MatConcreteEc2 Properties
Compatible with IDEA StatiCa v 10.1
The MatConcreteEc2 type exposes the following members.
Properties
Name | Description
AggregateType
 Type of aggregate
CalculateDependentValues
 Setting calculation dependent values on fck
CementClass
 Type of cement class
DiagramType
 Type of stress-strain diagram bilinear/parabolic/general for ULS calculation
Ecm
 Secant modulus of elasticity of concrete - Ecm
Epsc1
 Compressive strain in the concrete - εc1
Epsc2
 Compressive strain in the concrete - εc2
Epsc3
 Compressive strain in the concrete - εc3
Epscu1
 Ultimate compressive strain in the concrete - εcu1
Epscu2
 Ultimate compressive strain in the concrete - εcu2
Epscu3
 Ultimate compressive strain in the concrete - εcu3
Fck
 Characteristic compressive cylinder strength of concrete at 28 days - fck
Fcm
 Mean value of concrete cylinder compressive strength - fcm
Fctk_0_05
 Characteristic axial tensile strength of concrete 5% quantile - fctk,0,05
Fctk_0_95
 Characteristic axial tensile strength of concrete 95% quantile - fctk,0,95
Fctm
 Mean value of axial tensile strength of concrete - fctm
NFactor
 Coefficient n-factor - necessary parabolic part of stress-strain diagram - n
PlainConcreteDiagram
 Stress strain diagram with tension part
SilicaFume
 Contains silica fume
StoneDiameter
 Diameter of stone
UserDiagram
 Stress-strain diagram defined by user
Top
See Also
Reference
MatConcreteEc2 Class
IdeaRS.OpenModel.Material Namespace