IDEA Open Model
NadSetupValueFloat Properties
Compatible with IDEA StatiCa v 10.1
The NadSetupValueFloat type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
NadSetupValueFloat Class
IdeaRS.OpenModel.Concrete Namespace