IDEA Open Model
ConcreteSLSCheckResultCrackWidthEc2 Properties
Compatible with IDEA StatiCa v 10.1
The ConcreteSLSCheckResultCrackWidthEc2 type exposes the following members.
Properties
Name | Description
My
 Bending moment around y axis for quasi-permanent combination
Mz
 Bending moment around z axis for quasi-permanent combination
N
 Normal force for quasi-permanent combination
W
 calculated crack width value
Wlim
 limiting crack width value
Top
See Also
Reference
ConcreteSLSCheckResultCrackWidthEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace