IDEA Open Model
MatConcrete Class
Compatible with IDEA StatiCa v 10.1
 Material concrete base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 More...
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public abstract class MatConcrete : Material
Public MustInherit Class MatConcrete
	Inherits Material
public ref class MatConcrete abstract : public Material
The MatConcrete type exposes the following members.
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteACI
 IdeaRS.OpenModel.Material.MatConcreteAUS
 IdeaRS.OpenModel.Material.MatConcreteCAN
 IdeaRS.OpenModel.Material.MatConcreteEc2
 IdeaRS.OpenModel.Material.MatConcreteRUS
 IdeaRS.OpenModel.Material.MatConcreteSIA