IDEA Open Model
MatSteelAISC Properties
Compatible with IDEA StatiCa v 10.1
The MatSteelAISC type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fu40
 Ultimate strength for nominal thickness of the element > 40mm and <= 100mm - fu,(>40)
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
fy40
 Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)
Top
See Also
Reference
MatSteelAISC Class
IdeaRS.OpenModel.Material Namespace