IDEA Open Model
BeamData Properties
Compatible with IDEA StatiCa v 10.1
The BeamData type exposes the following members.
Properties
Name | Description
AddedMember
 Added member
Cuts
 Cuts on the beam
IsAdded
 Is addes beam
IsNegativeObject
 Is negative object
MirrorY
 Mirro by Y
Name
 Name of the beam
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Plates
 Plates of the beam
RefLineInCenterOfGravity
 The reference line of the member is in the center of gravity of the cross-section
Top
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace