IDEA Open Model
MatSteelRUS Properties
Compatible with IDEA StatiCa v 10.1
The MatSteelRUS type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength
fy
 Yield strength
GammaM
 Safety coefficient
GammaOVfu
 Overstrength coefficient for fu
GammaOVfy
 Overstrength coefficient for fy
MaterialStrength
 Material strength for specific thickness of plate
Top
See Also
Reference
MatSteelRUS Class
IdeaRS.OpenModel.Material Namespace