IDEA Open Model
Point3D Properties
Compatible with IDEA StatiCa v 10.1
The Point3D type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the Name
X
 Gets or sets the X-coordinate value
Y
 Gets or sets the Y-coordinate value
Z
 Gets or sets the Z-coordinate value
Top
See Also
Reference
Point3D Class
IdeaRS.OpenModel.Geometry3D Namespace