IDEA Open Model
SetupValueBool Properties
The SetupValueBool type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
SetupValueBool Class
IdeaRS.OpenModel.Concrete Namespace