IDEA Open Model
ResultOfDeformation Properties
The ResultOfDeformation type exposes the following members.
Properties
Name | Description
Fix
 Rotation around x-axis
Fiy
 Rotation around y-axis
Fiz
 Rotation around z-axis
Ux
 Deformation in the x direction
Uy
 Deformation in the y direction
Uz
 Deformation in the z direction
Top
See Also
Reference
ResultOfDeformation Class
IdeaRS.OpenModel.Result Namespace