IDEA Open Model
WallRect Properties
The WallRect type exposes the following members.
Properties
Name | Description
Height
 Height of wall
Width
 Width of wall
Top
See Also
Reference
WallRect Class
IdeaRS.OpenModel.Detail Namespace