IDEA Open Model
MatSteelAUS Class
 Material steel AISC
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelAUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class MatSteelAUS : MatSteel
Public Class MatSteelAUS
	Inherits MatSteel
public ref class MatSteelAUS : public MatSteel
The MatSteelAUS type exposes the following members.
Constructors
Name | Description
MatSteelAUS
Initializes a new instance of the MatSteelAUS class
Top
Properties
Name | Description
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace