IDEA Open Model
ConcreteMemberDataEc2 Properties
The ConcreteMemberDataEc2 type exposes the following members.
Properties
Name | Description
BeamData
 Beam data
CoeffKxForWmax
 coefficient kx to increase limited concrete crack - only Dutch NAD
ColumnData
 Column data
CreepCoeffInfinity
 Gets or sets the user defined creep coefficient in infinity. If null, then we calculate them.
CreepCoeffInfinityValue
 type of creep coefficient
DeflectionRequirement
 gets or set deflection requirement for deflection calculation
ExposureClassesData
 Exposure classes
MemberImportance
 Gets or sets the member importance.
RelativeHumidity
 Gets or sets the surrounding relative humidity.
Top
See Also
Reference
ConcreteMemberDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace