IDEA Open Model
PretensionedTendonGroupItem Properties
The PretensionedTendonGroupItem type exposes the following members.
Properties
Name | Description
Geometry
 Geometry
Top
See Also
Reference
PretensionedTendonGroupItem Class
IdeaRS.OpenModel.Model Namespace