IDEA Open Model
ConcreteSetup Properties
The ConcreteSetup type exposes the following members.
Properties
Name | Description
SetupValues
 Setup values
Top
See Also
Reference
ConcreteSetup Class
IdeaRS.OpenModel.Concrete Namespace