IDEA Open Model
ReinfFabric Properties
The ReinfFabric type exposes the following members.
Properties
Name | Description
Angle
 Rotation of fabric reinforcement related to global X coordinate
Cover
 Cover of reinforcement
CoverFromSetting
 Use cover from DetailModelSetting
DiameterX
 Bar diameter - direction X
DiameterY
 Bar diameter - direction Y
DistanceX
 Distance between bars - direction X
DistanceY
 Distance between bars - direction Y
MasterComponent
 Master component of reinforcement, if null, fabric reinforcement is in all components
Number
 number of fabric in wall projection
Position
 Position of bottom left corner of fabric reinforcement related to point number 1 of master wall
SeparatelyPerWall
 true - add fabric reinfrocement separatelly for each wall, false - merge walls and add reinforcement on merged shape
Top
See Also
Reference
ReinfFabric Class
IdeaRS.OpenModel.Detail Namespace