IDEA Open Model
ReinfBarOnMoreEdges Properties
The ReinfBarOnMoreEdges type exposes the following members.
Properties
Name | Description
Covers
 Covers
LengthFromFirstIntersection
 Length of bar from first intersection in the direction of edge
LengthFromLastIntersection
 Length of bar from last intersection in the direction of edge
MasterComponent
 Master component of reinforcement
MasterEdges
 Master Edges
WholeFirstEdge
 Bar is on whole length of first edge
WholeLastEdge
 Bar is on whole length of last edge
Top
See Also
Reference
ReinfBarOnMoreEdges Class
IdeaRS.OpenModel.Detail Namespace