IDEA Open Model
CrossSectionThermalAttribute Properties
The CrossSectionThermalAttribute type exposes the following members.
Properties
Name | Description
Components
 List of components
Top
See Also
Reference
CrossSectionThermalAttribute Class
IdeaRS.OpenModel.CrossSection Namespace