IDEA Open Model
MatConcreteACI Properties
The MatConcreteACI type exposes the following members.
Properties
Name | Description
Fcc
 Compressive strength of concrete
Top
See Also
Reference
MatConcreteACI Class
IdeaRS.OpenModel.Material Namespace