IDEA Open Model
BondedTendon Properties
The BondedTendon type exposes the following members.
Properties
Name | Description
Geometry
 Geometry
Top
See Also
Reference
BondedTendon Class
IdeaRS.OpenModel.Model Namespace