IDEA Open Model
RigidLink Properties
The RigidLink type exposes the following members.
Properties
Name | Description
MasterNode
 Node to which all six independent degrees of freedom for the element are assigned
RigidRX
 DOF rigid in RX dirrection
RigidRY
 DOF rigid in RY dirrection
RigidRZ
 DOF rigid in RZ dirrection
RigidX
 DOF rigid in X dirrection
RigidZ
 DOF rigid in Z dirrection
SlaveNodes
 Dependent nodes
Top
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace