IDEA Open Model
StagedCheckSection Properties
The StagedCheckSection type exposes the following members.
Properties
Name | Description
StagesLoading
 Stages loading
Top
See Also
Reference
StagedCheckSection Class
IdeaRS.OpenModel.Concrete Namespace