IDEA Open Model
MatSteelRUS Properties
The MatSteelRUS type exposes the following members.
Properties
Name | Description
fu
 Ultimate strength
fy
 Yield strength
Top
See Also
Reference
MatSteelRUS Class
IdeaRS.OpenModel.Material Namespace