IDEA Open Model
ConcreteSetupEc2 Properties
The ConcreteSetupEc2 type exposes the following members.
Properties
Name | Description
Annex
 Annex code
Nad
 Nad strategy
Top
See Also
Reference
ConcreteSetupEc2 Class
IdeaRS.OpenModel.Concrete Namespace