IDEA Open Model
SetupValueInt Properties
The SetupValueInt type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
SetupValueInt Class
IdeaRS.OpenModel.Concrete Namespace