IDEA Open Model
MatPrestressSteelEc2 Properties
The MatPrestressSteelEc2 type exposes the following members.
Properties
Name | Description
Agt
 Total elongation at max. force (prEN 10138)
DiagramType
 Type of diagram
Epsuk
 Characteristic strain at maximum load (EN 1992-1-1)
Fm
 Char. value of max. force (prEN 10138)
Fp01
 Char. 0.1% proof force
Fp01k
 0,1% proof-stress (EN 1992-1-1)
Fpk
 Characteristic tensile strength (EN 1992-1-1)
Fr
 Fatigue stress range (prEN 10138)
Production
 Production type
SurfaceCharacteristic
 Surface characteristic
Type
 Type of prestress steel
Top
See Also
Reference
MatPrestressSteelEc2 Class
IdeaRS.OpenModel.Material Namespace