IDEA Open Model
CrossSection Properties
The CrossSection type exposes the following members.
Properties
Name | Description
CrossSectionRotation
 Rotation of Cross - Section
Name
 Name of cross-section
Top
See Also
Reference
CrossSection Class
IdeaRS.OpenModel.CrossSection Namespace