IDEA Open Model
LineLoad Properties
The LineLoad type exposes the following members.
Properties
Name | Description
Angle
 angle of load
BegFx
 force in X at biginning
BegFy
 force in Y at beginning
BegPositionX
 point support position X
BegPositionY
 point support position Y
Direction
 local / global
DirectionType
 direction type of load
EdgePositionType
 edge position type
EndFx
 force in X at end
EndFy
 force in Y at end
EndPositionX
 point support position X
EndPositionY
 point support position Y
GeneralLine
 general shape
GeometryPointsPath
 list of line load points
LengthOnEdge
 length of load
MasterComponent
 Gets or sets the master component
MasterEdge
 master component edge
MasterPoint
 master point
Name
 Gets or set the name
PositionOnEdge
 position od edge
ResultantForces
 forces value
TypeEdgePosition
 edge position type
TypeLinePosition
 type of position
Top
See Also
Reference
LineLoad Class
IdeaRS.OpenModel.Detail.Loading Namespace