IDEA Open Model
Opening Properties
Compatible with IDEA StatiCa Beta 20.0
The Opening type exposes the following members.
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
InsertPoint
 Insert point 0 - 9
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Name
 Name
Outline
 Outline of Oopening
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Top
See Also
Reference
Opening Class
IdeaRS.OpenModel.Detail Namespace