IDEA Open Model
MatConcreteHKG Properties
Compatible with IDEA StatiCa Beta 20.0
The MatConcreteHKG type exposes the following members.
Properties
Name | Description
Epscu2
 Ultimate compressive strain in the concrete
Fcu
 Compressive strength of concrete
Top
See Also
Reference
MatConcreteHKG Class
IdeaRS.OpenModel.Material Namespace