IDEA Open Model
PlateData Properties
Compatible with IDEA StatiCa Beta 20.0
The PlateData type exposes the following members.
Properties
Name | Description
AxisX
 LCS - Axis X
AxisY
 LCS - Axis Y
AxisZ
 LCS - Axis Z
IsNegativeObject
 Is negative object
Material
 Name of the material
Name
 Name of the plate
Origin
 Origin of the plate LCS
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
OutlinePoints
 Outline points
Region
 Geometry of the plate in svg format
Thickness
 Thickness of the plate
Top
See Also
Reference
PlateData Class
IdeaRS.OpenModel.Connection Namespace