IDEA Open Model
Element2D Properties
Compatible with IDEA StatiCa Beta 20.0
The Element2D type exposes the following members.
Properties
Name | Description
EccentricityZ
 Displacement in local axis Z
ElementType
 Analysis type - shell, plate, wall
GeometricRegion
 Geometry region of element2D
InnerLines
 Inner lines of this region
InnerPoints
 Inner points of this region
Material
 Material
Thickness
 Thicknes of Element2D
Top
See Also
Reference
Element2D Class
IdeaRS.OpenModel.Model Namespace