IDEA Open Model
LoadOnLine Properties
Compatible with IDEA StatiCa Beta 20.0
The LoadOnLine type exposes the following members.
Properties
Name | Description
Bimp
 Impulse at the begin
Direction
 1=global, 0=local
Eimp
 Impulse at the end
ExY
 Eccentricity local Y on the beginning
ExYEnd
 Eccentricity local Y at the end
ExZ
 Eccentricity local Z on the beginning
ExZEnd
 Eccentricity local Z at the end
Geometry
 Segment3D or PolyLine3D
LoadProjection
 Gets, sets load projection
RelativeBeginPosition
 Begin position on Segment3D
RelativeEndPosition
 End position on Segment3D
Type
 Type of load
Top
See Also
Reference
LoadOnLine Class
IdeaRS.OpenModel.Loading Namespace