IDEA Open Model
ConcreteULSCheckResultShearEc2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteULSCheckResultShearEc2 type exposes the following members.
Properties
Name | Description
Ved
 shear force
Vrd
 decisive shear resistance
Vrdc
 shear resistance of concrete
Vrdmax
 shear resistance of compression strut
Vrdr
 shear resistance
Vrds
 shear resistance of shear reinforcement
Top
See Also
Reference
ConcreteULSCheckResultShearEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace