IDEA Open Model
PolyLine3D Properties
Compatible with IDEA StatiCa Beta 20.0
The PolyLine3D type exposes the following members.
Properties
Name | Description
Segments
 Gets or sets list of references to Segment3D of PolyLine3D.
Top
See Also
Reference
PolyLine3D Class
IdeaRS.OpenModel.Geometry3D Namespace