IDEA Open Model
ResultOfInteractionDiagramPlane Properties
Compatible with IDEA StatiCa Beta 20.0
The ResultOfInteractionDiagramPlane type exposes the following members.
Properties
Name | Description
LoadChart
 Polygon of Load
Plane
 Polygon of interaction diagram plane
Top
See Also
Reference
ResultOfInteractionDiagramPlane Class
IdeaRS.OpenModel.Result Namespace