IDEA Open Model
MaterialParam Class
Compatible with IDEA StatiCa Beta 20.0
 Parameter which represts the record of the material in IDEA MPRL
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Parameters.MprlRecord
 IdeaRS.OpenModel.Parameters.MaterialParam
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class MaterialParam : MprlRecord
<SerializableAttribute>
Public Class MaterialParam
	Inherits MprlRecord
The MaterialParam type exposes the following members.
Constructors
Name | Description
MaterialParam
Initializes a new instance of the MaterialParam class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace