IDEA Open Model
PointOnLine3D Class
Compatible with IDEA StatiCa Beta 20.0
 Represents a Point dependent on the line in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.PointOnLine3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class PointOnLine3D : OpenElementId
Public Class PointOnLine3D
	Inherits OpenElementId
The PointOnLine3D type exposes the following members.
Constructors
Name | Description
PointOnLine3D
Initializes a new instance of the PointOnLine3D class
Top
Properties
Name | Description
Geometry
 Gets or sets the reference to PolyLine3D line or Segment3D segment.
IsFromStart
 Gets or sets the position value is measured from the start or the ent of the line.
IsRelative
 Gets or sets absolute or relative representation of the position value.
Position
 Gets or sets the position value on the line.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace