IDEA Open Model
Beam Class
Compatible with IDEA StatiCa Beta 20.0
 Representation of 1D member in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.Element1D
 IdeaRS.OpenModel.Detail.Beam
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class Beam : Element1D, IGeometryPart
Public Class Beam
	Inherits Element1D
	Implements IGeometryPart
The Beam type exposes the following members.
Constructors
Name | Description
Beam
 Constructor
Top
Properties
Name | Description
Edges
 Lines of Element2D including edges, which are created by opening
GeomId
 Id representing geometrical parts of Detail
InsertPoint
 Insert point 0 - 9
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace