IDEA Open Model
CrossSectionParam Class
Compatible with IDEA StatiCa Beta 20.0
 Parameter which represts the record of the cross-section in IDEA MPRL
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Parameters.MprlRecord
 IdeaRS.OpenModel.Parameters.CrossSectionParam
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class CrossSectionParam : MprlRecord
<SerializableAttribute>
Public Class CrossSectionParam
	Inherits MprlRecord
The CrossSectionParam type exposes the following members.
Constructors
Name | Description
CrossSectionParam
Initializes a new instance of the CrossSectionParam class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace