IDEA Open Model
MatSteelEc2 Class
Compatible with IDEA StatiCa Beta 20.0
 Material steel Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelEc2
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatSteelEc2 : MatSteel
Public Class MatSteelEc2
	Inherits MatSteel
The MatSteelEc2 type exposes the following members.
Constructors
Name | Description
MatSteelEc2
Initializes a new instance of the MatSteelEc2 class
Top
Properties
Name | Description
DiagramType
 Type of material diagram
fu
 Ultimate strength for nominal thickness of the element <= 40mm - fu
fu40
 Ultimate strength for nominal thickness of the element > 40mm and <= 100mm - fu,(>40)
fy
 Yield strength for nominal thickness of the element <= 40mm - fy
fy40
 Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)
UserDiagram
 Stress-strain diagram defined by user
Top
Examples
 This sample shows how to create steel material.
//Creating the model
OpenModel openModel = new OpenModel();
//Steel material
MatSteelEc2 matS = new MatSteelEc2();
matS.Name = "S275";
matS.UnitMass = 7850.0;
matS.E = 200e9;
matS.Poisson = 0.2;
matS.G = 83.333e9;
matS.SpecificHeat = 0.6;
matS.ThermalExpansion = 0.00001;
matS.ThermalConductivity = 45;
matS.fy = 235e6;
matS.fu = 360e6;
matS.fy40 = 215e6;
matS.fu40 = 340e6;
//Setting thermal characteristcs of material (in this case by the code)
matS.StateOfThermalConductivity = ThermalConductivityState.Code;
matS.StateOfThermalExpansion = ThermalExpansionState.Code;
matS.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
matS.StateOfThermalStressStrain = ThermalStressStrainState.Code;
matS.DiagramType = SteelDiagramType.Bilinear;
openModel.AddObject(matS);
See Also
Reference
IdeaRS.OpenModel.Material Namespace