IDEA Open Model
MatSteelHKG Class
Compatible with IDEA StatiCa Beta 20.0
 Material steel HKG
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelHKG
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatSteelHKG : MatSteel
Public Class MatSteelHKG
	Inherits MatSteel
The MatSteelHKG type exposes the following members.
Constructors
Name | Description
MatSteelHKG
Initializes a new instance of the MatSteelHKG class
Top
Properties
Name | Description
fu
 Ultimate strength - Yu
fy
 Yield strength - Ys
GammaOVfu
 Overstrength coefficient for fu
GammaOVfy
 Overstrength coefficient for fy
MaterialStrength
 Material strength for specific thickness of plate
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace