IDEA Open Model
MatConcreteHKG Class
Compatible with IDEA StatiCa Beta 20.0
 Material concrete HKG
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteHKG
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatConcreteHKG : MatConcrete
Public Class MatConcreteHKG
	Inherits MatConcrete
The MatConcreteHKG type exposes the following members.
Constructors
Name | Description
MatConcreteHKG
 Constructor
Top
Properties
Name | Description
Epscu2
 Ultimate compressive strain in the concrete
Fcu
 Compressive strength of concrete
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace