IDEA Open Model
ISDModel Class
Compatible with IDEA StatiCa Beta 20.0
 Model of IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.ISDModel
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ISDModel : OpenElementId
Public Class ISDModel
	Inherits OpenElementId
The ISDModel type exposes the following members.
Constructors
Name | Description
ISDModel
 Constructor
Top
Properties
Name | Description
Geometry
 All geometrical entities of Detail
ISDType
 Type of IDEA StatiCa Detail
Loading
 All loading entities of Detail
Reinforcement
 All reinforcement of Detail
Setting
 Setting
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace