IDEA Open Model
LineSegment3D Class
Compatible with IDEA StatiCa Beta 20.0
 Represents a line segment in three-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Geometry3D.Segment3D
 IdeaRS.OpenModel.Geometry3D.LineSegment3D
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class LineSegment3D : Segment3D
Public Class LineSegment3D
	Inherits Segment3D
The LineSegment3D type exposes the following members.
Constructors
Name | Description
LineSegment3D
Initializes a new instance of the LineSegment3D class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace