IDEA Open Model
CheckSection Class
Compatible with IDEA StatiCa Beta 20.0
 Check section base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Concrete.CheckSection
 IdeaRS.OpenModel.Concrete.StagedCheckSection
 IdeaRS.OpenModel.Concrete.StandardCheckSection
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class CheckSection : OpenElementId
Public MustInherit Class CheckSection
	Inherits OpenElementId
The CheckSection type exposes the following members.
Constructors
Name | Description
CheckSection
 Constructor
Top
Properties
Name | Description
Description
 Description of this section
Extremes
 Section extremes
CheckMember
 CheckMember
ReinfSection
 Reinforcement of cross-section
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace