IDEA Open Model
ConcreteULSCheckResultFatigue Class
Compatible with IDEA StatiCa Beta 20.0
 ULS Check Fatigue base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultFatigue
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultFatigueEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ConcreteULSCheckResultFatigue : ConcreteCheckResultBase
Public MustInherit Class ConcreteULSCheckResultFatigue
	Inherits ConcreteCheckResultBase
The ConcreteULSCheckResultFatigue type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultFatigue
Initializes a new instance of the ConcreteULSCheckResultFatigue class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace