IDEA Open Model
SelectionItemForResults Class
Compatible with IDEA StatiCa Beta 20.0
 SelectionItemForResults
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Loading.SelectionItemForResults
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class SelectionItemForResults : OpenElementId
Public Class SelectionItemForResults
	Inherits OpenElementId
The SelectionItemForResults type exposes the following members.
Constructors
Name | Description
SelectionItemForResults
Initializes a new instance of the SelectionItemForResults class
Top
Properties
Name | Description
Coeff
 Coefficient
Description
 Description
Item
 ILibraryItem
TypeClassEvaluation
 TypeClassEvaluation
TypeOfLoad
 TypeOfLoad
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace