IDEA Open Model
ConcreteSLSCheckResultStiffness Class
Compatible with IDEA StatiCa Beta 20.0
 SLS Check tiffness base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStiffness
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultStiffnessEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ConcreteSLSCheckResultStiffness : ConcreteCheckResultBase
Public MustInherit Class ConcreteSLSCheckResultStiffness
	Inherits ConcreteCheckResultBase
The ConcreteSLSCheckResultStiffness type exposes the following members.
Constructors
Name | Description
ConcreteSLSCheckResultStiffness
Initializes a new instance of the ConcreteSLSCheckResultStiffness class
Top
Properties
Name | Description
Fr
 crack resistance internal forces
CharacteristicsI
 stiffnesses calculated on uncracked cross-section
CharacteristicsII
 stiffnesses calculated on cracked cross-section
LinearStiffness
 linear stiffnesses
Stiffness
 result stiffnesses
StiffnessI
 stiffnesses calculated on uncracked cross-section
StiffnessII
 stiffnesses calculated on fully-cracked cross-section
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace