IDEA Open Model
MatConcreteAUS Class
Compatible with IDEA StatiCa Beta 20.0
 Material concrete AUS
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteAUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatConcreteAUS : MatConcrete
Public Class MatConcreteAUS
	Inherits MatConcrete
The MatConcreteAUS type exposes the following members.
Constructors
Name | Description
MatConcreteAUS
 Constructor
Top
Properties
Name | Description
Fcc
 Compressive strength of concrete
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace