IDEA Open Model
MatConcreteACI Class
Compatible with IDEA StatiCa Beta 20.0
 Material concrete ACI
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatConcrete
 IdeaRS.OpenModel.Material.MatConcreteACI
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatConcreteACI : MatConcrete
Public Class MatConcreteACI
	Inherits MatConcrete
The MatConcreteACI type exposes the following members.
Constructors
Name | Description
MatConcreteACI
 Constructor
Top
Properties
Name | Description
Fcc
 Compressive strength of concrete
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace