IDEA Connection Link
Log4NetHelper Class
 Log4NetHelper
Inheritance Hierarchy
System.Object
 IdeaRS.ConnectionLink.Log4NetHelper
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class Log4NetHelper
Public Class Log4NetHelper
public ref class Log4NetHelper
The Log4NetHelper type exposes the following members.
Constructors
Name | Description
Log4NetHelper
Initializes a new instance of the Log4NetHelper class
Top
Methods
Name | Description
Initialize
 Initialize
Top
See Also
Reference
IdeaRS.ConnectionLink Namespace