IDEA Connection Link
ConnectionLink Class
 This class is responsible for controlling the aplication IdeaConnection from 3rd other applications. It allows to create IdeaConnection project from IdeaOpenModel (IOM), to run CBFEM analysis and to get results.
Inheritance Hierarchy
System.Object
 IdeaRS.ConnectionLink.ConnectionLink
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class ConnectionLink : IDisposable,
	IAppController
Public Class ConnectionLink
	Implements IDisposable, IAppController
public ref class ConnectionLink : IDisposable,
	IAppController
The ConnectionLink type exposes the following members.
Constructors
Name | Description
ConnectionLink
Initializes a new instance of the ConnectionLink class
Top
Properties
Name | Description
ExtrenalLinkLogger
 ExtrenalLinkLogger
TempConCheckResultsString
 TempConCheckResultsString
TempFileFullName
 FileFullName
Top
Methods
Name | Description
CalculateIdeaConnection
Dispose
 Releases all used resources and deletes all temporary files
GenerateSourceConnectionData
 Opens the application Idea Connection and waits till this application is closed
GetConInputProjectTestFilename
 Gets file name of the xml which includes input data.
GetConnectionData
GetConnectionDataXML
GetConnectionProjectInfo
GetFEAResultsArchive
 Gets the filename of the temporary archive which includes FEA results. If results do not exist CBFEM analysis is executed.
GetCheckResultsFilename
 Gets file name of the xml which includes check results. If results do not exist CBFEM analysis is executed
GetIdeaConnection
 Opens the application Idea Connection and waits till this application is closed
GetIdeaConnectionProject
GetProtocolArchive
 Gets the filename of the temporary ZIP archive which includes the protocol of the check of the connection. If the protocol doesn't exist CBFEM analysis is executed and protocol is generated.
GetProtocolArchiveForProject
 Gets the filename of the temporary ZIP archive which includes the protocol of the check of the connection. If the protocol doesn't exist CBFEM analysis is executed and protocol is generated.
GetResultsData
 Gets results of the connection check
IsConnectionProject
 Returns true if the connection project exists
IsProjectCalculated
 Returns true if connection project is calculated
OpenIdeaConnection(Byte[], Byte[], Byte[], Byte[], Byte[])
OpenIdeaConnection(Stream, Stream, Stream, Stream, Stream, Boolean)
 Opens the application Idea Connection and waits till this application is closed
OpenIdeaConnectionIDEA
 Opens the application Idea Connection and waits till this application is closed
OpenIdeaConnectionInternal
 Opens the application Idea Connection and waits till this application is closed
OpenIdeaConnectionService
OpenIdeaConnectionWithName
 Opens the application Idea Connection and waits till this application is closed
RunHiddenAnalysis
 Returns string which represents xml with results of the connection CBFEM design
TestConnection(Action<IIOMSettings, IDEAProgress>, String, List<Int32>, List<Int32>, List<Int32>, String)
 Test Connection
TestConnection(Action<IIOMSettings, IDEAProgress>, String, List<String>, List<String>, List<String>, String)
 Test Connection
TestValidCSSInIDEADatabase
 Test method for valid rolled steel cross-section names in IDEA aplication
WriteConCheckResults
 Writes check results in xml format into outStream If results do not exist CBFEM analysis is executed
WriteFEAResultsArchive
 Writes archive including FEA results into outStream f results do not exist CBFEM analysis is executed
WriteProjectData
 Writes binary data of IdeaConnection project into outStream
WriteProtocolArchive
 Writes archive including calculation protocol to outStream. If the protocol doesn't exist CBFEM analysis is executed and protocol is generated.
Top
Fields
Name | Description
LinkLogger
 LinkLogger
Top
See Also
Reference
IdeaRS.ConnectionLink Namespace