IDEA Connection Link
WizardSelection Class
 WizardSelection
Inheritance Hierarchy
System.Object
 IdeaRS.ConnectionLink.WizardSelection
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
[SerializableAttribute]
public class WizardSelection
<SerializableAttribute>
Public Class WizardSelection
[SerializableAttribute]
public ref class WizardSelection
The WizardSelection type exposes the following members.
Constructors
Name | Description
WizardSelection
 Constructor
Top
Properties
Name | Description
CombiInput
 List of Combinations
LoadCase
 List of LoadCases
LoadGroup
 List of Load groups
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.ConnectionLink Namespace