IDEA Connection Link
Log4NetHelper Methods
The Log4NetHelper type exposes the following members.
Methods
Name | Description
Initialize
 Initialize
Top
See Also
Reference
Log4NetHelper Class
IdeaRS.ConnectionLink Namespace