IDEA Connection Link
ConnectionSrv Methods
The ConnectionSrv type exposes the following members.
Methods
Name | Description
CalculateProject
 CalculateProject
CloseServices
 CloseServices
GetConnectionModel
 GetConnectionModel
GetConnectionModelDesktop
 GetConnectionModelDesktop
GetConnectionResultsData
 GetConnectionResultsData
GetDetailedConResultsData
 Get detailed results of checks
GetDetailedConResultsJSON
 Get detailed results of checks inJSOM
GetNonconformities
 Get all nonconformities for connection
GetResultFile
 GetResultFile
GetWeldStress
 Weld curve for weld ID and connection
GetWeldUid
 Weld id from connection model
ImportFromIOM(Byte[])
 ImportFromIOM
ImportFromIOM(OpenModel, OpenModelResult)
 ImportFromIOM
OpenConnectionService
 Open connection project from data contract
OpenIdeaConProjectFile
 OpenIdeaConProjectFile
OpenIdeaConProjectFileAndResultFile
 OpenIdeaConProjectFileAndResultFile
ReadFully
 ReadFully
SaveIdeaConToProjectFile
 SaveIdeaConToProjectFile
SaveResultToFile
 SaveResultToFile
SetAndOpenIdeaConProjectFile
 OpenIdeaConProjectFile
SetAndOpenIdeaConProjectFileAndResultFile
 OpenIdeaConProjectFileAndResultFile
StreamToByteArray
 StreamToByteArray
Top
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace