IDEA Open Model
MatConcreteCAN Properties
Compatible with IDEA StatiCa Beta 20.0
The MatConcreteCAN type exposes the following members.
Properties
Name | Description
Fcc
 Compressive strength of concrete
Top
See Also
Reference
MatConcreteCAN Class
IdeaRS.OpenModel.Material Namespace