IDEA Open Model
ReinfBarByPolyline Properties
Compatible with IDEA StatiCa Beta 20.0
The ReinfBarByPolyline type exposes the following members.
Properties
Name | Description
BarDistance
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
BarShape
 Polyline representing shape of bar
Distance
 Distance between reinforcement layers
MasterComponent
 Master component of reinforcement
MasterPoint
 Master point of reinforcement
NumOfLayers
 Number of layers
Position
 Offset between master point and first point of BarShape
Top
See Also
Reference
ReinfBarByPolyline Class
IdeaRS.OpenModel.Detail Namespace