IDEA Open Model
PointResultOfTA Properties
Compatible with IDEA StatiCa Beta 20.0
The PointResultOfTA type exposes the following members.
Properties
Name | Description
Temp
 Temperature
Top
See Also
Reference
PointResultOfTA Class
IdeaRS.OpenModel.Result Namespace