IDEA Open Model
ConcreteCheckDetailingEc2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteCheckDetailingEc2 type exposes the following members.
Properties
Name | Description
CheckValueLongReinf
 check value of longitudinal reinforcement
CheckValueShearReinf
 check value of shear reinforcement
Top
See Also
Reference
ConcreteCheckDetailingEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace