IDEA Open Model
CrossSectionComponent Properties
Compatible with IDEA StatiCa Beta 20.0
The CrossSectionComponent type exposes the following members.
Properties
Name | Description
Components
 List of components
Top
See Also
Reference
CrossSectionComponent Class
IdeaRS.OpenModel.CrossSection Namespace