IDEA Open Model
PointSupportNode Properties
Compatible with IDEA StatiCa Beta 20.0
The PointSupportNode type exposes the following members.
Properties
Name | Description
FlexibleStiffnessRX
 Support stiffness rotational RX
FlexibleStiffnessRY
 Support stiffness rotational RY
FlexibleStiffnessRZ
 Support stiffness rotational RZ
FlexibleStiffnessX
 Support stiffness X dirrection
FlexibleStiffnessY
 Support stiffness Y dirrection
FlexibleStiffnessZ
 Support stiffness Z dirrection
LocalCoordinateSystem
 Support local coord system
Point
 Reference to geometrical point
SupportTypeRX
 Support type in dirrection round X
SupportTypeRY
 Support type in dirrection round Y
SupportTypeRZ
 Support type in dirrection round Z
SupportTypeX
 Support type in dirrection X
SupportTypeY
 Support type in dirrection Y
SupportTypeZ
 Support type in dirrection Z
Top
See Also
Reference
PointSupportNode Class
IdeaRS.OpenModel.Model Namespace