IDEA Open Model
DappedEnd Properties
Compatible with IDEA StatiCa Beta 20.0
The DappedEnd type exposes the following members.
Properties
Name | Description
DappedEndHaunch
 Type of haunch on dapped end
GeomId
 Id representing geometrical parts of Detail
Haunch
 Haunch size of dapped end
Height
 Height of dapped end
MasterComponent
 Master component
MasterPoint
 Insert point 0 - 1
Outline
 Outline of dapped end
Position
 Offset between MasterPoint and InsertPoint
Rotation
 Rotation of dapped end
Width
 Width of dapped end
Top
See Also
Reference
DappedEnd Class
IdeaRS.OpenModel.Detail Namespace