IDEA Open Model
BoltAssembly Properties
Compatible with IDEA StatiCa Beta 20.0
The BoltAssembly type exposes the following members.
Properties
Name | Description
BoltGrade
 Bolt grade
Borehole
 Size of borehole
DiagonalHeadDiameter
 Second diameter of the head
Diameter
 Bolt diameter
GrossArea
 Gross cross-section area
HeadDiameter
 Diameter of the head
HeadHeight
 Thickness of head
Name
 Name of bolt assembly
NutThickness
 Thickness of Nut
TensileStressArea
 Tensile stress area
WasherAtHead
 Washer at head side of bolt assembly
WasherAtNut
 Is washer at Nut side of bolt assembly
WasherThickness
 Thickness of washer
Top
See Also
Reference
BoltAssembly Class
IdeaRS.OpenModel.Material Namespace