IDEA Open Model
PointLoadOnLine Properties
Compatible with IDEA StatiCa Beta 20.0
The PointLoadOnLine type exposes the following members.
Properties
Name | Description
Direction
 Local / global
Ey
 Eccentricity in Y direction
Ez
 Eccentricity in Z direction
Fx
 Force in X direction
Fy
 Force in Y direction
Fz
 Force in Z direction
Geometry
 Segment3D or PolyLine3D
Mx
 Moment about the x-axis
My
 Moment about the y-axis
Mz
 Moment about the z-axis
RelativePosition
 Relative position on geometry line
Top
See Also
Reference
PointLoadOnLine Class
IdeaRS.OpenModel.Loading Namespace