IDEA Open Model
ConcreteULSCheckResultTorsionEc2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteULSCheckResultTorsionEc2 type exposes the following members.
Properties
Name | Description
Ted
 Design value of the applied torsional moment
Trd
 decisive design torsional resistance
Trdc
 torsional cracking moment
Trdmax
 design torsional resistance moment
Trds
 design torsional resistance moment of shear reinforcement
Top
See Also
Reference
ConcreteULSCheckResultTorsionEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace