IDEA Open Model
ConnectionPoint Properties
Compatible with IDEA StatiCa Beta 20.0
The ConnectionPoint type exposes the following members.
Properties
Name | Description
BearingMember
 Bearing Member
ConnectedMembers
 Connected members as collection of IDs.
Name
 Name of Element
Node
 Node
NodeId |  Obsolete.
 Id of node
NodeIdSerialize
 Gets or sets the Id of node for Xml serialization (back compatibility).
ProjectFileName
 Set filename for Connection
Top
See Also
Reference
ConnectionPoint Class
IdeaRS.OpenModel.Connection Namespace