IDEA Open Model
ReinforcedCrossSection Properties
Compatible with IDEA StatiCa Beta 20.0
The ReinforcedCrossSection type exposes the following members.
Properties
Name | Description
Bars
 Reinforced bars
CrossSection
 Cross-section
Name
 Name of cross-section
Stirrups
 Stirrups
TendonBars
 Tendon bars
TendonDucts
 Tendon ducts
Top
See Also
Reference
ReinforcedCrossSection Class
IdeaRS.OpenModel.CrossSection Namespace