IDEA Open Model
LoadCase Properties
Compatible with IDEA StatiCa Beta 20.0
The LoadCase type exposes the following members.
Properties
Name | Description
Load
 Load
LoadCaseType
 Type of load case
Top
See Also
Reference
LoadCase Class
IdeaRS.OpenModel.Detail.Loading Namespace