IDEA Open Model
ParameterBool Class
Compatible with IDEA StatiCa Beta 20.0
 Boolean parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterBool
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ParameterBool : Parameter
Public Class ParameterBool
	Inherits Parameter
The ParameterBool type exposes the following members.
Constructors
Name | Description
ParameterBool
Initializes a new instance of the ParameterBool class
Top
Properties
Name | Description
Value
 Value
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace