IDEA Open Model
SubStructure Class
Compatible with IDEA StatiCa Beta 20.0
 SubStructure
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Model.SubStructure
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class SubStructure : OpenElementId
Public Class SubStructure
	Inherits OpenElementId
The SubStructure type exposes the following members.
Constructors
Name | Description
SubStructure
 Constructor
Top
Properties
Name | Description
Geometry
 Geometry
Loading
 Loading
Name
 Name
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace