IDEA Open Model
MatSteelRUS Class
Compatible with IDEA StatiCa Beta 20.0
 Material steel RUS
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MatSteel
 IdeaRS.OpenModel.Material.MatSteelRUS
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MatSteelRUS : MatSteel
Public Class MatSteelRUS
	Inherits MatSteel
The MatSteelRUS type exposes the following members.
Constructors
Name | Description
MatSteelRUS
Initializes a new instance of the MatSteelRUS class
Top
Properties
Name | Description
fu
 Ultimate strength
fy
 Yield strength
GammaM
 Safety coefficient
GammaOVfu
 Overstrength coefficient for fu
GammaOVfy
 Overstrength coefficient for fy
MaterialStrength
 Material strength for specific thickness of plate
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace