IDEA Open Model
ConcreteSetupEc2 Class
Compatible with IDEA StatiCa Beta 20.0
 Concrete setup Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Concrete.ConcreteSetup
 IdeaRS.OpenModel.Concrete.ConcreteSetupEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteSetupEc2 : ConcreteSetup
Public Class ConcreteSetupEc2
	Inherits ConcreteSetup
The ConcreteSetupEc2 type exposes the following members.
Constructors
Name | Description
ConcreteSetupEc2
Initializes a new instance of the ConcreteSetupEc2 class
Top
Properties
Name | Description
Annex
 Annex code
Nad
 Nad strategy
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace