IDEA Open Model
MaterialBoltGradeHKG Class
Compatible with IDEA StatiCa Beta 20.0
 Material bolt grade
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MaterialBoltGrade
 IdeaRS.OpenModel.Material.MaterialBoltGradeHKG
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MaterialBoltGradeHKG : MaterialBoltGrade
Public Class MaterialBoltGradeHKG
	Inherits MaterialBoltGrade
The MaterialBoltGradeHKG type exposes the following members.
Constructors
Name | Description
MaterialBoltGradeHKG
Initializes a new instance of the MaterialBoltGradeHKG class
Top
Properties
Name | Description
Pbb
 Design bearing strength
Ps
 Design shear strength
Pt
 Design tension strength
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace