IDEA Open Model
Opening Class
Compatible with IDEA StatiCa Beta 20.0
 Representation of opening in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Opening
 IdeaRS.OpenModel.Detail.OpeningCirc
 IdeaRS.OpenModel.Detail.OpeningRect
 IdeaRS.OpenModel.Detail.OpeningRectOffsets
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class Opening : OpenElementId
Public Class Opening
	Inherits OpenElementId
The Opening type exposes the following members.
Constructors
Name | Description
Opening
 Constructor
Top
Properties
Name | Description
GeomId
 Id representing geometrical parts of Detail
InsertPoint
 Insert point 0 - 9
MasterComponent
 Master component
MasterPoint
 Master point 0 - 9
Name
 Name
Outline
 Outline of Oopening
Position
 Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace