IDEA Open Model
ConnectionPoint Class
Compatible with IDEA StatiCa Beta 20.0
 ConnectedDesignMemeber
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Connection.ConnectionPoint
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConnectionPoint : OpenElementId
Public Class ConnectionPoint
	Inherits OpenElementId
The ConnectionPoint type exposes the following members.
Constructors
Name | Description
ConnectionPoint
 Constructor
Top
Properties
Name | Description
BearingMember
 Bearing Member
ConnectedMembers
 Connected members as collection of IDs.
Name
 Name of Element
Node
 Node
NodeId |  Obsolete.
 Id of node
NodeIdSerialize
 Gets or sets the Id of node for Xml serialization (back compatibility).
ProjectFileName
 Set filename for Connection
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace