IDEA Open Model
CalculationCase Class
Compatible with IDEA StatiCa Beta 20.0
 load case/combination data
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Loading.CalculationCase
 IdeaRS.OpenModel.Detail.Loading.LoadCase
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class CalculationCase : OpenElementId
Public MustInherit Class CalculationCase
	Inherits OpenElementId
The CalculationCase type exposes the following members.
Constructors
Name | Description
CalculationCase
 constructor
Top
Properties
Name | Description
IsActive
 active load case/combination
Name
 Gets or set the name
Top
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace