IDEA Open Model
ConcreteULSCheckResultTorsion Class
Compatible with IDEA StatiCa Beta 20.0
 ULS Check Torsion base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsion
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultTorsionEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ConcreteULSCheckResultTorsion : ConcreteCheckResultBase
Public MustInherit Class ConcreteULSCheckResultTorsion
	Inherits ConcreteCheckResultBase
The ConcreteULSCheckResultTorsion type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultTorsion
Initializes a new instance of the ConcreteULSCheckResultTorsion class
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace