IDEA Open Model
MaterialBoltGrade Class
Compatible with IDEA StatiCa Beta 20.0
 Material bolt grade
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Material.MaterialBoltGrade
 IdeaRS.OpenModel.Material.MaterialBoltGradeHKG
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class MaterialBoltGrade : Material
Public Class MaterialBoltGrade
	Inherits Material
The MaterialBoltGrade type exposes the following members.
Constructors
Name | Description
MaterialBoltGrade
Initializes a new instance of the MaterialBoltGrade class
Top
Properties
Name | Description
Code
 Design code
Elongation
 Elongation after fracture - for 20% elongation use value 0.2
fub
 Ultimate tensile strength
fyb
 Yield strength
MprlElementID
 Name fo the bolt grade in MPRL database
MprlTableID
 Unique ID of MPRL database table where the bolt grade was taken from.
Top
See Also
Reference
IdeaRS.OpenModel.Material Namespace