IDEA Open Model
ParameterString Class
Compatible with IDEA StatiCa Beta 20.0
 String parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterString
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ParameterString : Parameter
Public Class ParameterString
	Inherits Parameter
The ParameterString type exposes the following members.
Constructors
Name | Description
ParameterString
Initializes a new instance of the ParameterString class
Top
Properties
Name | Description
Value
 Value
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace