IDEA Open Model
NadSetupValueShort Class
Compatible with IDEA StatiCa Beta 20.0
 Setup value bool
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueShort
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class NadSetupValueShort : NadSetupValue
Public Class NadSetupValueShort
	Inherits NadSetupValue
The NadSetupValueShort type exposes the following members.
Constructors
Name | Description
NadSetupValueShort
Initializes a new instance of the NadSetupValueShort class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace