IDEA Open Model
NadSetupValueInt Class
Compatible with IDEA StatiCa Beta 20.0
 Setup value int
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueInt
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class NadSetupValueInt : NadSetupValue
Public Class NadSetupValueInt
	Inherits NadSetupValue
The NadSetupValueInt type exposes the following members.
Constructors
Name | Description
NadSetupValueInt
Initializes a new instance of the NadSetupValueInt class
Top
Properties
Name | Description
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace