IDEA Open Model
ReinforcementGroup Class
Compatible with IDEA StatiCa Beta 20.0
 Base class representing group reinforcement in IDEA StatiCa Detail
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 More...
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ReinforcementGroup : Reinforcement
Public MustInherit Class ReinforcementGroup
	Inherits Reinforcement
The ReinforcementGroup type exposes the following members.
Constructors
Name | Description
ReinforcementGroup
Initializes a new instance of the ReinforcementGroup class
Top
Properties
Name | Description
Cover
 Cover of reinforcement
CoverFromSetting
 Use cover from DetailModelSetting
Diameter
 Diameter o reinforcement
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
EndsTypeBeg
 End type of the beginning of reinforcement bar
EndsTypeEnd
 End type of the end of reinforcement bar
NumOfBarsInLayer
 Number of bars in layer
Top
See Also
Reference
IdeaRS.OpenModel.Detail Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Detail.ReinforcementGroup
 IdeaRS.OpenModel.Detail.BentUpBar
 IdeaRS.OpenModel.Detail.ReinfAroundOpening
 IdeaRS.OpenModel.Detail.ReinfBarByPolyline
 IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints
 IdeaRS.OpenModel.Detail.ReinfBarInclined
 IdeaRS.OpenModel.Detail.ReinfBarOnEdge
 IdeaRS.OpenModel.Detail.ReinfBarOnMoreEdges