IDEA Open Model
ConcreteULSCheckResultFatigueEc2 Class
Compatible with IDEA StatiCa Beta 20.0
 ULS Check Fatigue Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultFatigue
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteULSCheckResultFatigueEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteULSCheckResultFatigueEc2 : ConcreteULSCheckResultFatigue
Public Class ConcreteULSCheckResultFatigueEc2
	Inherits ConcreteULSCheckResultFatigue
The ConcreteULSCheckResultFatigueEc2 type exposes the following members.
Constructors
Name | Description
ConcreteULSCheckResultFatigueEc2
Initializes a new instance of the ConcreteULSCheckResultFatigueEc2 class
Top
Properties
Name | Description
DecissionMethod
 decision fatigue check
InternalForceMax
 internal forces for fatigue calculation max
InternalForceMin
 internal forces for fatigue calculation min
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace