IDEA Open Model
IdeaSMemberImportSettings Class
Compatible with IDEA StatiCa Beta 20.0
 Represents settings of improt options into Idea Connections
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.IdeaConImportSettings
 IdeaRS.OpenModel.Connection.IdeaSMemberImportSettings
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class IdeaSMemberImportSettings : IdeaConImportSettings
Public Class IdeaSMemberImportSettings
	Inherits IdeaConImportSettings
The IdeaSMemberImportSettings type exposes the following members.
Constructors
Name | Description
IdeaSMemberImportSettings
 Constructor - it sets default values
Top
Properties
Name | Description
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace