IDEA Open Model
ColumnDataEc2 Class
Compatible with IDEA StatiCa Beta 20.0
 Column data Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.ColumnData
 IdeaRS.OpenModel.Concrete.ColumnDataEc2
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ColumnDataEc2 : ColumnData
Public Class ColumnDataEc2
	Inherits ColumnData
The ColumnDataEc2 type exposes the following members.
Constructors
Name | Description
ColumnDataEc2
 Constructor
Top
Properties
Name | Description
BracedY
 Braced structure Y-Y
BracedZ
 Braced structure Z-Z
Calculation2ndOrderEffect
 Use calculation of 2nd order effect
EffectConsidered
 Effect considered
GeometricImperfectionsSLS
 Use calculation geometric imperfections for SLS
GeometricImperfectionsULS
 Use calculation geometric imperfections for ULS
NumberOfVerticalMembersY
 Gets or sets the number of vertical member in Y direction.
NumberOfVerticalMembersZ
 Gets or sets the number of vertical member in Z direction.
SecondOrderEffectMethod
 Type of calculation method of 2nd order effect
TotalL
 Gets or sets the total length of building
UserValuec0Y
 c0 user value - for nominal stiffness
UserValuec0Z
 c0 user value - for nominal stiffness
UserValuecY
 c user value - for nominal stiffness
UserValuecZ
 c user value - for nominal stiffness
ValueTypeOfc0Y
 Type of c0 value
ValueTypeOfc0Z
 Type of c0 value
ValueTypeOfcY
 Type of c value - for nominal curvature
ValueTypeOfcZ
 Type of c value - for nominal curvature
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace