IdeaRS.Connections
ConnectionPropData Methods
Compatible with IDEA StatiCa 0.0
The ConnectionPropData type exposes the following members.
Methods
Name | Description
Add
Top
See Also
Reference
ConnectionPropData Class
IdeaRS.Connections.Data Namespace