IdeaRS.Connections
ConnectionData Methods
Compatible with IDEA StatiCa 0.0
The ConnectionData type exposes the following members.
Methods
Name | Description
AddBeam(Guid, ConnectionCmdData)
AddBeam(Int32, Guid, ConnectionCmdData)
AddOperation(Guid, ConnectionCmdData)
AddOperation(Int32, Guid, ConnectionCmdData)
Top
See Also
Reference
ConnectionData Class
IdeaRS.Connections.Data Namespace