IdeaRS.Connections
ConnectionCmdData Methods
Compatible with IDEA StatiCa 0.0
The ConnectionCmdData type exposes the following members.
Methods
Name | Description
GetShallowCopy
Top
See Also
Reference
ConnectionCmdData Class
IdeaRS.Connections.Data Namespace