IdeaRS.Connections
WeldData Methods
Compatible with IDEA StatiCa 0.0
The WeldData type exposes the following members.
Methods
Name | Description
GetShallowCopy
Top
See Also
Reference
WeldData Class
IdeaRS.Connections.Data Namespace