IdeaRS.Connections
PlateWidenerData Properties
Compatible with IDEA StatiCa 0.0
The PlateWidenerData type exposes the following members.
Properties
Name | Description
ConnectedPlatePath
 Gets or sets the plate where stiffener is connected to
ExtendedPlatePath
 Gets or sets the extended plate
Height
 Gets or sets the height of the plate
Offset
 Gets or sets the distance from the ReferencePlane
PositionCode
 Gets or sets the position code
ShapeParam1
 Gets or sets the the first optional parameter of the shape
ShapeParam2
 Gets or sets the the second optional parameter of the shape
Weld
 Gets or sets the properties of the weld
WidenerShapeCode
 Gets or sets the code of the shape
Width
 Gets or sets the width of the plate
Top
See Also
Reference
PlateWidenerData Class
IdeaRS.Connections.Data Namespace