IdeaRS.Connections
CutBeamByBeamData Properties
Compatible with IDEA StatiCa 0.0
The CutBeamByBeamData type exposes the following members.
Properties
Name | Description
CuttingObjectPath
 Gets or sets the cutting plane
ExtendToPlane
 If true object is extended to the cutting plane
FlangesWeld
 Gets or sets the properties of the weld - flanges
IsWeld
 If true welds are generated automatically
KeptPartCode
 Gets or sets the code of the part which should be kept in the model after cutting. 0 - end 1 - begin
Method
 The type
ModifiedObjectPath
 Gets or sets the object to cut
Offset
 Gets or sets the offset of the cut - relative to cutting plane
Orientation
 Gets or sets the orientation of the cut
PlaneOnCuttingObject
 Gets or sets the distance of the cutting plane relative to the beginning of the modified beam
Weld
 Gets or sets the properties of the weld - other parts
Top
See Also
Reference
CutBeamByBeamData Class
IdeaRS.Connections.Data Namespace