IdeaRS.Connections
EndPlateDataBase Properties
Compatible with IDEA StatiCa 0.0
The EndPlateDataBase type exposes the following members.
Properties
Name | Description
ConnectionType
 Gets or sets the type of connection of two parts.
InnerRadius
 Gets or sets the inner radius of the circular plate boundary.
OffsetBottom
 Gets or sets the bottom offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetLeft
 Gets or sets the left offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetRight
 Gets or sets the right offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetTop
 Gets or sets the top offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
OuterRadius
 Gets or sets the outer radius of the circular plate boundary.
PlateSizeMethod
 Gets or sets the method of the definition of dimensions of the plate
Top
See Also
Reference
EndPlateDataBase Class
IdeaRS.Connections.Data Namespace