IdeaRS.Connections
AnchoringData Properties
Compatible with IDEA StatiCa 0.0
The AnchoringData type exposes the following members.
Properties
Name | Description
Angles
 Gets or sets the string, where are defined groups and positions for angles. This string is not null or empty, if polar coordinate system is used.
AnchorLength
 Gets or sets the length of the anchor
AnchorName
 Gets or sets the name of the anchor
AnchorTypeData
 Various type of anchor
AnchorTypeDataSize
 Size of washer plate
ApplyBoltShearType
 Indicates type of shear transfer
CircularLayerRadius
 Gets or sets the array of radiuses of circular layers
Cols
 Gets or sets the string, where are defined groups and positions for columns.
CustomLcsAngle
 Gets or sets the angle of lcs for custom location of reference point.
CustomReferencePoint
 Gets or sets the shift of reference point.
CustomReferencePointPosition
 Gets or sets the type of position of reference point located from.
EditorData
 Gets or sets data which are generated by connector editor. It includes information about changes of the connectors.
GridType
 Gets or sets the type of grid - regular or shifted.
HorizontalGridLinesBottom
 The array of offsets of the horizontal gridlines from the top edge of the bounding box
HorizontalGridLinesTop
 The array of offsets of the horizontal gridlines from the top edge of the bounding box
NumberOfAnchorsCL
 Gets or sets the array where are defined numers of anchors in particular circular layers
PositionType
 Gets or sets the type for building of connectors geometry.
ReferencePointPosition
 Gets or sets the type of position of reference point.
Rows
 Gets or sets the string, where are defined groups and positions for rows.
ShearPlaneThread
 Indicates if shear plane is in thread (smaller area)
VerticalGridLinesLeft
 The array of offsets of the vertical gridlines from the left edge of the bounding box
VerticalGridLinesRight
 The array of offsets of the vertical gridlines from the right edge of the bounding box
Top
See Also
Reference
AnchoringData Class
IdeaRS.Connections.Data Namespace