IdeaRS.Connections
ConItemListAttribute Properties
Compatible with IDEA StatiCa 0.0
The ConItemListAttribute type exposes the following members.
Properties
Name | Description
PropertyType
WrapperType
Top
See Also
Reference
ConItemListAttribute Class
IdeaRS.Connections.Data Namespace