IdeaRS.Connections
ColumnWidenerData Properties
Compatible with IDEA StatiCa 0.0
The ColumnWidenerData type exposes the following members.
Properties
Name | Description
ColumnPath
 Gets or sets the column
ConnectedPlatePath
 Gets or sets the object (plate or beam) where stiffener is connected to
Height
 Gets or sets the height of the plate
Offset
 Gets or sets the distance from the ReferencePlane
PositionCode
 Gets or sets the position code
SegmentPartCode
 Gets or sets the code of the segment part Top Flange = 1 Bottom Flange = 2 Both Flanges = 3 Webs = 4 All CSS parts = 7
ShapeParam1
 Gets or sets the the first optional parameter of the shape
ShapeParam2
 Gets or sets the the second optional parameter of the shape
Weld
 Gets or sets the properties of the weld
WidenerShapeCode
 Gets or sets the code of the shape
Width
 Gets or sets the width of the plate
Top
See Also
Reference
ColumnWidenerData Class
IdeaRS.Connections.Data Namespace