IdeaRS.Connections
EndPlateData Properties
Compatible with IDEA StatiCa 0.0
The EndPlateData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BackingPlateOffset
BackingPlateOffsetBottom
BackingPlateOffsetTop
BackingPlateThickness
CreateNotch
 If true notch is generated automatically
Fastening
 Gets or sets the properties of the anchoring
IsBackingPlate
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member2
 Gets or sets the second connected member
MemberFlangesWeld
 Gets or sets the properties of the weld: flanges of connected member - end plate
MemberWeld
 Gets or sets the properties of the weld: web of connected member - end plate
NotchOffset
 Gets or sets the value for notch offset
PlateWeld
 Gets or sets the properties of the weld: end plate - flanges of connected to member
RelatedMember
 Gets or sets the related member (other members are connected to this member)
RelatedPlate
 Gets or sets the related plate (other member are connected to this plate)
RemainingPart1
 Gets or sets the information, whether end plate is at the begin or at the end of added member.
Top
See Also
Reference
EndPlateData Class
IdeaRS.Connections.Data Namespace