IdeaRS.Connections
EndPlateOnFlangesData Properties
Compatible with IDEA StatiCa 0.0
The EndPlateOnFlangesData type exposes the following members.
Properties
Name | Description
BeamEndPlateOffsetBottom
 Gets or sets the bottom offset of the beam end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
BeamEndPlateOffsetLeft
 Gets or sets the left offset of the beam end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
BeamEndPlateOffsetRight
 Gets or sets the right offset of the beam end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
BeamEndPlateOffsetTop
 Gets or sets the top offset of the beam end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
BeamEndPlateThickness
 Thickness of the beam end plate, 0 if thickness equals to shifted end plate thickness...
BeamPlateHeightAutomatic
 Indicates, whether beam endplate height is automatical acc. connected member.
BeamPlateSize
 Indicates, whether second end plate has different dimensions. If Default is set, beam plate is identical as endplate on flanges. It is used only if bolted connections.
HeightAutomatic
 Indicates, whether shifted endplate height is automatical acc. related member to.
StiffenerChamferCorners
 Indicates, whether stiffener plate is chamfered.
StiffenerChamferSize
 Gets or sets the stiffener plate chamfer size.
StiffenerMaterialName
 Gets or sets the name of the material of stiffener. If value is null or empty material is taken from connected member
StiffenerThickness
 Gets or sets the stiffener plate thickness.
StiffenerType
 Gets or sets the type of stiffener for end plate on flanges.
StiffenerWeld
 Gets or sets the properties of the weld: stiffener - connected to member
Top
See Also
Reference
EndPlateOnFlangesData Class
IdeaRS.Connections.Data Namespace