IdeaRS.Connections
TimberConnectingPlateData Properties
Compatible with IDEA StatiCa 0.0
The TimberConnectingPlateData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BottomObjectPath
 Gets or sets the bottom object to which gusset plate is connected
ConnectedMemberPath
 Gets or sets diagonal beam segment which is connected to the gusset plate
ConnectedTo
 Gets or sets the information about the item which will be connected to the member.
ConnectedToPlatePath
 Gets or sets the bottom object to which gusset plate is connected
ConnectionAlignment
 Gets or sets the placement of the gusset plate relative to the web
ConnectionLidOffsets
ConnectionLidShape
ConnectionLidThickness
ConnectionOverlap
ConnectionTongueExcentricity
ConnectionTongueLength
ConnectionTongueType
ConnectionTongueWidth
ConnectionType
 Gets or sets the type of connection of two parts.
ConnectionXposition
 Gets or sets the size of x position from connection point.
ConPltMaterialName
 Gets or sets the name of the material of connectiong plate (cap) If value is null or empty material is taken from column
FasteningOnInsertedPlate
 Gets or sets the properties of the bolt grid on inserted plate
FasteningOnTonguePlate
 Gets or sets the properties of the bolt grid on tongue plate
InsertedPlateBoltEndOffset
InsertedPlateSurfaceOffset
InsertedPlateThickness
InsertedPlateToLidWeld
 Gets or sets the properties of the weld of the inserted plate to lid.
InsideWeldLength
LidWeld
 Gets or sets the properties of the weld of the lid to connected member.
NewGussetPlateWeld
 Gets or sets the properties of the plate to related to member weld
PlateAngle
 Gets or sets the inclination of new plate to related member;
PlateHeight
 Gets or sets the height of the plate
PlatePositionX
 Gets or sets the position of new plate along related member;
PlateShapeCode
 Gets or sets the code of the shape
PlateShapeParam1
 Gets or sets the the first optional parameter of the shape
PlateShapeParam2
 Gets or sets the the second optional parameter of the shape
PlateThickness
 Gets or sets the thickness of the plate
PlateWidth
 Gets or sets the width of the plate
RemainingPart
 Gets or sets the information, whether end plate is at the begin or at the end of added member.
SideObjectPath
 Gets or sets the side object to which gusset plate is connected
TimberConnectedToType
TimberInsertedPlateType
TimberTonguePlateType
TonguePlateToLidWeld
 Gets or sets the properties of the weld of the tongue plate to "gusset" plate.
Weld
 Gets or sets the properties of the weld of tongue plate to connected member or to lid.
Top
See Also
Reference
TimberConnectingPlateData Class
IdeaRS.Connections.Data Namespace