IdeaRS.Connections
TimberGussetPlateData Properties
Compatible with IDEA StatiCa 0.0
The TimberGussetPlateData type exposes the following members.
Properties
Name | Description
BoltShearType
CountOfGussetPlates
CountOfMembers
GussetPlateSurfaceOffset
ShearPlaneThread
SinglePlateExtension
TimberGussetMembers
TimberGussetPlateType
Top
See Also
Reference
TimberGussetPlateData Class
IdeaRS.Connections.Data Namespace