IdeaRS.Connections
GussetData Properties
Compatible with IDEA StatiCa 0.0
The GussetData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BottomObjectPath
 Gets or sets the bottom object to which gusset plate is connected
ConnectedMemberPath
 Gets or sets diagonal beam segment which is connected to the gusset plate
ConnectedPlatePath
 Gets or sets the plate of connected member, which is bolted or welded to a gusset plate.
ConnectedTo
 Gets or sets the information about the item which will be connected to the member.
ConnectedToPlatePath
 Gets or sets the bottom object to which gusset plate is connected
ConnectionAlignment
 Gets or sets the placement of the gusset plate relative to the web
ConnectionGap
 Gets or sets the size of gap (offset)
ConnectionNotch
 Gets or sets, whether gusset plate is notched.
ConnectionNotchGap
 Gets or sets the gap of the notch - rectangle, roundings.
ConnectionType
 Gets or sets the type of connection of two parts.
Fastening
 Gets or sets the properties of the anchoring
PlateEccentricity
 Gets or sets the plate eccentricity in their z-axis direction.
PlateHeight
 Gets or sets the height of the plate
PlatePositionX
 Gets or sets the position of new plate along related member;
PlateShapeCode
 Gets or sets the code of the shape
PlateShapeParam1
 Gets or sets the the first optional parameter of the shape
PlateShapeParam2
 Gets or sets the the second optional parameter of the shape
PlateWeld
 Gets or sets the properties of the plate to related to member weld
PlateWidth
 Gets or sets the width of the plate
SideObjectPath
 Gets or sets the side object to which gusset plate is connected
Weld
 Gets or sets the properties of the connected member to plate weld
Top
See Also
Reference
GussetData Class
IdeaRS.Connections.Data Namespace