IdeaRS.Connections
WorkPlaneData Properties
Compatible with IDEA StatiCa 0.0
The WorkPlaneData type exposes the following members.
Properties
Name | Description
Method
Param1
Param2
Param3
Plane
Top
See Also
Reference
WorkPlaneData Class
IdeaRS.Connections.Data Namespace