IdeaRS.Connections
PlateDataBase Properties
Compatible with IDEA StatiCa 0.0
The PlateDataBase type exposes the following members.
Properties
Name | Description
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
ShapeData
 Collection of plate editor data
Thickness
 Gets or sets the thickness of the plate
Top
See Also
Reference
PlateDataBase Class
IdeaRS.Connections.Data Namespace