IdeaRS.Connections
ConcreteBlockData Properties
Compatible with IDEA StatiCa 0.0
The ConcreteBlockData type exposes the following members.
Properties
Name | Description
BasePlateContact
 Influence of mortar joint
BasePlateContactThickness
 Mortar thickness
FoundationBlockHeight
 Gets or sets the value of the offset of the foundation block from the base plate. The value is used for the check of the concrete cone failure.
FoundationBlockOffset
 Gets or sets the value of the offset of the foundation block from the base plate. The value is used for the check of the concrete cone failure.
MatConcreteName
 Gets or sets the name of concrete in the foundation.
ShearForceTransfer
 Gets or sets the method of transfer of shear force to a foundation block
ShearIronCssName
 Gets or sets the identifier of the cross-section of the shear iron
ShearIronLength
 Gets or sets the length of the shear iron
ShearIronPosition
ShearIronRotation
Top
See Also
Reference
ConcreteBlockData Class
IdeaRS.Connections.Data Namespace