IdeaRS.Connections
MemberLongitudinalStiffenerData Properties
Compatible with IDEA StatiCa 0.0
The MemberLongitudinalStiffenerData type exposes the following members.
Properties
Name | Description
BeginOffsetX
EndOffsetX
OffsetY
Top
See Also
Reference
MemberLongitudinalStiffenerData Class
IdeaRS.Connections.Data Namespace