IdeaRS.Connections
BasePlateAnchoringData Properties
Compatible with IDEA StatiCa 0.0
The BasePlateAnchoringData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BasePlatePath
 Gets or sets the bease plate of the anchoring
Top
See Also
Reference
BasePlateAnchoringData Class
IdeaRS.Connections.Data Namespace