IdeaRS.Connections
CutPlateData Properties
Compatible with IDEA StatiCa 0.0
The CutPlateData type exposes the following members.
Properties
Name | Description
CuttingMemberPath
 Gets or sets the member which owns the plate which is supposed to modify
CuttingPlatePath
 Gets or sets the cutting plane
CuttingSurface
 Gets or sets the surface of the cutting plane
FlangesWeld
 Gets or sets the properties of the weld - flanges
IsWeld
 If true welds are generated automatically
Method
 The type of cut type in case: cut by beam.
ModifiedMemberPath
 Gets or sets the member which owns the plate which is supposed to modify
ModifiedPlatePath
 Gets or sets the object to cut
Offset
 Gets or sets the offset of the cut - relative to cutting plane
PlateAdjustment
RemainingPart
 Gets or sets the part of the modified item which remains in the model of connection
Weld
 Gets or sets the properties of the connected member to plate weld - other plate.ConnectionPartType than WEB
Top
See Also
Reference
CutPlateData Class
IdeaRS.Connections.Data Namespace