IdeaRS.Connections
BeamSegmentStubData Properties
Compatible with IDEA StatiCa 0.0
The BeamSegmentStubData type exposes the following members.
Properties
Name | Description
CrossSectionType
EccentricityBeginY
 Gets or sets the local eccentricity Y at the begin of the stub
EccentricityBeginZ
 Gets or sets the local eccentricity Z at the begin of the stub
ExplodeToPlates
Fastening
InclinationBottom
InclinationLeft
InclinationRight
InclinationTop
Plate2Plate
ProfileType
StubPltThickness
Top
See Also
Reference
BeamSegmentStubData Class
IdeaRS.Connections.Data Namespace