IdeaRS.Connections
DissipativeItemCommandData Properties
Compatible with IDEA StatiCa 0.0
The DissipativeItemCommandData type exposes the following members.
Properties
Name | Description
DissipativePartPaths
 List of connection parts responsible for dissipating of energy occured during sesmic situation.
Setting
Top
See Also
Reference
DissipativeItemCommandData Class
IdeaRS.Connections.Data Namespace