IdeaRS.Connections
ConParamInterfacesAttribute Properties
Compatible with IDEA StatiCa 0.0
The ConParamInterfacesAttribute type exposes the following members.
Properties
Name | Description
Interfaces
Top
See Also
Reference
ConParamInterfacesAttribute Class
IdeaRS.Connections.Data Namespace