IdeaRS.Connections
ConnectionItemAttribute Properties
Compatible with IDEA StatiCa 0.0
The ConnectionItemAttribute type exposes the following members.
Properties
Name | Description
PropertyType
Top
See Also
Reference
ConnectionItemAttribute Class
IdeaRS.Connections.Data Namespace