IdeaRS.Connections
ConnectorGridData Properties
Compatible with IDEA StatiCa 0.0
The ConnectorGridData type exposes the following members.
Properties
Name | Description
AnchorBeamPlatePath
Anchoring
 Gets or sets the properties of the anchoring
AnchorPlatePath
BlockType
 Indicates, whether concrete block exists or should be created new.
ConnectedPlatesPath
 Gets or sets diagonal beam segments which are connected to the gusset plate
ExistingBlockPath
FastenerType
Fastening
 Gets or sets the properties of the fastening
FlangesWeld
 Gets or sets the properties of the weld: flanges of connected member - end plate
MainConnectedBeam
 Gets or sets the main connected beam (if the main plate is part of the connected beam, if it is independent plate this property is null)
MainPlatePath
NewConcreteBlock
PlateSide
ShearLugWeld
 Gets or sets the properties of the weld between the base plate and shear lug
WebWeld
 Gets or sets the properties of the weld: end plate - flanges of connected to member
Top
See Also
Reference
ConnectorGridData Class
IdeaRS.Connections.Data Namespace