IdeaRS.Connections
CutCommandData Properties
Compatible with IDEA StatiCa 0.0
The CutCommandData type exposes the following members.
Properties
Name | Description
CuttingPlane
 Gets or sets the cutting plane
ExtendToPlane
 If true object is extended to the cutting plane
IsWeld
 If true welds are generated automatically
Object
 Gets or sets the object to cut
Offset
 Gets or sets the offset of the cut - relative to cutting plane
Orientation
 Gets or sets the orientation of the cut
Top
See Also
Reference
CutCommandData Class
IdeaRS.Connections.Data Namespace