IdeaRS.Connections
FasteningData Properties
Compatible with IDEA StatiCa 0.0
The FasteningData type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the rotation angle of fasteners group.
Angles
 Gets or sets the groups and positions for angles.
AnchorLength
 Gets or sets the length of the anchor
AnchorTypeData
 Various type of anchor
AnchorTypeDataSize
 Size of washer plate
BoltEndOffset
 Timber bolt grid offset from the gusset plate end (end means part of timber gusset plate positioned on the beam)
BoltInteraction
 Indicates type of shear transfer
BoltStartOffest
 Timber bolt grid offset from relative beginning of beam (beginning means the cut of ended beam or middle point of the continuous beam)
Cols
 Gets or sets the columns of fasteners positions.
ColsGridType
 Gets or sets the type of cols - regular or shifted.
ColsNegative
 Gets or sets the columns of negative fasteners positions in case of ColsPosition equals to Profile.
ColsPosition
 Gets or sets the position, to which are bolt columns realted to.
ColsSymmetry
 Gets or sets the type of symmetry of columns positions.
CoordinateSystem
 Gets or sets the coordinate system type.
Counts
 Gets or sets the count of bolts in the circle (polar coordinate system) for each particular layer, or one number for all.
CustomLcsAngle
 Gets or sets the angle of lcs for custom location of reference point.
CustomLcsPoint
 Gets or sets the shift of reference point.
EditorData
 Gets or sets data which are generated by connector editor. It includes information about changes of the connectors.
FastenerName
 Gets or sets the name of the anchor
IsCustomLcs
 Indicates, whether custom lcs is applied.
PolarInput
 Gets or sets the type, that spefifies polar input.
PolarPosition
 Gets or sets the position, to which are bolt radii realted to (polar coordinate system).
Positions
 Gets or sets the fasteners positions {X, Y}.
Radii
 Gets or sets the radii of bolts (polar coordinate system).
Rows
 Gets or sets the rows of a fasteners positions. Absolute positions of groups, in group are relative positions.
RowsGridType
 Gets or sets the type of rows - regular or shifted.
RowsNegative
 Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
RowsPosition
 Gets or sets the position, to which are bolt rows realted to.
RowsSymmetry
 Gets or sets the type of symmetry of rows positions.
ShearPlaneThread
 Indicates if shear plane is in thread (smaller area)
Top
See Also
Reference
FasteningData Class
IdeaRS.Connections.Data Namespace