IdeaRS.Connections
Plate2PlateData Properties
Compatible with IDEA StatiCa 0.0
The Plate2PlateData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
Fastening
 Gets or sets the properties of the anchoring
FlangesWeld
 Gets or sets the properties of the weld - flanges
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member2
 Gets or sets the second connected member
PositionOnMember1
 Gets or sets the position of the plate (measured on the reference line of the beam segment)
Weld
 Gets or sets the properties of the weld - other parts
Top
See Also
Reference
Plate2PlateData Class
IdeaRS.Connections.Data Namespace