IdeaRS.Connections
GeneralWeldData Properties
Compatible with IDEA StatiCa 0.0
The GeneralWeldData type exposes the following members.
Properties
Name | Description
SurfaceEdgeInx
Weld
 Gets or sets the properties of the connected member to plate weld
WeldedEdgeIndexes
WeldedEdgeInx
WeldedMemberEdgePath
WeldedMemberSurfacePath
WeldedPlateEdgePath
WeldedPlateSurfacePath
WeldPlacement
Top
See Also
Reference
GeneralWeldData Class
IdeaRS.Connections.Data Namespace