IdeaRS.Connections
CutBeamData Properties
Compatible with IDEA StatiCa 0.0
The CutBeamData type exposes the following members.
Properties
Name | Description
CutPartOnMem1
 Cut off part on member 1
CutPartOnMem2
 Cut off part on member 2
Top
See Also
Reference
CutBeamData Class
IdeaRS.Connections.Data Namespace