IdeaRS.Connections
TimberGussetMemberData Properties
Compatible with IDEA StatiCa 0.0
The TimberGussetMemberData type exposes the following members.
Properties
Name | Description
Fastening
MemberPath
Top
See Also
Reference
TimberGussetMemberData Class
IdeaRS.Connections.Data Namespace