IdeaRS.Connections
ConnectionData Class
Compatible with IDEA StatiCa 0.0
 Represents the data contract of the connection (the manufacturing sequence and connection parameters)
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionData
The ConnectionData type exposes the following members.
Constructors
Name | Description
ConnectionData
Initializes a new instance of the ConnectionData class
Top
Properties
Name | Description
BeamProperties
 Gets or sets the properties of the cennected beams
BeamSequence
 Gets or sets the manufacturing sequence
NodeId
 Gets or sets the Id of the corresponding node in the structure
Properties
 Gets or sets the properties of the connection
Sequence
 Gets or sets the manufacturing sequence
Top
Methods
Name | Description
AddBeam(Guid, ConnectionCmdData)
AddBeam(Int32, Guid, ConnectionCmdData)
AddOperation(Guid, ConnectionCmdData)
AddOperation(Int32, Guid, ConnectionCmdData)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace