IdeaRS.Connections
MemberTransversalStiffenerData Class
Compatible with IDEA StatiCa 0.0
 Data for vertical stiffener on steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.StiffenerData
 IdeaRS.Connections.Data.MemberTransversalStiffenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberTransversalStiffenerData : StiffenerData
The MemberTransversalStiffenerData type exposes the following members.
Constructors
Name | Description
MemberTransversalStiffenerData
Initializes a new instance of the MemberTransversalStiffenerData class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace