IdeaRS.Connections
GeneralPlateData Class
Compatible with IDEA StatiCa 0.0
 Represents data for the command which creates the generally located plate.
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.GeneralPlateData
 IdeaRS.Connections.Data.MemberLongitudinalStiffenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class GeneralPlateData : PlateDataBase
The GeneralPlateData type exposes the following members.
Constructors
Name | Description
GeneralPlateData
 Constructor
Top
Properties
Name | Description
CoordSystem
 Data of the local coordinate system - Origin, AxisX, AxisY, AxisZ
CustomGeometry
 Gets or sets the custom geometrical data
LocIsWelded
LocJointPoint
LocJointRotation
LocLocation
LocMemberPath
LocPitch
LocPlatePath
LocRelatedTo
LocRotation
LocType
LocXposition
LocYposition
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
PlateEdgeInx
Shape
ShapeParam1
 Rectangle-B1, Circle-R
ShapeParam2
 Rectangle-B2
ShapeParam3
 Rectangle-H1
ShapeParam4
 Rectangle-H2
Weld
 Gets or sets the properties of the connected member to plate weld
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace