IdeaRS.Connections
ManufacturingOperationData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ManufacturingOperationData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ManufacturingOperationData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ManufacturingOperationData
The ManufacturingOperationData type exposes the following members.
Constructors
Name | Description
ManufacturingOperationData
Initializes a new instance of the ManufacturingOperationData class
Top
Properties
Name | Description
CommandId
ParameterId
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace