IdeaRS.Connections
ConnectionTemplate Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectionTemplate"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionTemplate
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionTemplate
The ConnectionTemplate type exposes the following members.
Constructors
Name | Description
ConnectionTemplate
Initializes a new instance of the ConnectionTemplate class
Top
Properties
Name | Description
Criteria
Name
Parameters
ParametersModelLinks
Properties
Sequence
TemplateId
TopologyCode
Version
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace