IdeaRS.Connections
SpliceData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.SpliceData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.SpliceData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SpliceData : PlateDataBase, IBoltableData
The SpliceData type exposes the following members.
Constructors
Name | Description
SpliceData
Initializes a new instance of the SpliceData class
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
B1
B2
BackingPlateOffset
BackingPlateThickness
ConnectedPlatePath
 Gets or sets the item (plate) which is connected to the splice plate
ConnectedTo
 Gets or sets the information about the item which will be connected to the member.
ConnectionType
 Gets or sets the type of connection of two parts.
ExistingSplicePath
 Gets or sets the bottom object to which gusset plate is connected
Fastening
 Gets or sets the properties of the anchoring
IsBackingPlate
IsSymmetrical
 If true - connectors are taken from the existing splice
Member2Path
 Gets or sets the second member.
MemberPath
 Gets or sets the member
NewSplicePosition
Offset1
Offset2
TransversalWeld
 Gets or sets the properties of the connected member to plate weld - transversal weld
Weld
 Gets or sets the properties of the connected member to plate weld - longitudinal weld
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace