IdeaRS.Connections
SolidData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.SolidData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.AddedMemberData
 IdeaRS.Connections.Data.SolidData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SolidData : AddedMemberData
The SolidData type exposes the following members.
Constructors
Name | Description
SolidData
Initializes a new instance of the SolidData class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace