IdeaRS.Connections
CreateSegmentCommandData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.CreateSegmentCommandData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.CreateSegmentCommandData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CreateSegmentCommandData : ConnectionPartDataBase
The CreateSegmentCommandData type exposes the following members.
Constructors
Name | Description
CreateSegmentCommandData
Initializes a new instance of the CreateSegmentCommandData class
Top
Properties
Name | Description
AngleAlpha
 The angle between the reference line of the beam segment and plane XY
AngleBeta
 The rotation around axis Z
CrossSectionType
CssHeight
CssWidth
DirVectX
 Gets or sets X value of the direction vector of the beam segment
DirVectY
 Gets or sets Y value of the direction vector of the beam segment
DirVectZ
 Gets or sets Z value of the direction vector of the beam segment
EccentricityBeginX
 Gets or sets the local eccentricity X at the begin of beam
EccentricityBeginY
 Gets or sets the local eccentricity Y at the begin of beam
EccentricityBeginZ
 Gets or sets the local eccentricity Z at the begin of beam
EccentricityEndX
 Gets or sets the local eccentricity X at the end of beam
EccentricityEndY
 Gets or sets the local eccentricity Y at the end of beam
EccentricityEndZ
 Gets or sets the local eccentricity Z at the end of beam
FlangeThickness
ForceAbsPosition
ForceIn
InsertPointOnRefLine
 Gets or sets the relative position of the insertion point of the beam segment on the reference line.
LCSYVectX
 Gets or sets X value of the Y vector of the local coordinate system of the beam segment
LCSYVectY
 Gets or sets Y value of the Y vector of the local coordinate system of the beam segment
LCSYVectZ
 Gets or sets Z value of the Y vector of the local coordinate system of the beam segment
LCSZVectX
 Gets or sets X value of the Z vector of the local coordinate system of the beam segment
LCSZVectY
 Gets or sets Y value of the Z vector of the local coordinate system of the beam segment
LCSZVectZ
 Gets or sets Z value of the Z vector of the local coordinate system of the beam segment
Length
 Gets or sets the length of the segment
MaterialName
 Gets or sets the name of the material
MirrorY
 Mirror local axis Y
MirrorZ
 Mirror local axis Z
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
PlacementDefinition
 Gets or sets the type of the input for placement of the segment. If value equals to DirectionVector the values of DirVectX, DirVectY, DirVectZ are expected If value equals to SphericalCoordinates,
RigidLinkX
 The rigid link in FEM model - X value
RigidLinkY
 The rigid link in FEM model - Y value
RigidLinkZ
 The rigid link in FEM model - Z value
RotationRx
 Gets or sets the rotation of Cross-section about X axis of the of beam.
SegmentEndBehavior
SupportCode
 Gets or sets the support code 0 - not supported 1 - Begin is supported 2 - End is supported 3 - Both ends are supported
TheoreticalLengthY
 Theoretical beam length for stiffness classification
TheoreticalLengthZ
 Theoretical beam length for stiffness classification
WebThickness
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace