IdeaRS.Connections
ConItemListAttribute Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConItemListAttribute"]
Inheritance Hierarchy
Object
 Attribute
 IdeaRS.Connections.Data.ConItemListAttribute
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConItemListAttribute : Attribute
The ConItemListAttribute type exposes the following members.
Constructors
Name | Description
ConItemListAttribute
Initializes a new instance of the ConItemListAttribute class
Top
Properties
Name | Description
PropertyType
WrapperType
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace