IdeaRS.Connections
TimberGussetMemberData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.TimberGussetMemberData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.TimberGussetMemberData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TimberGussetMemberData : PlateDataBase,
	IBoltableData
The TimberGussetMemberData type exposes the following members.
Constructors
Name | Description
TimberGussetMemberData
Initializes a new instance of the TimberGussetMemberData class
Top
Properties
Name | Description
Fastening
MemberPath
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace