IdeaRS.Connections
AddedMemberData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.AddedMemberData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.AddedMemberData
 IdeaRS.Connections.Data.MemberAddedMemberData
 IdeaRS.Connections.Data.SolidData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class AddedMemberData : ConnectionCmdData
The AddedMemberData type exposes the following members.
Constructors
Name | Description
AddedMemberData
Initializes a new instance of the AddedMemberData class
Top
Properties
Name | Description
AddedMemberLen1
 Gets or sets the first dimension of the segment
AddedMemberLen2
 Gets or sets the first dimension of the segment
AddedMemberPlateIndex
 Gets or sets the index of plate of added member, which is connected to related item.
AddedMemberType
AngleAlpha
 The angle between the reference line of the beam segment and plane XY
AngleBeta
 The rotation around axis Z
CoordSystem
 Data of the local coordinate system - Origin, AxisX, AxisY, AxisZ
CrossSectionType
CustomGeometry
 Gets or sets the custom geometrical data
DefineBy
 Define by
DirVectX
 Gets or sets X value of the direction vector of the beam segment
DirVectY
 Gets or sets Y value of the direction vector of the beam segment
DirVectZ
 Gets or sets Z value of the direction vector of the beam segment
EccentricityBeginX
 Gets or sets the local eccentricity X at the begin of beam
EccentricityBeginY
 Gets or sets the local eccentricity Y at the begin of beam
EccentricityBeginZ
 Gets or sets the local eccentricity Z at the begin of beam
InsertPointOnRefLine
 Gets or sets the relative position of the insertion point of added beam on the reference line.
InsertPtX
 Gets or sets the X coordinate of the insertion point
InsertPtY
 Gets or sets the Y coordinate of the insertion point
InsertPtZ
 Gets or sets the Z coordinate of the insertion point
LCSYVectX
 Gets or sets X value of the Y vector of the local coordinate system of the beam segment
LCSYVectY
 Gets or sets Y value of the Y vector of the local coordinate system of the beam segment
LCSYVectZ
 Gets or sets Z value of the Y vector of the local coordinate system of the beam segment
LCSZVectX
 Gets or sets X value of the Z vector of the local coordinate system of the beam segment
LCSZVectY
 Gets or sets Y value of the Z vector of the local coordinate system of the beam segment
LCSZVectZ
 Gets or sets Z value of the Z vector of the local coordinate system of the beam segment
Length
 Gets or sets the length of the segment
LocLocation
 Gets or sets the side to mount - left side, right side.
LocMemberPath
 Gets or sets the related member.
LocPitch
LocPlatePath
 Gets or sets of related plate of related member or directly related plate.
LocRelatedTo
 Gets or sets the type of location of the added member. (Joint, member, plate)
LocRotation
LocType
 The type of mount of added member plate to related plate.
LocXposition
LocYposition
MirrorY
 Mirror local axis Y
MirrorZ
 Mirror local axis Z
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
PlacementDefinition
 Added beam placement in Connection by Directional vector (and not by Spherical coordinates - aplha, beta, gamma angles) If value equals to DirectionVector the values of DirVectX, DirVectY, DirVectZ are expected
PlateEdgeInx
 Gets or sets the plate edge index if widener loc type is selected.
RotationRx
 Gets or sets the rotation of Cross-section about X axis of the of beam.
Weld
 Gets or sets the properties of the connected member to added member weld
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace