IdeaRS.Connections
WeldData Class
Compatible with IDEA StatiCa 0.0
 Represents properties of the weld
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.WeldData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class WeldData : ICopyable
The WeldData type exposes the following members.
Constructors
Name | Description
WeldData
 Constructor
Top
Properties
Name | Description
BeginOffset
EndOffset
IntermittentGap
IntermittentLength
Size
 Gets or sets the size of the weld
WeldMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from the connected member
WeldType
 Gets or sets the type of the weld
Top
Methods
Name | Description
GetShallowCopy
Top
See Also
Reference
IdeaRS.Connections.Data Namespace