IdeaRS.Connections
TimberGussetPlateData Class
Compatible with IDEA StatiCa 0.0
 Represents data for command which creates gusset plate on timber members
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.TimberGussetPlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TimberGussetPlateData : PlateDataBase
The TimberGussetPlateData type exposes the following members.
Constructors
Name | Description
TimberGussetPlateData
Initializes a new instance of the TimberGussetPlateData class
Top
Properties
Name | Description
BoltShearType
CountOfGussetPlates
CountOfMembers
GussetPlateSurfaceOffset
ShearPlaneThread
SinglePlateExtension
TimberGussetMembers
TimberGussetPlateType
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace