IdeaRS.Connections
MemberGeneralWeldData Class
Compatible with IDEA StatiCa 0.0
 Data for General weld on Steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.GeneralWeldData
 IdeaRS.Connections.Data.MemberGeneralWeldData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberGeneralWeldData : GeneralWeldData
The MemberGeneralWeldData type exposes the following members.
Constructors
Name | Description
MemberGeneralWeldData
Initializes a new instance of the MemberGeneralWeldData class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace