IdeaRS.Connections
ColumnWidenerData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ColumnWidenerData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.ColumnWidenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ColumnWidenerData : PlateDataBase
The ColumnWidenerData type exposes the following members.
Constructors
Name | Description
ColumnWidenerData
Initializes a new instance of the ColumnWidenerData class
Top
Properties
Name | Description
ColumnPath
 Gets or sets the column
ConnectedPlatePath
 Gets or sets the object (plate or beam) where stiffener is connected to
Height
 Gets or sets the height of the plate
Offset
 Gets or sets the distance from the ReferencePlane
PositionCode
 Gets or sets the position code
SegmentPartCode
 Gets or sets the code of the segment part Top Flange = 1 Bottom Flange = 2 Both Flanges = 3 Webs = 4 All CSS parts = 7
ShapeParam1
 Gets or sets the the first optional parameter of the shape
ShapeParam2
 Gets or sets the the second optional parameter of the shape
Weld
 Gets or sets the properties of the weld
WidenerShapeCode
 Gets or sets the code of the shape
Width
 Gets or sets the width of the plate
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace