IdeaRS.Connections
StiffenerData Class
Compatible with IDEA StatiCa 0.0
 Represents data for the command which creates the stiffener of the beam segment
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.StiffenerData
 IdeaRS.Connections.Data.MemberTransversalStiffenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class StiffenerData : PlateDataBase
The StiffenerData type exposes the following members.
Constructors
Name | Description
StiffenerData
 Constructor
Top
Properties
Name | Description
CapPlateOffset
Delta
 Gets or sets the distance between repeated stiffeners
Gap
 Gets or sets the gap between the outline of the stiffener and particular plates of the beam
ChamferCorners
 If true corners are chamfered
ChamferSize
 Gets or sets the size of the chamfer
IsCapPlate
Location
 Gets or sets the location of the stiffener
MemberPath
 Gets or sets the member to which the stiffener is connected
NumberOfStiffeners
 Gets or sets the number of stiffeners (the property Delta represents the distance between repeating stiffeners)
OffsetBottom
 Gets or sets the offset of stiffener on the bottom edge.
OffsetTop
 Gets or sets the offset of stiffener on the top edge.
PosOnMember
 Gets or sets the position of the stiffener on the member
ReferenceBoundingBoxSide
 Gets or sets the sides on bounding box of the reference member. Stiffeners will be placed according to these planes
ReferenceMemberPath
 Gets or sets the reference member (stiffeners will be placed according to this member)
RemainingPart
Rotation
 Gets or sets the rotation of the stiffener
StiffenerWidth
 Gets or sets the width of the stiffener
TubeCircStiffDiam
 The diameter of the circular stiffener (tubes)
TubeRectStiffHeight
 The height of the rectangular stiffener (tubes)
TubeRectStiffRotation
 The rotation of the rectangular stiffener (tubes)
TubeRectStiffWidth
 The width of the rectangular stiffener (tubes)
TubeStiffShape
 Shape of the stiffener on tubes
Weld
 Gets or sets the properties of the weld
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace