IdeaRS.Connections
ConcreteBlockData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConcreteBlockData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConcreteBlockData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public sealed class ConcreteBlockData : ConnectionCmdData
The ConcreteBlockData type exposes the following members.
Constructors
Name | Description
ConcreteBlockData
Initializes a new instance of the ConcreteBlockData class
Top
Properties
Name | Description
BasePlateContact
 Influence of mortar joint
BasePlateContactThickness
 Mortar thickness
FoundationBlockHeight
 Gets or sets the value of the offset of the foundation block from the base plate. The value is used for the check of the concrete cone failure.
FoundationBlockOffset
 Gets or sets the value of the offset of the foundation block from the base plate. The value is used for the check of the concrete cone failure.
MatConcreteName
 Gets or sets the name of concrete in the foundation.
ShearForceTransfer
 Gets or sets the method of transfer of shear force to a foundation block
ShearIronCssName
 Gets or sets the identifier of the cross-section of the shear iron
ShearIronLength
 Gets or sets the length of the shear iron
ShearIronPosition
ShearIronRotation
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace