IdeaRS.Connections
MemberAddedMemberData Class
Compatible with IDEA StatiCa 0.0
 Data for Added meber on Steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.AddedMemberData
 IdeaRS.Connections.Data.MemberAddedMemberData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberAddedMemberData : AddedMemberData
The MemberAddedMemberData type exposes the following members.
Constructors
Name | Description
MemberAddedMemberData
Initializes a new instance of the MemberAddedMemberData class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace