IdeaRS.Connections
BeamSegmentStubData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.BeamSegmentStubData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.BeamSegmentStubData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class BeamSegmentStubData : ConnectionCmdData,
	IBoltableData
The BeamSegmentStubData type exposes the following members.
Constructors
Name | Description
BeamSegmentStubData
Initializes a new instance of the BeamSegmentStubData class
Top
Properties
Name | Description
CrossSectionType
EccentricityBeginY
 Gets or sets the local eccentricity Y at the begin of the stub
EccentricityBeginZ
 Gets or sets the local eccentricity Z at the begin of the stub
ExplodeToPlates
Fastening
InclinationBottom
InclinationLeft
InclinationRight
InclinationTop
Plate2Plate
ProfileType
StubPltThickness
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace