IdeaRS.Connections
MemberCutPlateData Class
Compatible with IDEA StatiCa 0.0
 Data for cut of plate on steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.CutPlateData
 IdeaRS.Connections.Data.MemberCutPlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberCutPlateData : CutPlateData
The MemberCutPlateData type exposes the following members.
Constructors
Name | Description
MemberCutPlateData
Initializes a new instance of the MemberCutPlateData class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace