IdeaRS.Connections
GussetPlateData Class
Compatible with IDEA StatiCa 0.0
 Represents data for the command which creates the gusset plate
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.GussetPlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class GussetPlateData : PlateDataBase
The GussetPlateData type exposes the following members.
Constructors
Name | Description
GussetPlateData
 Constructor
Top
Properties
Name | Description
AdjustWebs
 If value is true positions of webs are adjusted according to the edge of the gusset plate
AreWeldedWebs
 If true welds are generated on webs
BottomObjectPath
 Gets or sets the bottom object to which gusset plate is connected
ConnectedWebsPath
 Gets or sets diagonal beam segments which are connected to the gusset plate
CutGussetPlate
 If true the outline of the gusset plate is modified by the connected web
GussetShift
 Gets or sets the shiftting of the gusset plate along the bottom member (only if side member is null)
Height
 Gets or sets the height of the plate
Placement
 Gets or sets the placement of the gusset plate relative to the web
ShapeCode
 Gets or sets the code of the shape
ShapeParam1
 Gets or sets the the first optional parameter of the shape
ShapeParam2
 Gets or sets the the second optional parameter of the shape
SideObjectPath
 Gets or sets the side object to which gusset plate is connected
WebCutOffset
 Gets or sets the offset of the perpendicular cut of the web which is measured from the side object
Weld
 Gets or sets the properties of the weld
Width
 Gets or sets the width of the plate
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace