IdeaRS.Connections
MemberLongitudinalStiffenerData Class
Compatible with IDEA StatiCa 0.0
 Data for longitudinal (horizontal) stiffener on steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.GeneralPlateData
 IdeaRS.Connections.Data.MemberLongitudinalStiffenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberLongitudinalStiffenerData : GeneralPlateData
The MemberLongitudinalStiffenerData type exposes the following members.
Constructors
Name | Description
MemberLongitudinalStiffenerData
Initializes a new instance of the MemberLongitudinalStiffenerData class
Top
Properties
Name | Description
BeginOffsetX
EndOffsetX
OffsetY
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace