IdeaRS.Connections
WorkPlaneData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.WorkPlaneData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.WorkPlaneData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class WorkPlaneData : ConnectionCmdData
The WorkPlaneData type exposes the following members.
Constructors
Name | Description
WorkPlaneData
Initializes a new instance of the WorkPlaneData class
Top
Properties
Name | Description
Method
Param1
Param2
Param3
Plane
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace