IdeaRS.Connections
CutCommandData Class
Compatible with IDEA StatiCa 0.0
 Represents an input parameters for command which cuts an object by a plane
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.CutCommandData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CutCommandData : ConnectionCmdData
The CutCommandData type exposes the following members.
Constructors
Name | Description
CutCommandData
Initializes a new instance of the CutCommandData class
Top
Properties
Name | Description
CuttingPlane
 Gets or sets the cutting plane
ExtendToPlane
 If true object is extended to the cutting plane
IsWeld
 If true welds are generated automatically
Object
 Gets or sets the object to cut
Offset
 Gets or sets the offset of the cut - relative to cutting plane
Orientation
 Gets or sets the orientation of the cut
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace