IdeaRS.Connections
CutBeamData Class
Compatible with IDEA StatiCa 0.0
 Represents an input parameters for command which cuts a beam by a beam, a plate or a workplane
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.CutBeamByBeamData
 IdeaRS.Connections.Data.CutBeamData
 IdeaRS.Connections.Data.MemberCutBeamData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CutBeamData : CutBeamByBeamData
The CutBeamData type exposes the following members.
Constructors
Name | Description
CutBeamData
Initializes a new instance of the CutBeamData class
Top
Properties
Name | Description
CutPartOnMem1
 Cut off part on member 1
CutPartOnMem2
 Cut off part on member 2
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace