IdeaRS.Connections
ConnectionDesignData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectionDesignData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionDesignData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionDesignData
The ConnectionDesignData type exposes the following members.
Constructors
Name | Description
ConnectionDesignData
Initializes a new instance of the ConnectionDesignData class
Top
Properties
Name | Description
CalculationCases
Connection
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace