IdeaRS.Connections
PlateWidenerData Class
Compatible with IDEA StatiCa 0.0
 Represents data for the command which creates plate wideners (or haunches)
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.PlateWidenerData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class PlateWidenerData : PlateDataBase
The PlateWidenerData type exposes the following members.
Constructors
Name | Description
PlateWidenerData
Initializes a new instance of the PlateWidenerData class
Top
Properties
Name | Description
ConnectedPlatePath
 Gets or sets the plate where stiffener is connected to
ExtendedPlatePath
 Gets or sets the extended plate
Height
 Gets or sets the height of the plate
Offset
 Gets or sets the distance from the ReferencePlane
PositionCode
 Gets or sets the position code
ShapeParam1
 Gets or sets the the first optional parameter of the shape
ShapeParam2
 Gets or sets the the second optional parameter of the shape
Weld
 Gets or sets the properties of the weld
WidenerShapeCode
 Gets or sets the code of the shape
Width
 Gets or sets the width of the plate
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace