IdeaRS.Connections
AggregatedPropWrpAttribute Class
Compatible with IDEA StatiCa 0.0
 Represents the attribute which describes the type of the interface, the wrapper and the parameter of the aggregated property format of the string is 'the name of the interface, the name of the wrapper, the name of the parameter'
Inheritance Hierarchy
Object
 Attribute
 IdeaRS.Connections.Data.AggregatedPropWrpAttribute
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class AggregatedPropWrpAttribute : Attribute
The AggregatedPropWrpAttribute type exposes the following members.
Constructors
Name | Description
AggregatedPropWrpAttribute
 Constructor
Top
Properties
Name | Description
PropertyType
 Gets or sets the string which represents the aggregated property : 'the name of the interface, the name of the wrapper, the name of the parameter'
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace