IdeaRS.Connections
ConCalcCaseForces Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConCalcCaseForces"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConCalcCaseForces
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConCalcCaseForces
The ConCalcCaseForces type exposes the following members.
Constructors
Name | Description
ConCalcCaseForces
Initializes a new instance of the ConCalcCaseForces class
Top
Properties
Name | Description
InternalForces
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace