IdeaRS.Connections
ManufacturingSequence Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ManufacturingSequence"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ManufacturingSequence
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ManufacturingSequence
The ManufacturingSequence type exposes the following members.
Constructors
Name | Description
ManufacturingSequence
Initializes a new instance of the ManufacturingSequence class
Top
Properties
Name | Description
Operations
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace