IdeaRS.Connections
CalcCaseData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.CalcCaseData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.CalcCaseData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CalcCaseData
The CalcCaseData type exposes the following members.
Constructors
Name | Description
CalcCaseData
Initializes a new instance of the CalcCaseData class
Top
Properties
Name | Description
ForcesOnSegments
ForcesPercentageOnSegments
CheckEquilibrium
Id
Name
PercentageLoad
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace