IdeaRS.Connections
ConParamInterfacesAttribute Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConParamInterfacesAttribute"]
Inheritance Hierarchy
Object
 Attribute
 IdeaRS.Connections.Data.ConParamInterfacesAttribute
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConParamInterfacesAttribute : Attribute
The ConParamInterfacesAttribute type exposes the following members.
Constructors
Name | Description
ConParamInterfacesAttribute
Initializes a new instance of the ConParamInterfacesAttribute class
Top
Properties
Name | Description
Interfaces
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace