IdeaRS.Connections
ConnectorGridData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectorGridData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectorGridData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectorGridData : ConnectionCmdData,
	IBoltableData
The ConnectorGridData type exposes the following members.
Constructors
Name | Description
ConnectorGridData
Initializes a new instance of the ConnectorGridData class
Top
Properties
Name | Description
AnchorBeamPlatePath
Anchoring
 Gets or sets the properties of the anchoring
AnchorPlatePath
BlockType
 Indicates, whether concrete block exists or should be created new.
ConnectedPlatesPath
 Gets or sets diagonal beam segments which are connected to the gusset plate
ExistingBlockPath
FastenerType
Fastening
 Gets or sets the properties of the fastening
FlangesWeld
 Gets or sets the properties of the weld: flanges of connected member - end plate
MainConnectedBeam
 Gets or sets the main connected beam (if the main plate is part of the connected beam, if it is independent plate this property is null)
MainPlatePath
NewConcreteBlock
PlateSide
ShearLugWeld
 Gets or sets the properties of the weld between the base plate and shear lug
WebWeld
 Gets or sets the properties of the weld: end plate - flanges of connected to member
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace