IdeaRS.Connections
ConnectedBeamCriteria Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectedBeamCriteria"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectedBeamCriteria
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectedBeamCriteria
The ConnectedBeamCriteria type exposes the following members.
Constructors
Name | Description
ConnectedBeamCriteria
Initializes a new instance of the ConnectedBeamCriteria class
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace