IdeaRS.Connections
PlateDataBase Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.PlateDataBase"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 More...
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class PlateDataBase : ConnectionPartDataBase
The PlateDataBase type exposes the following members.
Constructors
Name | Description
PlateDataBase
Initializes a new instance of the PlateDataBase class
Top
Properties
Name | Description
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
ShapeData
 Collection of plate editor data
Thickness
 Gets or sets the thickness of the plate
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.BasePlateData
 IdeaRS.Connections.Data.CleatData
 IdeaRS.Connections.Data.ColumnWidenerData
 IdeaRS.Connections.Data.EndPlateDataBase
 IdeaRS.Connections.Data.FinPlateData
 IdeaRS.Connections.Data.GeneralPlateData
 IdeaRS.Connections.Data.GussetData
 IdeaRS.Connections.Data.GussetPlateData
 IdeaRS.Connections.Data.PlateWidenerData
 IdeaRS.Connections.Data.RibData
 IdeaRS.Connections.Data.SpliceData
 IdeaRS.Connections.Data.StiffenerData
 IdeaRS.Connections.Data.TimberConnectingPlateData
 IdeaRS.Connections.Data.TimberGussetMemberData
 IdeaRS.Connections.Data.TimberGussetPlateData
 IdeaRS.Connections.Data.TonguePlateData