IdeaRS.Connections
Plate2PlateData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.Plate2PlateData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.EndPlateDataBase
 IdeaRS.Connections.Data.Plate2PlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class Plate2PlateData : EndPlateDataBase,
	IBoltableData
The Plate2PlateData type exposes the following members.
Constructors
Name | Description
Plate2PlateData
 Constructor
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
Fastening
 Gets or sets the properties of the anchoring
FlangesWeld
 Gets or sets the properties of the weld - flanges
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member2
 Gets or sets the second connected member
PositionOnMember1
 Gets or sets the position of the plate (measured on the reference line of the beam segment)
Weld
 Gets or sets the properties of the weld - other parts
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace