IdeaRS.Connections
ConnectionPropData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectionPropData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionPropData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionPropData
The ConnectionPropData type exposes the following members.
Constructors
Name | Description
ConnectionPropData()
Initializes a new instance of the ConnectionPropData class
ConnectionPropData(ConnectionPropData)
Initializes a new instance of the ConnectionPropData class
Top
Properties
Name | Description
Items
Top
Methods
Name | Description
Add
Top
See Also
Reference
IdeaRS.Connections.Data Namespace