IdeaRS.Connections
MemberOpeningData Class
Compatible with IDEA StatiCa 0.0
 Data for opening on steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.PlateOpeningData
 IdeaRS.Connections.Data.MemberOpeningData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberOpeningData : PlateOpeningData
The MemberOpeningData type exposes the following members.
Constructors
Name | Description
MemberOpeningData
Initializes a new instance of the MemberOpeningData class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace