IdeaRS.Connections
MemberCutBeamData Class
Compatible with IDEA StatiCa 0.0
 Data for Cut of stiffening member positioned on Steel member
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.CutBeamByBeamData
 IdeaRS.Connections.Data.CutBeamData
 IdeaRS.Connections.Data.MemberCutBeamData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class MemberCutBeamData : CutBeamData
The MemberCutBeamData type exposes the following members.
Constructors
Name | Description
MemberCutBeamData
Initializes a new instance of the MemberCutBeamData class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace