IdeaRS.Connections
ConnectionPartDataBase Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectionPartDataBase"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.CreateSegmentCommandData
 IdeaRS.Connections.Data.PlateDataBase
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class ConnectionPartDataBase : ConnectionCmdData
The ConnectionPartDataBase type exposes the following members.
Constructors
Name | Description
ConnectionPartDataBase
Initializes a new instance of the ConnectionPartDataBase class
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace