IdeaRS.Connections
EndPlateData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.EndPlateData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.EndPlateDataBase
 IdeaRS.Connections.Data.EndPlateData
 IdeaRS.Connections.Data.EndPlateOnFlangesData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class EndPlateData : EndPlateDataBase,
	IBoltableData
The EndPlateData type exposes the following members.
Constructors
Name | Description
EndPlateData
 Constructor
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BackingPlateOffset
BackingPlateOffsetBottom
BackingPlateOffsetTop
BackingPlateThickness
CreateNotch
 If true notch is generated automatically
Fastening
 Gets or sets the properties of the anchoring
IsBackingPlate
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member2
 Gets or sets the second connected member
MemberFlangesWeld
 Gets or sets the properties of the weld: flanges of connected member - end plate
MemberWeld
 Gets or sets the properties of the weld: web of connected member - end plate
NotchOffset
 Gets or sets the value for notch offset
PlateWeld
 Gets or sets the properties of the weld: end plate - flanges of connected to member
RelatedMember
 Gets or sets the related member (other members are connected to this member)
RelatedPlate
 Gets or sets the related plate (other member are connected to this plate)
RemainingPart1
 Gets or sets the information, whether end plate is at the begin or at the end of added member.
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace