IdeaRS.Connections
GeneralWeldData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.GeneralWeldData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.GeneralWeldData
 IdeaRS.Connections.Data.MemberGeneralWeldData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class GeneralWeldData : ConnectionCmdData
The GeneralWeldData type exposes the following members.
Constructors
Name | Description
GeneralWeldData
Initializes a new instance of the GeneralWeldData class
Top
Properties
Name | Description
SurfaceEdgeInx
Weld
 Gets or sets the properties of the connected member to plate weld
WeldedEdgeIndexes
WeldedEdgeInx
WeldedMemberEdgePath
WeldedMemberSurfacePath
WeldedPlateEdgePath
WeldedPlateSurfacePath
WeldPlacement
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace