IdeaRS.Connections
CutPlateData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.CutPlateData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.CutPlateData
 IdeaRS.Connections.Data.MemberCutPlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CutPlateData : ConnectionCmdData
The CutPlateData type exposes the following members.
Constructors
Name | Description
CutPlateData
Initializes a new instance of the CutPlateData class
Top
Properties
Name | Description
CuttingMemberPath
 Gets or sets the member which owns the plate which is supposed to modify
CuttingPlatePath
 Gets or sets the cutting plane
CuttingSurface
 Gets or sets the surface of the cutting plane
FlangesWeld
 Gets or sets the properties of the weld - flanges
IsWeld
 If true welds are generated automatically
Method
 The type of cut type in case: cut by beam.
ModifiedMemberPath
 Gets or sets the member which owns the plate which is supposed to modify
ModifiedPlatePath
 Gets or sets the object to cut
Offset
 Gets or sets the offset of the cut - relative to cutting plane
PlateAdjustment
RemainingPart
 Gets or sets the part of the modified item which remains in the model of connection
Weld
 Gets or sets the properties of the connected member to plate weld - other plate.ConnectionPartType than WEB
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace