IdeaRS.Connections
TonguePlateData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.TonguePlateData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.TonguePlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TonguePlateData : PlateDataBase,
	IBoltableData
The TonguePlateData type exposes the following members.
Constructors
Name | Description
TonguePlateData
 Constructor
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BottomObjectPath
 Gets or sets the bottom object to which gusset plate is connected
ConnectedMemberPath
 Gets or sets diagonal beam segment which is connected to the gusset plate
ConnectedTo
 Gets or sets the information about the item which will be connected to the member.
ConnectedToPlatePath
 Gets or sets the bottom object to which gusset plate is connected
ConnectionAlignment
 Gets or sets the placement of the gusset plate relative to the web
ConnectionLidOffsets
ConnectionLidShape
ConnectionLidThickness
ConnectionOverlap
ConnectionTongueExcentricity
ConnectionTongueLength
ConnectionTongueType
ConnectionTongueWidth
ConnectionType
 Gets or sets the type of connection of two parts.
ConnectionXposition
 Gets or sets the size of x position from connection point.
ConPltMaterialName
 Gets or sets the name of the material of connectiong plate (cap) If value is null or empty material is taken from column
Fastening
 Gets or sets the properties of the anchoring
InsideWeldLength
LidWeld
 Gets or sets the properties of the weld of the lid to connected member.
PlateAngle
 Gets or sets the inclination of new plate to related member;
PlateHeight
 Gets or sets the height of the plate
PlatePositionX
 Gets or sets the position of new plate along related member;
PlateShapeCode
 Gets or sets the code of the shape
PlateShapeParam1
 Gets or sets the the first optional parameter of the shape
PlateShapeParam2
 Gets or sets the the second optional parameter of the shape
PlateThickness
 Gets or sets the thickness of the plate
PlateWeld
 Gets or sets the properties of the plate to related to member weld
PlateWidth
 Gets or sets the width of the plate
RemainingPart
 Gets or sets the information, whether end plate is at the begin or at the end of added member.
SideObjectPath
 Gets or sets the side object to which gusset plate is connected
TonguePlateWeld
 Gets or sets the properties of the weld of the tongue plate to "gusset" plate.
Weld
 Gets or sets the properties of the weld of tongue plate to connected member or to lid.
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace