IdeaRS.Connections
ConnectionItemAttribute Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.ConnectionItemAttribute"]
Inheritance Hierarchy
Object
 Attribute
 IdeaRS.Connections.Data.ConnectionItemAttribute
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConnectionItemAttribute : Attribute
The ConnectionItemAttribute type exposes the following members.
Constructors
Name | Description
ConnectionItemAttribute
Initializes a new instance of the ConnectionItemAttribute class
Top
Properties
Name | Description
PropertyType
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace