IdeaRS.Connections
EndPlateDataBase Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.EndPlateDataBase"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.EndPlateDataBase
 IdeaRS.Connections.Data.EndPlateData
 IdeaRS.Connections.Data.Plate2PlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class EndPlateDataBase : PlateDataBase
The EndPlateDataBase type exposes the following members.
Constructors
Name | Description
EndPlateDataBase
Initializes a new instance of the EndPlateDataBase class
Top
Properties
Name | Description
ConnectionType
 Gets or sets the type of connection of two parts.
InnerRadius
 Gets or sets the inner radius of the circular plate boundary.
OffsetBottom
 Gets or sets the bottom offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetLeft
 Gets or sets the left offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetRight
 Gets or sets the right offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
OffsetTop
 Gets or sets the top offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
OuterRadius
 Gets or sets the outer radius of the circular plate boundary.
PlateSizeMethod
 Gets or sets the method of the definition of dimensions of the plate
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace