IdeaRS.Connections
DissipativeItemCommandData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.DissipativeItemCommandData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.DissipativeItemCommandData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class DissipativeItemCommandData : ConnectionCmdData
The DissipativeItemCommandData type exposes the following members.
Constructors
Name | Description
DissipativeItemCommandData
Initializes a new instance of the DissipativeItemCommandData class
Top
Properties
Name | Description
DissipativePartPaths
 List of connection parts responsible for dissipating of energy occured during sesmic situation.
Setting
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace