IdeaRS.Connections
CleatData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.CleatData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.CleatData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class CleatData : PlateDataBase, IBoltableData
The CleatData type exposes the following members.
Constructors
Name | Description
CleatData
 Constructor
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
Anchoring2
 Gets or sets the properties of the anchoring
BehindMemberPlate
 Get or sets if cleat is located behind the plate of first member
ConnectedMember2Part
 Gets or sets the connected member part flange, web, ...
ConnectedMember2Path
 Gets or sets connected member number 2 using cleat.
ConnectedMemberPart
 Gets or sets the connected member part flange, web, ...
ConnectedMemberPath
 Gets or sets connected member number 1 using cleat.
ConnectedPlatePath
 Gets or sets the connected plate number 1 using cleat.
ConnectedToMemberPath
 Gets or sets the connected to member (connected member is connected to this member).
ConnectedToPlatePath
 Gets or sets the connected to plate item (connected member is connected to this plate).
ConnectionType
 Gets or sets the type of connection of two parts.
CreateNotch
Fastening
 Gets or sets the properties of the anchoring
Fastening2
 Gets or sets the properties of the anchoring
Length
NotchOffset
Offset
 Gets or sets the offset of the cut - relative to cutting plane
Position
 Gets or sets the placement of the cleat to the web (one / two / both)
ProfileConversely
ProfileName
RemainingPart
 Gets or sets the information, whether cleat is at the begin or at the end of added member.
RemainingPart2
 Gets or sets the information, whether cleat is at the begin or at the end of added member.
SameBoltsOnLegs
Shift
Weld
 Gets or sets the properties of the connected member to plate weld
Weld2
 Gets or sets the properties of the 'Connected to' weld
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace