IdeaRS.Connections
BasePlateAnchoringData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.BasePlateAnchoringData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.BasePlateAnchoringData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class BasePlateAnchoringData : ConnectionCmdData
The BasePlateAnchoringData type exposes the following members.
Constructors
Name | Description
BasePlateAnchoringData
Initializes a new instance of the BasePlateAnchoringData class
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BasePlatePath
 Gets or sets the bease plate of the anchoring
Top
Methods
Name | Description
Top
See Also
Reference
IdeaRS.Connections.Data Namespace